{
  "name": "Rule w exceptions",
  "description": "Sample rule with exception list",
  "rule_id": "query-with-exceptions",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "20s",
  "exceptions_list": [{ "id": "cf558f00-c229-11ea-919f-6f996cd3f0ac", "namespace_type": "single", "type": "endpoint" }]
}
