{
  "name": "Query with a rule id",
  "description": "Query with a rule_id that acts like an external id",
  "rule_id": "query-rule-id",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "user.name: root or user.name: admin"
}
