{
  "name": "Rule w exceptions",
  "description": "Sample rule with exception list",
  "rule_id": "query-with-exceptions",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "exceptions_list": [{ "id": "dc3b51d0-362f-11eb-b7fd-b7eb2584d235", "list_id": "detection_list", "namespace_type": "single", "type": "detection" }]
}
