{
  "name": "Rule w exceptions",
  "description": "Sample rule with exception list",
  "rule_id": "query-with-exceptions",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "exceptions_list": [{ "id": "55acf6b0-89d9-11ec-9a39-157f181d84ab", "list_id": "simple_list", "namespace_type": "single", "type": "detection" }]
}
