{
  "name": "Rule w exceptions",
  "description": "Sample rule with exception list",
  "rule_id": "query-with-exceptions",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "exceptions_list": [{ "id": "ID_HERE", "namespace_type": "single", "type": "endpoint" }]
}
