{
  "rule_id": "query-rule-id",
  "interval": "6m",
  "name": "Some new name",
  "description": "Changing the interval and risk score",
  "type": "query",
  "query": "user.name: root or user.name: admin",
  "severity": "low",
  "risk_score": 0
}
