{
  "name": "Query with a list",
  "description": "Query with a list",
  "rule_id": "query-with-list",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "user.name: root or user.name: admin",
  "exceptions_list": [{ "id": "some_updated_fake_id", "namespace_type": "single" }]
}
