{
  "name": "Rule 1",
  "description": "Sample rule with single exception list",
  "rule_id": "query-with-single-exception-list",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "exceptions_list": [{ "id": "69c82270-3ee5-11ed-b021-1b8d642b8988", "list_id": "simple_list", "namespace_type": "single", "type": "detection" }]
}
