{
  "@timestamp": "2026-02-12T16:20:14.434Z",
  "event": {
    "id": "9__f4o5MUM2rC1gn4Wnp",
    "module": "security",
    "dataset": "alerting-rules",
    "action": "rule-update",
    "type": "change",
    "outcome": "success",
    "group": {
      "id": "294be1ba4264f077e33f656df8c633f5"
    }
  },
  "kibana": {
    "space_id": "default",
    "version": "9.4.0"
  },
  "user": {
    "id": "elastic"
  },
  "object": {
    "changes": [
      "actions",
      "updatedAt",
      "revision",
      "params.meta.kibana_siem_app_url",
      "params.timestampOverrideFallbackDisabled",
      "params.filters"
    ],
    "oldvalues": {
      "actions": [],
      "updatedAt": "2026-02-11T14:00:58.733Z",
      "revision": 0
    },
    "id": "4287d39f-4404-4b20-8a11-762a8339c6e8",
    "type": "alert",
    "hash": "ed93977ee74861cfa40c252b356341ed8ead8474ed91be87c28a440195e25a6d",
    "snapshot": {
      "name": "Remote File Download via Desktopimgdownldr Utility",
      "tags": [
        "Domain: Endpoint",
        "OS: Windows",
        "Use Case: Threat Detection",
        "Tactic: Command and Control",
        "Resources: Investigation Guide",
        "Data Source: Elastic Endgame",
        "Data Source: Elastic Defend",
        "Data Source: Windows Security Event Logs",
        "Data Source: Microsoft Defender for Endpoint",
        "Data Source: SentinelOne",
        "Data Source: Sysmon",
        "Data Source: Crowdstrike"
      ],
      "enabled": false,
      "alertTypeId": "siem.eqlRule",
      "consumer": "siem",
      "legacyId": null,
      "schedule": {
        "interval": "5m"
      },
      "actions": [
        {
          "params": {
            "message": "Rule {{context.rule.name}} generated {{state.signals_count}} alerts",
            "to": [
              "test@test.com"
            ],
            "subject": "tests"
          },
          "actionTypeId": ".email",
          "frequency": {
            "summary": true,
            "notifyWhen": "onActiveAlert",
            "throttle": null
          },
          "group": "default",
          "uuid": "30feab82-0997-486f-b2bf-ac22005cda2d",
          "actionRef": "action_0"
        }
      ],
      "params": {
        "author": [
          "Elastic"
        ],
        "description": "Identifies the desktopimgdownldr utility being used to download a remote file. An adversary may use desktopimgdownldr to download arbitrary files as an alternative to certutil.",
        "note": "## Triage and analysis\n\n### Investigating Remote File Download via Desktopimgdownldr Utility\n\nAttackers commonly transfer tooling or malware from external systems into a compromised environment using the command and control channel. However, they can also abuse signed utilities to drop these files.\n\nThe `Desktopimgdownldr.exe` utility is used to to configure lockscreen/desktop image, and can be abused with the `lockscreenurl` argument to download remote files and tools, this rule looks for this behavior.\n\n> **Note**:\n> This investigation guide uses the [Osquery Markdown Plugin](https://www.elastic.co/guide/en/security/current/invest-guide-run-osquery.html) introduced in Elastic Stack version 8.5.0. Older Elastic Stack versions will display unrendered Markdown in this guide.\n> This investigation guide uses the [Investigate Markdown Plugin](https://www.elastic.co/guide/en/security/current/interactive-investigation-guides.html) introduced in Elastic Stack version 8.8.0. Older Elastic Stack versions will display unrendered Markdown in this guide.\n\n#### Possible investigation steps\n\n- Investigate the process execution chain (parent process tree) for unknown processes. Examine their executable files for prevalence, whether they are located in expected locations, and if they are signed with valid digital signatures.\n- Identify the user account that performed the action and whether it should perform this kind of action.\n- Contact the account owner and confirm whether they are aware of this activity.\n- Investigate other alerts associated with the user/host during the past 48 hours.\n  - !{investigate{\"label\":\"Alerts associated with the user in the last 48h\",\"providers\":[[{\"excluded\":false,\"field\":\"event.kind\",\"queryType\":\"phrase\",\"value\":\"signal\",\"valueType\":\"string\"},{\"excluded\":false,\"field\":\"user.id\",\"queryType\":\"phrase\",\"value\":\"{{user.id}}\",\"valueType\":\"string\"}]],\"relativeFrom\":\"now-48h/h\",\"relativeTo\":\"now\"}}\n  - !{investigate{\"label\":\"Alerts associated with the host in the last 48h\",\"providers\":[[{\"excluded\":false,\"field\":\"event.kind\",\"queryType\":\"phrase\",\"value\":\"signal\",\"valueType\":\"string\"},{\"excluded\":false,\"field\":\"host.name\",\"queryType\":\"phrase\",\"value\":\"{{host.name}}\",\"valueType\":\"string\"}]],\"relativeFrom\":\"now-48h/h\",\"relativeTo\":\"now\"}}\n- Assess whether this behavior is prevalent in the environment by looking for similar occurrences across hosts.\n- Check the reputation of the domain or IP address used to host the downloaded file or if the user downloaded the file from an internal system.\n- Examine the host for derived artifacts that indicate suspicious activities:\n  - Analyze the file using a private sandboxed analysis system.\n  - Observe and collect information about the following activities in both the sandbox and the alert subject host:\n    - Attempts to contact external domains and addresses.\n      - Use the Elastic Defend network events to determine domains and addresses contacted by the subject process by filtering by the process' `process.entity_id`.\n        - !{investigate{\"label\":\"Investigate the Subject Process Network Events\",\"providers\":[[{\"excluded\":false,\"field\":\"event.category\",\"queryType\":\"phrase\",\"value\":\"network\",\"valueType\":\"string\"},{\"excluded\":false,\"field\":\"process.entity_id\",\"queryType\":\"phrase\",\"value\":\"{{process.entity_id}}\",\"valueType\":\"string\"}]]}}\n      - Examine the DNS cache for suspicious or anomalous entries.\n        - !{osquery{\"label\":\"Osquery - Retrieve DNS Cache\",\"query\":\"SELECT * FROM dns_cache\"}}\n    - Use the Elastic Defend registry events to examine registry keys accessed, modified, or created by the related processes in the process tree.\n    - Examine the host services for suspicious or anomalous entries.\n      - !{osquery{\"label\":\"Osquery - Retrieve All Services\",\"query\":\"SELECT description, display_name, name, path, pid, service_type, start_type, status, user_account FROM services\"}}\n      - !{osquery{\"label\":\"Osquery - Retrieve Services Running on User Accounts\",\"query\":\"SELECT description, display_name, name, path, pid, service_type, start_type, status, user_account FROM services WHERE\\nNOT (user_account LIKE '%LocalSystem' OR user_account LIKE '%LocalService' OR user_account LIKE '%NetworkService' OR\\nuser_account == null)\\n\"}}\n      - !{osquery{\"label\":\"Osquery - Retrieve Service Unsigned Executables with Virustotal Link\",\"query\":\"SELECT concat('https://www.virustotal.com/gui/file/', sha1) AS VtLink, name, description, start_type, status, pid,\\nservices.path FROM services JOIN authenticode ON services.path = authenticode.path OR services.module_path =\\nauthenticode.path JOIN hash ON services.path = hash.path WHERE authenticode.result != 'trusted'\\n\"}}\n  - Retrieve the files' SHA-256 hash values using the PowerShell `Get-FileHash` cmdlet and search for the existence and reputation of the hashes in resources like VirusTotal, Hybrid-Analysis, CISCO Talos, Any.run, etc.\n- Investigate potentially compromised accounts. Analysts can do this by searching for login events (for example, 4624) to the target host after the registry modification.\n\n### False positive analysis\n\n- This activity is unusual but can be done by administrators. Benign true positives (B-TPs) can be added as exceptions if necessary.\n- Analysts can dismiss the alert if the downloaded file is a legitimate image.\n\n### Response and remediation\n\n- Initiate the incident response process based on the outcome of the triage.\n- Isolate the involved host to prevent further post-compromise behavior.\n- If the triage identified malware, search the environment for additional compromised hosts.\n  - Implement temporary network rules, procedures, and segmentation to contain the malware.\n  - Stop suspicious processes.\n  - Immediately block the identified indicators of compromise (IoCs).\n  - Inspect the affected systems for additional malware backdoors like reverse shells, reverse proxies, or droppers that attackers could use to reinfect the system.\n- Remove and block malicious artifacts identified during triage.\n- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are identified. Reset passwords for these accounts and other potentially compromised credentials, such as email, business systems, and web services.\n- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and malware components.\n- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.\n- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).\n",
        "falsePositives": [],
        "from": "now-9m",
        "ruleId": "15c0b7a7-9c34-4869-b25b-fa6518414899",
        "immutable": true,
        "ruleSource": {
          "type": "external",
          "isCustomized": false,
          "customizedFields": [],
          "hasBaseVersion": true
        },
        "license": "Elastic License v2",
        "outputIndex": "",
        "meta": {
          "kibana_siem_app_url": ""
        },
        "maxSignals": 100,
        "riskScore": 47,
        "riskScoreMapping": [],
        "severity": "medium",
        "severityMapping": [],
        "timestampOverride": "event.ingested",
        "timestampOverrideFallbackDisabled": false,
        "threat": [
          {
            "framework": "MITRE ATT&CK",
            "tactic": {
              "id": "TA0011",
              "name": "Command and Control",
              "reference": "https://attack.mitre.org/tactics/TA0011/"
            },
            "technique": [
              {
                "id": "T1105",
                "name": "Ingress Tool Transfer",
                "reference": "https://attack.mitre.org/techniques/T1105/"
              }
            ]
          }
        ],
        "to": "now",
        "references": [
          "https://labs.sentinelone.com/living-off-windows-land-a-new-native-file-downldr/"
        ],
        "version": 318,
        "exceptionsList": [],
        "relatedIntegrations": [
          {
            "package": "endpoint",
            "version": "^9.0.0"
          },
          {
            "package": "windows",
            "version": "^3.0.0"
          },
          {
            "package": "system",
            "version": "^2.0.0"
          },
          {
            "package": "m365_defender",
            "version": "^3.0.0"
          },
          {
            "package": "sentinel_one_cloud_funnel",
            "version": "^1.9.0"
          },
          {
            "package": "crowdstrike",
            "version": "^1.51.0"
          }
        ],
        "requiredFields": [
          {
            "name": "event.type",
            "type": "keyword",
            "ecs": true
          },
          {
            "name": "host.os.type",
            "type": "keyword",
            "ecs": true
          },
          {
            "name": "process.args",
            "type": "keyword",
            "ecs": true
          },
          {
            "name": "process.name",
            "type": "keyword",
            "ecs": true
          },
          {
            "name": "process.pe.original_file_name",
            "type": "keyword",
            "ecs": true
          }
        ],
        "setup": "",
        "type": "eql",
        "language": "eql",
        "index": [
          "endgame-*",
          "logs-crowdstrike.fdr*",
          "logs-endpoint.events.process-*",
          "logs-m365_defender.event-*",
          "logs-sentinel_one_cloud_funnel.*",
          "logs-system.security*",
          "logs-windows.forwarded*",
          "logs-windows.sysmon_operational-*",
          "winlogbeat-*"
        ],
        "query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  (process.name : \"desktopimgdownldr.exe\" or ?process.pe.original_file_name == \"desktopimgdownldr.exe\") and\n  process.args : \"/lockscreenurl:http*\"\n",
        "filters": []
      },
      "mapped_params": {
        "risk_score": 47,
        "severity": "40-medium"
      },
      "createdBy": "elastic",
      "updatedBy": "elastic",
      "createdAt": "2026-02-11T14:00:58.733Z",
      "updatedAt": "2026-02-12T16:20:11.421Z",
      "apiKey": null,
      "apiKeyOwner": null,
      "apiKeyCreatedByUser": null,
      "throttle": null,
      "notifyWhen": null,
      "muteAll": false,
      "mutedInstanceIds": [],
      "executionStatus": {
        "status": "pending",
        "lastExecutionDate": "2026-02-11T14:00:58.733Z"
      },
      "monitoring": {
        "run": {
          "history": [],
          "calculated_metrics": {
            "success_ratio": 0
          },
          "last_run": {
            "timestamp": "2026-02-11T14:00:58.733Z",
            "metrics": {
              "duration": 0,
              "total_search_duration_ms": null,
              "total_indexing_duration_ms": null,
              "total_alerts_detected": null,
              "total_alerts_created": null,
              "gap_duration_s": null
            }
          }
        }
      },
      "snoozeSchedule": [],
      "revision": 1,
      "running": false,
      "artifacts": {
        "dashboards": [],
        "investigation_guide": {
          "blob": ""
        }
      },
      "meta": {
        "versionApiKeyLastmodified": "9.4.0"
      }
    }
  }
}