{
  "rule_id": "saved-query-2",
  "risk_score": 5,
  "description": "Detecting root and admin users",
  "index": ["auditbeat-*", "filebeat-*", "packetbeat-*", "winlogbeat-*"],
  "interval": "5m",
  "name": "Detect Root/Admin Users",
  "severity": "high",
  "output_index": ".siem-signals",
  "type": "saved_query",
  "from": "now-6m",
  "to": "now",
  "saved_id": "Test Query From SIEM Two",
  "query": "user.name: root or user.name: admin",
  "language": "kuery"
}
