{
  "rule_id": "query-rule-id",
  "timeline_id": "other-timeline-id",
  "timeline_title": "other-timeline-title",
  "name": "Some new name",
  "description": "Adding tags and a few other updates such as name",
  "type": "query",
  "query": "user.name: root or user.name: admin",
  "severity": "low",
  "risk_score": 10
}
