{"id":"7921d4f0-14b1-11ec-b006-c78103a098fd","updated_at":"2021-09-13T16:41:41.591Z","updated_by":"elastic","created_at":"2021-09-13T16:41:41.591Z","created_by":"elastic","name":"New Rule Test","tags":[],"interval":"100m","enabled":false,"description":"The new rule description.","risk_score":17,"severity":"high","output_index":".siem-signals-default","author":[],"false_positives":[],"from":"now-50000h","rule_id":"rule_testing","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["exceptions-*"],"query":"host.name: *","throttle":"no_actions","actions":[]}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
