{"id":"3e284ab0-5862-11ec-b7ea-a3a4654b19e1","updated_at":"2021-12-09T19:21:13.557Z","updated_by":"elastic","created_at":"2021-12-08T20:05:52.385Z","created_by":"elastic","name":"Test Custom Rule","tags":[],"interval":"1m","enabled":true,"description":"Test Custom Rule","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-siem-estc-dev-default","meta":{"from":"100m","kibana_siem_app_url":"https://kibana.siem.estc.dev/app/security"},"author":[],"false_positives":[],"from":"now-6060s","rule_id":"cc646fc2-37a4-4858-af1a-e09b00b15c9e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[{"id":"2b50cb60-5925-11ec-a0e8-65c8bb7e794f","list_id":"b8dfd17f-1e11-41b0-ae7e-9e7f8237de49","type":"detection","namespace_type":"single"}],"immutable":false,"type":"query","language":"kuery","index":["test*"],"query":"file.hash.md5 : *","filters":[],"throttle":"no_actions","actions":[]}
{"_version":"WzM1NTcxLDFd","created_at":"2021-12-09T19:21:11.702Z","created_by":"elastic","description":"Test Custom Rule","id":"2b50cb60-5925-11ec-a0e8-65c8bb7e794f","immutable":false,"list_id":"b8dfd17f-1e11-41b0-ae7e-9e7f8237de49","name":"Test Custom Rule","namespace_type":"single","os_types":[],"tags":[],"tie_breaker_id":"491414df-26f4-4c15-9cfa-0b1e1604330c","type":"detection","updated_at":"2021-12-09T19:21:11.709Z","updated_by":"elastic","version":1}
{"_version":"Wzg4Mjc4LDJd","comments":[],"created_at":"2021-12-13T07:01:23.261Z","created_by":"yara.tecero@elastic.co","description":"Test Custom Rule - exception list item","entries":[{"field":"file.hash.md5","operator":"included","type":"exists"}],"id":"7b6536d0-5be2-11ec-bb9b-d70de62f20d7","item_id":"3daf7dbd-3ab9-40a4-b8e4-1ef1546b0950","list_id":"b8dfd17f-1e11-41b0-ae7e-9e7f8237de49","name":"Test Custom Rule - exception list item","namespace_type":"single","os_types":[],"tags":[],"tie_breaker_id":"f302e67e-dc48-492d-bdc3-032051a1ccca","type":"simple","updated_at":"2021-12-13T07:01:23.269Z","updated_by":"yara.tecero@elastic.co"}
{"exported_count":3,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":1,"exported_exception_list_item_count":1,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
