{"id":"9c1edd00-f295-11ec-9364-efba6927d0cf","updated_at":"2022-06-23T05:22:07.774Z","updated_by":"elastic","created_at":"2022-06-23T01:41:32.501Z","created_by":"elastic","name":"Related integrations rule","tags":["Test"],"interval":"5m","enabled":false,"description":"Related Integration.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":"","meta":{"from":"5m"},"rule_name_override":"message","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-600s","rule_id":"2c66bf23-6ae9-4eb2-859e-446bea181ae0","max_signals":10000,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"related_integrations":[{"package":"endpoint","integration":"security","version":"~8.3.0"},{"package":"aws","integration":"cloudfront","version":"~1.11.0"},{"package":"aws","integration":"cloudtrail","version":"~1.11.0"},{"package":"aws","integration":"route53","version":"~1.11.0"},{"package":"unknown","integration":"unknown","version":"^1.2.3"},{"package":"unknown2","version":"4.5.6"}],"required_fields":[{"ecs":true,"name":"event.code","type":"keyword"},{"ecs":true,"name":"message","type":"match_only_text"},{"ecs":false,"name":"winlog.event_data.AttributeLDAPDisplayName","type":"keyword"},{"ecs":false,"name":"winlog.event_data.AttributeValue","type":"keyword"},{"ecs":false,"name":"winlog.event_data.ShareName","type":"keyword"},{"ecs":false,"name":"winlog.event_data.RelativeTargetName","type":"keyword"},{"ecs":false,"name":"winlog.event_data.AccessList","type":"keyword"}],"setup":"## Config\n\nThe 'Audit Detailed File Share' audit policy must be configured (Success Failure).\nSteps to implement the logging policy with with Advanced Audit Configuration:\n\n```\nComputer Configuration > \nPolicies > \nWindows Settings > \nSecurity Settings > \nAdvanced Audit Policies Configuration > \nAudit Policies > \nObject Access > \nAudit Detailed File Share (Success,Failure)\n```\n\nThe 'Audit Directory Service Changes' audit policy must be configured (Success Failure).\nSteps to implement the logging policy with with Advanced Audit Configuration:\n\n```\nComputer Configuration > \nPolicies > \nWindows Settings > \nSecurity Settings > \nAdvanced Audit Policies Configuration > \nAudit Policies > \nDS Access > \nAudit Directory Service Changes (Success,Failure)\n```\n","type":"query","language":"kuery","index":["logs-*"],"query":"host.name:*","filters":[],"throttle":"no_actions","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
