{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule identifies a potential port scan. A port scan is a method utilized by attackers to systematically scan a target system or network for open ports, allowing them to identify available services and potential vulnerabilities. By mapping out the open ports, attackers can gather critical information to plan and execute targeted attacks, gaining unauthorized access, compromising security, and potentially leading to data breaches, unauthorized control, or further exploitation of the targeted system or network. This rule proposes threshold logic to check for connection attempts from one source host to 20 or more destination ports.",
        "from": "now-9m",
        "index": [
            "logs-endpoint.events.network-*",
            "logs-network_traffic.*",
            "packetbeat-*"
        ],
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "Potential Network Scan Detected",
        "query": "destination.port :* and event.action: (\"network_flow\" or \"connection_accepted\" or \"connection_attempted\" )\n",
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            },
            {
                "package": "network_traffic",
                "version": "^1.1.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "destination.port",
                "type": "long"
            },
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "rule_id": "0171f283-ade7-4f87-9521-ac346c68cc9b",
        "severity": "medium",
        "tags": [
            "Domain: Network",
            "Tactic: Discovery",
            "Tactic: Reconnaissance",
            "Use Case: Network Security Monitoring"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0007",
                    "name": "Discovery",
                    "reference": "https://attack.mitre.org/tactics/TA0007/"
                },
                "technique": [
                    {
                        "id": "T1046",
                        "name": "Network Service Discovery",
                        "reference": "https://attack.mitre.org/techniques/T1046/"
                    }
                ]
            },
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0043",
                    "name": "Reconnaissance",
                    "reference": "https://attack.mitre.org/tactics/TA0043/"
                },
                "technique": [
                    {
                        "id": "T1595",
                        "name": "Active Scanning",
                        "reference": "https://attack.mitre.org/techniques/T1595/",
                        "subtechnique": [
                            {
                                "id": "T1595.001",
                                "name": "Scanning IP Blocks",
                                "reference": "https://attack.mitre.org/techniques/T1595/001/"
                            }
                        ]
                    }
                ]
            }
        ],
        "threshold": {
            "cardinality": [
                {
                    "field": "destination.port",
                    "value": 20
                }
            ],
            "field": [
                "destination.ip",
                "source.ip"
            ],
            "value": 1
        },
        "type": "threshold",
        "version": 1
    },
    "id": "0171f283-ade7-4f87-9521-ac346c68cc9b_1",
    "type": "security-rule"
}