{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "building_block_type": "default",
        "description": "Identifies child processes of frequently targeted Microsoft Office applications (Word, PowerPoint, Excel) with unusual process arguments and path. This behavior is often observed during exploitation of Office applications or from documents with malicious macros.",
        "from": "now-119m",
        "index": [
            "logs-endpoint.events.*"
        ],
        "interval": "60m",
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Potential Process Injection from Malicious Document",
        "query": "process where host.os.type == \"windows\" and event.action == \"start\" and\n  process.parent.name : (\"excel.exe\", \"powerpnt.exe\", \"winword.exe\") and\n  process.args_count == 1 and\n  process.executable : (\n    \"?:\\\\Windows\\\\SysWOW64\\\\*.exe\", \"?:\\\\Windows\\\\system32\\\\*.exe\"\n  ) and\n  not (process.executable : \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\*\" and\n       process.code_signature.trusted == true and not process.code_signature.subject_name : \"Microsoft *\") and\n  not process.executable : (\n    \"?:\\\\Windows\\\\Sys*\\\\Taskmgr.exe\",\n    \"?:\\\\Windows\\\\Sys*\\\\ctfmon.exe\",\n    \"?:\\\\Windows\\\\System32\\\\notepad.exe\")\n",
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.args_count",
                "type": "long"
            },
            {
                "ecs": true,
                "name": "process.code_signature.subject_name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.code_signature.trusted",
                "type": "boolean"
            },
            {
                "ecs": true,
                "name": "process.executable",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.parent.name",
                "type": "keyword"
            }
        ],
        "risk_score": 21,
        "rule_id": "1c5a04ae-d034-41bf-b0d8-96439b5cc774",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Defense Evasion",
            "Tactic: Privilege Escalation",
            "Tactic: Initial Access",
            "Rule Type: BBR",
            "Data Source: Elastic Defend"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005/"
                },
                "technique": [
                    {
                        "id": "T1055",
                        "name": "Process Injection",
                        "reference": "https://attack.mitre.org/techniques/T1055/"
                    }
                ]
            },
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0004",
                    "name": "Privilege Escalation",
                    "reference": "https://attack.mitre.org/tactics/TA0004/"
                },
                "technique": [
                    {
                        "id": "T1055",
                        "name": "Process Injection",
                        "reference": "https://attack.mitre.org/techniques/T1055/"
                    }
                ]
            },
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0001",
                    "name": "Initial Access",
                    "reference": "https://attack.mitre.org/tactics/TA0001/"
                },
                "technique": [
                    {
                        "id": "T1566",
                        "name": "Phishing",
                        "reference": "https://attack.mitre.org/techniques/T1566/",
                        "subtechnique": [
                            {
                                "id": "T1566.001",
                                "name": "Spearphishing Attachment",
                                "reference": "https://attack.mitre.org/techniques/T1566/001/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 1
    },
    "id": "1c5a04ae-d034-41bf-b0d8-96439b5cc774_1",
    "type": "security-rule"
}