{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Detects Inter-Process Communication with Outlook via Component Object Model from an unusual process. Adversaries may target user email to collect sensitive information or send email on their behalf via API.",
        "from": "now-9m",
        "index": [
            "logs-endpoint.events.*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Suspicious Inter-Process Communication via Outlook",
        "query": "process where host.os.type == \"windows\" and event.action == \"start\" and process.name : \"OUTLOOK.EXE\"  and\n process.Ext.effective_parent.name != null and\n not process.Ext.effective_parent.executable : (\"?:\\\\Program Files\\\\*\", \"?:\\\\Program Files (x86)\\\\*\")\n",
        "references": [
            "https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/master/apt29/Archive/CALDERA_DIY/evals/payloads/stepSeventeen_email.ps1"
        ],
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "process.Ext.effective_parent.executable",
                "type": "unknown"
            },
            {
                "ecs": false,
                "name": "process.Ext.effective_parent.name",
                "type": "unknown"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "rule_id": "1dee0500-4aeb-44ca-b24b-4a285d7b6ba1",
        "severity": "medium",
        "tags": [
            "Elastic",
            "Host",
            "Windows",
            "Threat Detection",
            "Collection"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0009",
                    "name": "Collection",
                    "reference": "https://attack.mitre.org/tactics/TA0009/"
                },
                "technique": [
                    {
                        "id": "T1114",
                        "name": "Email Collection",
                        "reference": "https://attack.mitre.org/techniques/T1114/",
                        "subtechnique": [
                            {
                                "id": "T1114.001",
                                "name": "Local Email Collection",
                                "reference": "https://attack.mitre.org/techniques/T1114/001/"
                            }
                        ]
                    }
                ]
            },
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0002",
                    "name": "Execution",
                    "reference": "https://attack.mitre.org/tactics/TA0002/"
                },
                "technique": [
                    {
                        "id": "T1559",
                        "name": "Inter-Process Communication",
                        "reference": "https://attack.mitre.org/techniques/T1559/",
                        "subtechnique": [
                            {
                                "id": "T1559.001",
                                "name": "Component Object Model",
                                "reference": "https://attack.mitre.org/techniques/T1559/001/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 2
    },
    "id": "1dee0500-4aeb-44ca-b24b-4a285d7b6ba1_2",
    "type": "security-rule"
}