{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "building_block_type": "default",
        "description": "Identifies commands containing references to Outlook data files extensions, which can potentially indicate the search, access, or modification of these files.",
        "from": "now-119m",
        "index": [
            "logs-endpoint.events.*"
        ],
        "interval": "60m",
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Accessing Outlook Data Files",
        "query": "process where host.os.type == \"windows\" and event.type == \"start\" and process.args : (\"*.ost\", \"*.pst\") and\n  not process.name : \"outlook.exe\"\n",
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.args",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            }
        ],
        "risk_score": 21,
        "rule_id": "2e311539-cd88-4a85-a301-04f38795007c",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Collection",
            "Data Source: Elastic Defend",
            "Rule Type: BBR"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0009",
                    "name": "Collection",
                    "reference": "https://attack.mitre.org/tactics/TA0009/"
                },
                "technique": [
                    {
                        "id": "T1114",
                        "name": "Email Collection",
                        "reference": "https://attack.mitre.org/techniques/T1114/",
                        "subtechnique": [
                            {
                                "id": "T1114.001",
                                "name": "Local Email Collection",
                                "reference": "https://attack.mitre.org/techniques/T1114/001/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 1
    },
    "id": "2e311539-cd88-4a85-a301-04f38795007c_1",
    "type": "security-rule"
}