{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "building_block_type": "default",
        "description": "Identifies .lnk shortcut file downloaded from outside the local network. These shortcut files are commonly used in phishing campaigns.",
        "from": "now-119m",
        "index": [
            "logs-endpoint.events.*"
        ],
        "interval": "60m",
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Downloaded Shortcut Files",
        "query": "file where host.os.type == \"windows\" and event.type == \"creation\" and file.extension == \"lnk\" and file.Ext.windows.zone_identifier \u003e 1\n",
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "file.Ext.windows.zone_identifier",
                "type": "unknown"
            },
            {
                "ecs": true,
                "name": "file.extension",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            }
        ],
        "risk_score": 21,
        "rule_id": "39157d52-4035-44a8-9d1a-6f8c5f580a07",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Execution",
            "Data Source: Elastic Defend",
            "Rule Type: BBR"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0002",
                    "name": "Execution",
                    "reference": "https://attack.mitre.org/tactics/TA0002/"
                },
                "technique": [
                    {
                        "id": "T1204",
                        "name": "User Execution",
                        "reference": "https://attack.mitre.org/techniques/T1204/",
                        "subtechnique": [
                            {
                                "id": "T1204.002",
                                "name": "Malicious File",
                                "reference": "https://attack.mitre.org/techniques/T1204/002/"
                            }
                        ]
                    }
                ]
            },
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0001",
                    "name": "Initial Access",
                    "reference": "https://attack.mitre.org/tactics/TA0001/"
                },
                "technique": [
                    {
                        "id": "T1566",
                        "name": "Phishing",
                        "reference": "https://attack.mitre.org/techniques/T1566/",
                        "subtechnique": [
                            {
                                "id": "T1566.001",
                                "name": "Spearphishing Attachment",
                                "reference": "https://attack.mitre.org/techniques/T1566/001/"
                            },
                            {
                                "id": "T1566.002",
                                "name": "Spearphishing Link",
                                "reference": "https://attack.mitre.org/techniques/T1566/002/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 1
    },
    "id": "39157d52-4035-44a8-9d1a-6f8c5f580a07_1",
    "type": "security-rule"
}