{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "building_block_type": "default",
        "description": "Identifies instances of VLC-related DLLs which are not signed by the original developer. Attackers may name their payload as legitimate applications to blend into the environment, or embedding its malicious code within legitimate applications to deceive machine learning algorithms by incorporating authentic and benign code.",
        "from": "now-9m",
        "index": [
            "logs-endpoint.events.*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Potential Masquerading as VLC DLL",
        "query": "library where host.os.type == \"windows\" and event.action == \"load\" and\n  dll.name : (\"libvlc.dll\", \"libvlccore.dll\", \"axvlc.dll\") and\n  not (\n    dll.code_signature.subject_name : (\"VideoLAN\", \"716F2E5E-A03A-486B-BC67-9B18474B9D51\")\n    and dll.code_signature.trusted == true\n  )\n",
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "dll.code_signature.subject_name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "dll.code_signature.trusted",
                "type": "boolean"
            },
            {
                "ecs": true,
                "name": "dll.name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            }
        ],
        "risk_score": 21,
        "rule_id": "4494c14f-5ff8-4ed2-8e99-bf816a1642fc",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "Data Source: Elastic Defend",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Defense Evasion",
            "Tactic: Persistence",
            "Rule Type: BBR"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005/"
                },
                "technique": [
                    {
                        "id": "T1036",
                        "name": "Masquerading",
                        "reference": "https://attack.mitre.org/techniques/T1036/",
                        "subtechnique": [
                            {
                                "id": "T1036.001",
                                "name": "Invalid Code Signature",
                                "reference": "https://attack.mitre.org/techniques/T1036/001/"
                            },
                            {
                                "id": "T1036.005",
                                "name": "Match Legitimate Name or Location",
                                "reference": "https://attack.mitre.org/techniques/T1036/005/"
                            }
                        ]
                    }
                ]
            },
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0003",
                    "name": "Persistence",
                    "reference": "https://attack.mitre.org/tactics/TA0003/"
                },
                "technique": [
                    {
                        "id": "T1554",
                        "name": "Compromise Client Software Binary",
                        "reference": "https://attack.mitre.org/techniques/T1554/"
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 2
    },
    "id": "4494c14f-5ff8-4ed2-8e99-bf816a1642fc_2",
    "type": "security-rule"
}