{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule monitors for network connectivity to the internet from a previously unknown executable located in a suspicious directory to a previously unknown destination ip. An alert from this rule can indicate the presence of potentially malicious activity, such as the execution of unauthorized or suspicious processes attempting to establish connections to unknown or suspicious destinations such as a command and control server. Detecting and investigating such behavior can help identify and mitigate potential security threats, protecting the system and its data from potential compromise.",
        "from": "now-59m",
        "history_window_start": "now-7d",
        "index": [
            "auditbeat-*",
            "filebeat-*",
            "packetbeat-*",
            "logs-endpoint.events.*",
            "endgame-*"
        ],
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "Suspicious Network Activity to the Internet by Previously Unknown Executable",
        "new_terms_fields": [
            "destination.ip",
            "process.executable"
        ],
        "query": "host.os.type:linux and event.category:network and \nevent.action:(connection_attempted or ipv4_connection_attempt_event) and \nprocess.executable : ( \n    (/etc/crontab or \n     /etc/rc.local or \n     /boot/* or \n     /dev/shm/* or \n     /etc/cron.*/* or \n     /etc/init.d/* or \n     /etc/rc*.d/* or \n     /etc/update-motd.d/* or \n     /home/*/.* or \n     /run/* or \n     /srv/* or \n     /tmp/* or \n     /usr/lib/update-notifier/* or \n     /var/tmp/*) and \n     not (/usr/bin/apt or \n          /usr/bin/curl or \n          /usr/bin/dnf or \n          /usr/bin/dockerd or \n          /usr/bin/dpkg or \n          /usr/bin/rpm or \n          /usr/bin/wget or \n          /usr/bin/yum) \n    ) \nand source.ip : ( \n    10.0.0.0/8 or \n    127.0.0.0/8 or \n    172.16.0.0/12 or \n    192.168.0.0/16) and \n    not destination.ip : ( \n        10.0.0.0/8 or \n        100.64.0.0/10 or \n        127.0.0.0/8 or \n        169.254.0.0/16 or \n        172.16.0.0/12 or \n        192.0.0.0/24 or \n        192.0.0.0/29 or \n        192.0.0.10/32 or \n        192.0.0.170/32 or \n        192.0.0.171/32 or \n        192.0.0.8/32 or \n        192.0.0.9/32 or \n        192.0.2.0/24 or \n        192.168.0.0/16 or \n        192.175.48.0/24 or \n        192.31.196.0/24 or \n        192.52.193.0/24 or \n        192.88.99.0/24 or \n        198.18.0.0/15 or \n        198.51.100.0/24 or \n        203.0.113.0/24 or \n        224.0.0.0/4 or \n        240.0.0.0/4 or \n        \"::1\" or \n        \"FE80::/10\" or \n        \"FF00::/8\")\n",
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "destination.ip",
                "type": "ip"
            },
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.category",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.executable",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "source.ip",
                "type": "ip"
            }
        ],
        "risk_score": 21,
        "rule_id": "53617418-17b4-4e9c-8a2c-8deb8086ca4b",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "OS: Linux",
            "Use Case: Threat Detection",
            "Tactic: Command and Control",
            "Data Source: Elastic Endgame"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0011",
                    "name": "Command and Control",
                    "reference": "https://attack.mitre.org/tactics/TA0011/"
                },
                "technique": [
                    {
                        "id": "T1071",
                        "name": "Application Layer Protocol",
                        "reference": "https://attack.mitre.org/techniques/T1071/"
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "new_terms",
        "version": 2
    },
    "id": "53617418-17b4-4e9c-8a2c-8deb8086ca4b_2",
    "type": "security-rule"
}