{
    "attributes": {
        "author": [
            "Xavier Pich"
        ],
        "description": "Identifies attempts to disable or schedule the deletion of an AWS KMS Customer Managed Key (CMK). Deleting an AWS KMS key is destructive and potentially dangerous. It deletes the key material and all metadata associated with the KMS key and is irreversible. After a KMS key is deleted, the data that was encrypted under that KMS key can no longer be decrypted, which means that data becomes unrecoverable.",
        "false_positives": [
            "A KMS customer managed key may be disabled or scheduled for deletion by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Key deletions by unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."
        ],
        "from": "now-60m",
        "index": [
            "filebeat-*",
            "logs-aws*"
        ],
        "interval": "10m",
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "AWS KMS Customer Managed Key Disabled or Scheduled for Deletion",
        "note": "",
        "query": "event.dataset:aws.cloudtrail and event.provider:kms.amazonaws.com and event.action:(\"DisableKey\" or \"ScheduleKeyDeletion\") and event.outcome:success\n",
        "references": [
            "https://docs.aws.amazon.com/cli/latest/reference/kms/disable-key.html",
            "https://docs.aws.amazon.com/cli/latest/reference/kms/schedule-key-deletion.html"
        ],
        "related_integrations": [
            {
                "integration": "cloudtrail",
                "package": "aws",
                "version": "^1.5.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.dataset",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.outcome",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.provider",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "rule_id": "6951f15e-533c-4a60-8014-a3c3ab851a1b",
        "setup": "The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
        "severity": "medium",
        "tags": [
            "Elastic",
            "Cloud",
            "AWS",
            "Amazon Web Services",
            "Continuous Monitoring",
            "SecOps",
            "Log Auditing",
            "Impact"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0040",
                    "name": "Impact",
                    "reference": "https://attack.mitre.org/tactics/TA0040/"
                },
                "technique": [
                    {
                        "id": "T1485",
                        "name": "Data Destruction",
                        "reference": "https://attack.mitre.org/techniques/T1485/"
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "query",
        "version": 2
    },
    "id": "6951f15e-533c-4a60-8014-a3c3ab851a1b_2",
    "type": "security-rule"
}