{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule identifies a potential network sweep.  A network sweep is a method used by attackers to scan a target network, identifying active hosts, open ports, and available services to gather information on vulnerabilities and weaknesses. This reconnaissance helps them plan subsequent attacks and exploit potential entry points for unauthorized access, data theft, or other malicious activities. This rule proposes threshold logic to check for connection attempts from one source host to 10 or more destination hosts on commonly used network services.",
        "from": "now-9m",
        "index": [
            "logs-endpoint.events.network-*",
            "logs-network_traffic.*",
            "packetbeat-*"
        ],
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "Potential Network Sweep Detected",
        "query": "destination.port : (21 or 22 or 23 or 25 or 139 or 445 or 3389 or 5985 or 5986) and \nsource.ip : (10.0.0.0/8 or 172.16.0.0/12 or 192.168.0.0/16)\n",
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            },
            {
                "package": "network_traffic",
                "version": "^1.1.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "destination.port",
                "type": "long"
            },
            {
                "ecs": true,
                "name": "source.ip",
                "type": "ip"
            }
        ],
        "risk_score": 21,
        "rule_id": "781f8746-2180-4691-890c-4c96d11ca91d",
        "severity": "low",
        "tags": [
            "Domain: Network",
            "Tactic: Discovery",
            "Tactic: Reconnaissance",
            "Use Case: Network Security Monitoring"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0007",
                    "name": "Discovery",
                    "reference": "https://attack.mitre.org/tactics/TA0007/"
                },
                "technique": [
                    {
                        "id": "T1046",
                        "name": "Network Service Discovery",
                        "reference": "https://attack.mitre.org/techniques/T1046/"
                    }
                ]
            },
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0043",
                    "name": "Reconnaissance",
                    "reference": "https://attack.mitre.org/tactics/TA0043/"
                },
                "technique": [
                    {
                        "id": "T1595",
                        "name": "Active Scanning",
                        "reference": "https://attack.mitre.org/techniques/T1595/",
                        "subtechnique": [
                            {
                                "id": "T1595.001",
                                "name": "Scanning IP Blocks",
                                "reference": "https://attack.mitre.org/techniques/T1595/001/"
                            }
                        ]
                    }
                ]
            }
        ],
        "threshold": {
            "cardinality": [
                {
                    "field": "destination.ip",
                    "value": 100
                }
            ],
            "field": [
                "source.ip"
            ],
            "value": 1
        },
        "type": "threshold",
        "version": 2
    },
    "id": "781f8746-2180-4691-890c-4c96d11ca91d_2",
    "type": "security-rule"
}