{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "building_block_type": "default",
        "description": "Identifies processes running with unusual extensions that are not typically valid for Windows executables.",
        "from": "now-119m",
        "index": [
            "logs-endpoint.events.*"
        ],
        "interval": "60m",
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Unusual Process Extension",
        "query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.executable : \"?*\" and \n  not process.name : (\"*.exe\", \"*.com\", \"*.scr\", \"*.tmp\", \"*.dat\") and\n  not process.executable : \n    (\n      \"MemCompression\",\n      \"Registry\",\n      \"vmmem\",\n      \"vmmemWSL\",\n      \"?:\\\\Program Files\\\\Dell\\\\SupportAssistAgent\\\\*.p5x\",\n      \"?:\\\\Program Files\\\\Docker\\\\Docker\\\\com.docker.service\",\n      \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Intel\\\\AGS\\\\Libs\\\\AGSRunner.bin\"\n    ) and\n  not (\n    (process.name : \"C9632CF058AE4321B6B0B5EA39B710FE\" and process.code_signature.subject_name == \"Dell Inc\") or\n    (process.name : \"*.upd\" and process.code_signature.subject_name == \"Bloomberg LP\") or\n    (process.name: \"FD552E21-686E-413C-931D-3B82A9D29F3B\" and process.code_signature.subject_name: \"Adobe Inc.\") or\n    (process.name: \"3B91051C-AE82-43C9-BCEF-0309CD2DD9EB\" and process.code_signature.subject_name: \"McAfee, LLC\")\n  )\n",
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.code_signature.subject_name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.executable",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            }
        ],
        "risk_score": 21,
        "rule_id": "800e01be-a7a4-46d0-8de9-69f3c9582b44",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Defense Evasion",
            "Data Source: Elastic Defend",
            "Rule Type: BBR"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005/"
                },
                "technique": [
                    {
                        "id": "T1036",
                        "name": "Masquerading",
                        "reference": "https://attack.mitre.org/techniques/T1036/",
                        "subtechnique": [
                            {
                                "id": "T1036.008",
                                "name": "Masquerade File Type",
                                "reference": "https://attack.mitre.org/techniques/T1036/008/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 2
    },
    "id": "800e01be-a7a4-46d0-8de9-69f3c9582b44_2",
    "type": "security-rule"
}