{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Indicates the creation and deletion of a scheduled task within a short time interval. Adversaries can use these to proxy malicious execution via the schedule service and perform clean up.",
        "false_positives": [
            "Legitimate scheduled tasks may be created during installation of new software."
        ],
        "from": "now-9m",
        "index": [
            "winlogbeat-*",
            "logs-system.*",
            "logs-windows.*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Temporarily Scheduled Task Creation",
        "query": "sequence by winlog.computer_name, winlog.event_data.TaskName with maxspan=5m\n   [iam where event.action == \"scheduled-task-created\" and not user.name : \"*$\"]\n   [iam where event.action == \"scheduled-task-deleted\" and not user.name : \"*$\"]\n",
        "references": [
            "https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698"
        ],
        "related_integrations": [
            {
                "package": "system",
                "version": "^1.6.4"
            },
            {
                "package": "windows",
                "version": "^1.5.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "user.name",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "winlog.computer_name",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "winlog.event_data.TaskName",
                "type": "unknown"
            }
        ],
        "risk_score": 47,
        "rule_id": "81ff45f8-f8c2-4e28-992e-5a0e8d98e0fe",
        "severity": "medium",
        "tags": [
            "Elastic",
            "Host",
            "Windows",
            "Threat Detection",
            "Persistence"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0003",
                    "name": "Persistence",
                    "reference": "https://attack.mitre.org/tactics/TA0003/"
                },
                "technique": [
                    {
                        "id": "T1053",
                        "name": "Scheduled Task/Job",
                        "reference": "https://attack.mitre.org/techniques/T1053/",
                        "subtechnique": [
                            {
                                "id": "T1053.005",
                                "name": "Scheduled Task",
                                "reference": "https://attack.mitre.org/techniques/T1053/005/"
                            }
                        ]
                    }
                ]
            }
        ],
        "type": "eql",
        "version": 5
    },
    "id": "81ff45f8-f8c2-4e28-992e-5a0e8d98e0fe_5",
    "type": "security-rule"
}