{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies attempts to create a new group. Attackers may create new groups to establish persistence on a system.",
        "from": "now-9m",
        "index": [
            "logs-system.auth-*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Linux Group Creation",
        "query": "iam where host.os.type == \"linux\" and (event.type == \"group\" and event.type == \"creation\") and\nprocess.name in (\"groupadd\", \"addgroup\") and group.name != null\n",
        "related_integrations": [
            {
                "package": "system",
                "version": "^1.6.4"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "group.name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            }
        ],
        "risk_score": 21,
        "rule_id": "a1c2589e-0c8c-4ca8-9eb6-f83c4bbdbe8f",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "OS: Linux",
            "Use Case: Threat Detection",
            "Tactic: Persistence"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0003",
                    "name": "Persistence",
                    "reference": "https://attack.mitre.org/tactics/TA0003/"
                },
                "technique": [
                    {
                        "id": "T1136",
                        "name": "Create Account",
                        "reference": "https://attack.mitre.org/techniques/T1136/",
                        "subtechnique": [
                            {
                                "id": "T1136.001",
                                "name": "Local Account",
                                "reference": "https://attack.mitre.org/techniques/T1136/001/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 1
    },
    "id": "a1c2589e-0c8c-4ca8-9eb6-f83c4bbdbe8f_1",
    "type": "security-rule"
}