{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule uses alert data to determine when multiple alerts in different phases of an attack involving the same host are triggered. Analysts can use this to prioritize triage and response, as these hosts are more likely to be compromised.",
        "false_positives": [
            "False positives can occur because the rules may be mapped to a few MITRE ATT\u0026CK tactics. Use the attached Timeline to determine which detections were triggered on the host."
        ],
        "from": "now-24h",
        "index": [
            ".alerts-security.*"
        ],
        "interval": "1h",
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "Multiple Alerts in Different ATT\u0026CK Tactics on a Single Host",
        "query": "signal.rule.name:* and kibana.alert.rule.threat.tactic.id:*\n",
        "required_fields": [
            {
                "ecs": false,
                "name": "kibana.alert.rule.threat.tactic.id",
                "type": "unknown"
            },
            {
                "ecs": false,
                "name": "signal.rule.name",
                "type": "unknown"
            }
        ],
        "risk_score": 73,
        "rule_id": "b946c2f7-df06-4c00-a5aa-1f6fbc7bb72c",
        "severity": "high",
        "tags": [
            "Elastic",
            "Threat Detection",
            "Higher-Order Rules"
        ],
        "threshold": {
            "cardinality": [
                {
                    "field": "kibana.alert.rule.threat.tactic.id",
                    "value": 3
                }
            ],
            "field": [
                "host.id"
            ],
            "value": 1
        },
        "timestamp_override": "event.ingested",
        "type": "threshold",
        "version": 3
    },
    "id": "b946c2f7-df06-4c00-a5aa-1f6fbc7bb72c_3",
    "type": "security-rule"
}