{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "building_block_type": "default",
        "description": "This rule identifies the execution of commands that can be used to enumerate network connections. Adversaries may attempt to get a listing of network connections to or from a compromised system to identify targets within an environment.",
        "from": "now-119m",
        "index": [
            "logs-endpoint.events.*"
        ],
        "interval": "60m",
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Windows System Network Connections Discovery",
        "query": "process where event.type == \"start\" and\n(\n  process.name : \"netstat.exe\" or\n  (\n   (\n    (process.name : \"net.exe\" or process.pe.original_file_name == \"net.exe\") or\n    (\n     (process.name : \"net1.exe\" or process.pe.original_file_name == \"net1.exe\") and\n     not process.parent.name : \"net.exe\"\n    )\n   ) and process.args : (\"use\", \"user\", \"session\", \"config\") and not process.args: (\"/persistent:*\", \"/delete\", \"\\\\\\\\*\")\n  ) or\n  (process.name : \"nbtstat.exe\" and process.args : \"-s*\")\n) and not user.id : \"S-1-5-18\"\n",
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.args",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.parent.name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.pe.original_file_name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "user.id",
                "type": "keyword"
            }
        ],
        "risk_score": 21,
        "rule_id": "c4e9ed3e-55a2-4309-a012-bc3c78dad10a",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Discovery",
            "Rule Type: BBR",
            "Data Source: Elastic Defend"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0007",
                    "name": "Discovery",
                    "reference": "https://attack.mitre.org/tactics/TA0007/"
                },
                "technique": [
                    {
                        "id": "T1049",
                        "name": "System Network Connections Discovery",
                        "reference": "https://attack.mitre.org/techniques/T1049/"
                    },
                    {
                        "id": "T1082",
                        "name": "System Information Discovery",
                        "reference": "https://attack.mitre.org/techniques/T1082/"
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 2
    },
    "id": "c4e9ed3e-55a2-4309-a012-bc3c78dad10a_2",
    "type": "security-rule"
}