{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule detects the use of system search utilities like grep and find to search for AWS credentials inside a container. Unauthorized access to these sensitive files could lead to further compromise of the container environment or facilitate a container breakout to the underlying cloud environment.",
        "from": "now-6m",
        "index": [
            "logs-cloud_defend*"
        ],
        "interval": "5m",
        "language": "eql",
        "license": "Elastic License v2",
        "name": "AWS Credentials Searched For Inside A Container",
        "query": "process where event.module == \"cloud_defend\" and     \n  event.type == \"start\" and\n  \n/*account for tools that execute utilities as a subprocess, in this case the target utility name will appear as a process arg*/\n(process.name : (\"grep\", \"egrep\", \"fgrep\", \"find\", \"locate\", \"mlocate\") or process.args : (\"grep\", \"egrep\", \"fgrep\", \"find\", \"locate\", \"mlocate\")) and \nprocess.args : (\"*aws_access_key_id*\", \"*aws_secret_access_key*\", \"*aws_session_token*\", \"*accesskeyid*\", \"*secretaccesskey*\", \"*access_key*\", \"*.aws/credentials*\")\n",
        "references": [
            "https://sysdig.com/blog/threat-detection-aws-cloud-containers/"
        ],
        "related_integrations": [
            {
                "package": "cloud_defend",
                "version": "^1.0.5"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.module",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.args",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "rule_id": "d0b0f3ed-0b37-44bf-adee-e8cb7de92767",
        "severity": "medium",
        "tags": [
            "Data Source: Elastic Defend for Containers",
            "Domain: Container",
            "OS: Linux",
            "Use Case: Threat Detection",
            "Tactic: Credential Access"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0006",
                    "name": "Credential Access",
                    "reference": "https://attack.mitre.org/tactics/TA0006/"
                },
                "technique": [
                    {
                        "id": "T1552",
                        "name": "Unsecured Credentials",
                        "reference": "https://attack.mitre.org/techniques/T1552/",
                        "subtechnique": [
                            {
                                "id": "T1552.001",
                                "name": "Credentials In Files",
                                "reference": "https://attack.mitre.org/techniques/T1552/001/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 1
    },
    "id": "d0b0f3ed-0b37-44bf-adee-e8cb7de92767_1",
    "type": "security-rule"
}