{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies a network logon followed by Windows service creation with same LogonId. This could be indicative of lateral movement, but will be noisy if commonly done by administrators.\"",
        "from": "now-9m",
        "index": [
            "winlogbeat-*",
            "logs-system.*",
            "logs-windows.*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Remote Windows Service Installed",
        "query": "sequence by winlog.logon.id, winlog.computer_name with maxspan=1m\n[authentication where event.action == \"logged-in\" and winlog.logon.type : \"Network\" and\nevent.outcome==\"success\" and source.ip != null and source.ip != \"127.0.0.1\" and source.ip != \"::1\"]\n[iam where event.action == \"service-installed\" and\n not winlog.event_data.SubjectLogonId : \"0x3e7\" and\n not winlog.event_data.ServiceFileName :\n               (\"?:\\\\Windows\\\\ADCR_Agent\\\\adcrsvc.exe\",\n                \"?:\\\\Windows\\\\System32\\\\VSSVC.exe\",\n                \"?:\\\\Windows\\\\servicing\\\\TrustedInstaller.exe\",\n                \"?:\\\\Windows\\\\System32\\\\svchost.exe\",\n                \"?:\\\\Program Files (x86)\\\\*.exe\",\n                \"?:\\\\Program Files\\\\*.exe\",\n                \"?:\\\\Windows\\\\PSEXESVC.EXE\",\n                \"?:\\\\Windows\\\\System32\\\\sppsvc.exe\",\n                \"?:\\\\Windows\\\\System32\\\\wbem\\\\WmiApSrv.exe\",\n                \"?:\\\\WINDOWS\\\\RemoteAuditService.exe\",\n                \"?:\\\\Windows\\\\VeeamVssSupport\\\\VeeamGuestHelper.exe\",\n                \"?:\\\\Windows\\\\VeeamLogShipper\\\\VeeamLogShipper.exe\",\n                \"?:\\\\Windows\\\\CAInvokerService.exe\",\n                \"?:\\\\Windows\\\\System32\\\\upfc.exe\",\n                \"?:\\\\Windows\\\\AdminArsenal\\\\PDQ*.exe\",\n                \"?:\\\\Windows\\\\System32\\\\vds.exe\",\n                \"?:\\\\Windows\\\\Veeam\\\\Backup\\\\VeeamDeploymentSvc.exe\",\n                \"?:\\\\Windows\\\\ProPatches\\\\Scheduler\\\\STSchedEx.exe\",\n                \"?:\\\\Windows\\\\System32\\\\certsrv.exe\",\n                \"?:\\\\Windows\\\\eset-remote-install-service.exe\",\n                \"?:\\\\Pella Corporation\\\\Pella Order Management\\\\GPAutoSvc.exe\",\n                \"?:\\\\Pella Corporation\\\\OSCToGPAutoService\\\\OSCToGPAutoSvc.exe\",\n                \"?:\\\\Pella Corporation\\\\Pella Order Management\\\\GPAutoSvc.exe\",\n                \"?:\\\\Windows\\\\SysWOW64\\\\NwxExeSvc\\\\NwxExeSvc.exe\",\n                \"?:\\\\Windows\\\\System32\\\\taskhostex.exe\")]\n",
        "related_integrations": [
            {
                "package": "system",
                "version": "^1.6.4"
            },
            {
                "package": "windows",
                "version": "^1.5.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.outcome",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "source.ip",
                "type": "ip"
            },
            {
                "ecs": false,
                "name": "winlog.computer_name",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "winlog.event_data.ServiceFileName",
                "type": "unknown"
            },
            {
                "ecs": false,
                "name": "winlog.event_data.SubjectLogonId",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "winlog.logon.id",
                "type": "unknown"
            },
            {
                "ecs": false,
                "name": "winlog.logon.type",
                "type": "unknown"
            }
        ],
        "risk_score": 47,
        "rule_id": "d33ea3bf-9a11-463e-bd46-f648f2a0f4b1",
        "severity": "medium",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Lateral Movement",
            "Tactic: Persistence"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0008",
                    "name": "Lateral Movement",
                    "reference": "https://attack.mitre.org/tactics/TA0008/"
                },
                "technique": [
                    {
                        "id": "T1021",
                        "name": "Remote Services",
                        "reference": "https://attack.mitre.org/techniques/T1021/"
                    }
                ]
            },
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0003",
                    "name": "Persistence",
                    "reference": "https://attack.mitre.org/tactics/TA0003/"
                },
                "technique": [
                    {
                        "id": "T1543",
                        "name": "Create or Modify System Process",
                        "reference": "https://attack.mitre.org/techniques/T1543/",
                        "subtechnique": [
                            {
                                "id": "T1543.003",
                                "name": "Windows Service",
                                "reference": "https://attack.mitre.org/techniques/T1543/003/"
                            }
                        ]
                    }
                ]
            }
        ],
        "type": "eql",
        "version": 6
    },
    "id": "d33ea3bf-9a11-463e-bd46-f648f2a0f4b1_6",
    "type": "security-rule"
}