{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies attempt to load an untrusted driver. Adversaries may modify code signing policies to enable execution of unsigned or self-signed code.",
        "from": "now-9m",
        "index": [
            "logs-endpoint.events.*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Untrusted Driver Loaded",
        "query": "driver where host.os.type == \"windows\" and process.pid == 4 and\n  dll.code_signature.trusted != true and \n  not dll.code_signature.status : (\"errorExpired\", \"errorRevoked\")\n",
        "references": [
            "https://github.com/hfiref0x/TDL",
            "https://docs.microsoft.com/en-us/previous-versions/windows/hardware/design/dn653559(v=vs.85)?redirectedfrom=MSDN"
        ],
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "dll.code_signature.status",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "dll.code_signature.trusted",
                "type": "boolean"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.pid",
                "type": "long"
            }
        ],
        "risk_score": 73,
        "rule_id": "d8ab1ec1-feeb-48b9-89e7-c12e189448aa",
        "severity": "high",
        "tags": [
            "Elastic",
            "Host",
            "macOS",
            "Threat Detection",
            "Defense Evasion"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005/"
                },
                "technique": [
                    {
                        "id": "T1553",
                        "name": "Subvert Trust Controls",
                        "reference": "https://attack.mitre.org/techniques/T1553/",
                        "subtechnique": [
                            {
                                "id": "T1553.006",
                                "name": "Code Signing Policy Modification",
                                "reference": "https://attack.mitre.org/techniques/T1553/006/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 2
    },
    "id": "d8ab1ec1-feeb-48b9-89e7-c12e189448aa_2",
    "type": "security-rule"
}