{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies the load of a driver with an original file name and signature values that were observed for the first time during the last 30 days. This rule type can help baseline drivers installation within your environment.",
        "from": "now-9m",
        "history_window_start": "now-30d",
        "index": [
            "logs-endpoint.events.*"
        ],
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "First Time Seen Driver Loaded",
        "new_terms_fields": [
            "dll.pe.original_file_name",
            "dll.code_signature.subject_name"
        ],
        "query": "event.category:\"driver\" and host.os.type:windows and event.action:\"load\"\n",
        "references": [
            "https://www.elastic.co/kr/security-labs/stopping-vulnerable-driver-attacks"
        ],
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.category",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "rule_id": "df0fd41e-5590-4965-ad5e-cd079ec22fa9",
        "severity": "medium",
        "tags": [
            "Elastic",
            "Host",
            "Windows",
            "Threat Detection",
            "Persistence"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0003",
                    "name": "Persistence",
                    "reference": "https://attack.mitre.org/tactics/TA0003/"
                },
                "technique": [
                    {
                        "id": "T1543",
                        "name": "Create or Modify System Process",
                        "reference": "https://attack.mitre.org/techniques/T1543/",
                        "subtechnique": [
                            {
                                "id": "T1543.003",
                                "name": "Windows Service",
                                "reference": "https://attack.mitre.org/techniques/T1543/003/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "new_terms",
        "version": 2
    },
    "id": "df0fd41e-5590-4965-ad5e-cd079ec22fa9_2",
    "type": "security-rule"
}