{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule detects when chmod is used to add the execute permission to a file inside a container. Modifying file permissions to make a file executable could indicate malicious activity, as an attacker may attempt to run unauthorized or malicious code inside the container.",
        "from": "now-6m",
        "index": [
            "logs-cloud_defend*"
        ],
        "interval": "5m",
        "language": "eql",
        "license": "Elastic License v2",
        "name": "File Made Executable via Chmod Inside A Container",
        "query": "file where container.id: \"*\" and event.type in (\"change\", \"creation\") and\n\n/*account for tools that execute utilities as a subprocess, in this case the target utility name will appear as a process arg*/\n(process.name : \"chmod\" or process.args : \"chmod\") and \nprocess.args : (\"*x*\", \"777\", \"755\", \"754\", \"700\") and not process.args: \"-x\"\n",
        "related_integrations": [
            {
                "package": "cloud_defend",
                "version": "^1.0.5"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "container.id",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.args",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "rule_id": "ec604672-bed9-43e1-8871-cf591c052550",
        "severity": "medium",
        "tags": [
            "Elastic",
            "Host",
            "Linux",
            "Threat Detection",
            "Execution",
            "Defense Evasion",
            "Container"
        ],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0002",
                    "name": "Execution",
                    "reference": "https://attack.mitre.org/tactics/TA0002/"
                },
                "technique": [
                    {
                        "id": "T1059",
                        "name": "Command and Scripting Interpreter",
                        "reference": "https://attack.mitre.org/techniques/T1059/"
                    }
                ]
            },
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005/"
                },
                "technique": [
                    {
                        "id": "T1222",
                        "name": "File and Directory Permissions Modification",
                        "reference": "https://attack.mitre.org/techniques/T1222/",
                        "subtechnique": [
                            {
                                "id": "T1222.002",
                                "name": "Linux and Mac File and Directory Permissions Modification",
                                "reference": "https://attack.mitre.org/techniques/T1222/002/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 1
    },
    "id": "ec604672-bed9-43e1-8871-cf591c052550_1",
    "type": "security-rule"
}