{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies the occurrence of a security alert from the Google Workspace alerts center. Google Workspace's security alert center provides an overview of actionable alerts that may be affecting an organization's domain. An alert is a warning of a potential security issue that Google has detected.",
        "false_positives": [
            "To tune this rule, add exceptions to exclude any google_workspace.alert.type which should not trigger this rule.",
            "For additional tuning, severity exceptions for google_workspace.alert.metadata.severity can be added."
        ],
        "from": "now-130m",
        "index": [
            "filebeat-*",
            "logs-google_workspace*"
        ],
        "interval": "10m",
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "Forwarded Google Workspace Security Alert",
        "note": "## Triage and analysis\n\nThis is a promotion rule for Google Workspace security events, which are alertable events per the vendor.\nConsult vendor documentation on interpreting specific events.",
        "query": "event.dataset: google_workspace.alert\n",
        "references": [
            "https://workspace.google.com/products/admin/alert-center/"
        ],
        "related_integrations": [
            {
                "package": "google_workspace",
                "version": "^2.0.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.dataset",
                "type": "keyword"
            }
        ],
        "risk_score": 73,
        "rule_id": "f1a6d0f4-95b8-11ed-9517-f661ea17fbcc",
        "rule_name_override": "google_workspace.alert.type",
        "setup": "",
        "severity": "high",
        "severity_mapping": [
            {
                "field": "google_workspace.alert.metadata.severity",
                "operator": "equals",
                "severity": "low",
                "value": "LOW"
            },
            {
                "field": "google_workspace.alert.metadata.severity",
                "operator": "equals",
                "severity": "medium",
                "value": "MEDIUM"
            },
            {
                "field": "google_workspace.alert.metadata.severity",
                "operator": "equals",
                "severity": "high",
                "value": "HIGH"
            }
        ],
        "tags": [
            "Elastic",
            "Cloud",
            "Google Workspace",
            "Log Auditing",
            "Threat Detection"
        ],
        "timestamp_override": "event.ingested",
        "type": "query",
        "version": 1
    },
    "id": "f1a6d0f4-95b8-11ed-9517-f661ea17fbcc_1",
    "type": "security-rule"
}