{
  "name": "List - and",
  "description": "Query with a list that includes and. This rule should only produce signals when host.name exists and when both event.module is endgame and event.category is anything other than file",
  "rule_id": "query-with-list-and",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "language": "kuery",
  "exceptions_list": [
    {
      "field": "event.module",
      "values_operator": "excluded",
      "values_type": "match",
      "values": [
        {
          "name": "endgame"
        }
      ],
      "and": [
        {
          "field": "event.category",
          "values_operator": "included",
          "values_type": "match",
          "values": [
            {
              "name": "file"
            }
          ]
        }
      ]
    }
  ]
}
