{
  "name": "List - exists",
  "description": "Query with a list that includes exists. This rule should only produce signals when host.name exists and event.action does not exist",
  "rule_id": "query-with-list-exists",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "language": "kuery",
  "exceptions_list": [
    {
      "field": "event.action",
      "values_operator": "included",
      "values_type": "exists"
    }
  ]
}
