{
  "name": "List - or",
  "description": "Query with a list that includes or. This rule should only produce signals when host.name exists and event.module is suricata OR when host.name exists and event.category is file",
  "rule_id": "query-with-list-or",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "exceptions_list": [
    {
      "field": "event.module",
      "values_operator": "excluded",
      "values_type": "match",
      "values": [
        {
          "name": "suricata"
        }
      ]
    },
    {
      "field": "event.category",
      "values_operator": "excluded",
      "values_type": "match",
      "values": [
        {
          "name": "file"
        }
      ]
    }
  ]
}
