{
  "name": "List - match_all",
  "description": "Query with a list that includes match_all. This rule should only produce signals when host.name exists and event.module is not suricata or auditd",
  "rule_id": "query-with-list-match-all",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "language": "kuery",
  "exceptions_list": [
    {
      "field": "event.module",
      "values_operator": "included",
      "values_type": "match_all",
      "values": [
        {
          "name": "suricata"
        },
        {
          "name": "auditd"
        }
      ]
    }
  ]
}
