{
  "name": "Query with a list",
  "description": "Query with a list only generate signals if source.ip is not in list",
  "rule_id": "query-with-list",
  "risk_score": 2,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "language": "kuery",
  "exceptions_list": [
    {
      "field": "source.ip",
      "values_operator": "excluded",
      "values_type": "list",
      "values": [
        {
          "id": "ci-badguys.txt",
          "name": "ip"
        }
      ]
    }
  ]
}
