{"attributes":{"rule_id":"1ba5160d-f5a2-4624-b0ff-6a1dc55d2516","versions":[{"name":"AWS ElastiCache Security Group Modified or Deleted v101.0.0","rule_version":"101.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when an ElastiCache security group has been modified or deleted.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Austin Songer"],"false_positives":["A ElastiCache security group deletion may be done by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Security Group deletions by unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-60m","interval":"10m","references":["https://docs.aws.amazon.com/AmazonElastiCache/latest/APIReference/Welcome.html"],"tags":["Elastic","Cloud","AWS","Continuous Monitoring","SecOps","Monitoring"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.007","name":"Disable or Modify Cloud Firewall","reference":"https://attack.mitre.org/techniques/T1562/007/"}]}]}],"type":"query","index":["filebeat-*","logs-aws*"],"language":"kuery","query":"event.dataset:aws.cloudtrail and event.provider:elasticache.amazonaws.com and event.action:(\"Delete Cache Security Group\" or\n\"Authorize Cache Security Group Ingress\" or  \"Revoke Cache Security Group Ingress\" or \"AuthorizeCacheSecurityGroupEgress\" or\n\"RevokeCacheSecurityGroupEgress\") and event.outcome:success\n","related_integrations":[{"integration":"cloudtrail","package":"aws","version":"^1.5.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"},{"ecs":true,"name":"event.provider","type":"keyword"}],"setup":"The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"AWS ElastiCache Security Group Modified or Deleted v101.0.1","rule_version":"101.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when an ElastiCache security group has been modified or deleted.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Austin Songer"],"false_positives":["A ElastiCache security group deletion may be done by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Security Group deletions by unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-60m","interval":"10m","references":["https://docs.aws.amazon.com/AmazonElastiCache/latest/APIReference/Welcome.html"],"tags":["Elastic","Cloud","AWS","Continuous Monitoring","SecOps","Monitoring"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.007","name":"Disable or Modify Cloud Firewall","reference":"https://attack.mitre.org/techniques/T1562/007/"}]}]}],"type":"query","index":["filebeat-*","logs-aws*"],"language":"kuery","query":"event.dataset:aws.cloudtrail and event.provider:elasticache.amazonaws.com and event.action:(\"Delete Cache Security Group\" or\n\"Authorize Cache Security Group Ingress\" or  \"Revoke Cache Security Group Ingress\" or \"AuthorizeCacheSecurityGroupEgress\" or\n\"RevokeCacheSecurityGroupEgress\") and event.outcome:success\n","related_integrations":[{"integration":"cloudtrail","package":"aws","version":"^1.5.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"},{"ecs":true,"name":"event.provider","type":"keyword"}],"setup":"The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"AWS ElastiCache Security Group Modified or Deleted v101.0.2","rule_version":"101.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when an ElastiCache security group has been modified or deleted.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Austin Songer"],"false_positives":["A ElastiCache security group deletion may be done by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Security Group deletions by unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-60m","interval":"10m","references":["https://docs.aws.amazon.com/AmazonElastiCache/latest/APIReference/Welcome.html"],"tags":["Elastic","Cloud","AWS","Continuous Monitoring","SecOps","Monitoring"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.007","name":"Disable or Modify Cloud Firewall","reference":"https://attack.mitre.org/techniques/T1562/007/"}]}]}],"type":"query","index":["filebeat-*","logs-aws*"],"language":"kuery","query":"event.dataset:aws.cloudtrail and event.provider:elasticache.amazonaws.com and event.action:(\"Delete Cache Security Group\" or\n\"Authorize Cache Security Group Ingress\" or  \"Revoke Cache Security Group Ingress\" or \"AuthorizeCacheSecurityGroupEgress\" or\n\"RevokeCacheSecurityGroupEgress\") and event.outcome:success\n","related_integrations":[{"integration":"cloudtrail","package":"aws","version":"^1.5.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"},{"ecs":true,"name":"event.provider","type":"keyword"}],"setup":"The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."}]},"id":"1ba5160d-f5a2-4624-b0ff-6a1dc55d2516","type":"security-rule"}