{"attributes":{"rule_id":"1e0b832e-957e-43ae-b319-db82d228c908","versions":[{"name":"Azure Storage Account Key Regenerated v101.0.0","rule_version":"101.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies a rotation to storage account access keys in Azure. Regenerating access keys can affect any applications or Azure services that are dependent on the storage account key. Adversaries may regenerate a key as a means of acquiring credentials to access systems and resources.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["It's recommended that you rotate your access keys periodically to help keep your storage account secure. Normal key rotation can be exempted from the rule. An abnormal time frame and/or a key rotation from unfamiliar users, hosts, or locations should be investigated."],"from":"now-25m","references":["https://docs.microsoft.com/en-us/azure/storage/common/storage-account-keys-manage?tabs=azure-portal"],"tags":["Elastic","Cloud","Azure","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1528","name":"Steal Application Access Token","reference":"https://attack.mitre.org/techniques/T1528/"}]}],"type":"query","index":["filebeat-*","logs-azure*"],"language":"kuery","query":"event.dataset:azure.activitylogs and azure.activitylogs.operation_name:\"MICROSOFT.STORAGE/STORAGEACCOUNTS/REGENERATEKEY/ACTION\" and event.outcome:(Success or success)\n","related_integrations":[{"integration":"activitylogs","package":"azure","version":"^1.0.0"}],"required_fields":[{"ecs":false,"name":"azure.activitylogs.operation_name","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"}],"setup":"The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"Azure Storage Account Key Regenerated v101.0.1","rule_version":"101.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies a rotation to storage account access keys in Azure. Regenerating access keys can affect any applications or Azure services that are dependent on the storage account key. Adversaries may regenerate a key as a means of acquiring credentials to access systems and resources.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["It's recommended that you rotate your access keys periodically to help keep your storage account secure. Normal key rotation can be exempted from the rule. An abnormal time frame and/or a key rotation from unfamiliar users, hosts, or locations should be investigated."],"from":"now-25m","references":["https://docs.microsoft.com/en-us/azure/storage/common/storage-account-keys-manage?tabs=azure-portal"],"tags":["Elastic","Cloud","Azure","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1528","name":"Steal Application Access Token","reference":"https://attack.mitre.org/techniques/T1528/"}]}],"type":"query","index":["filebeat-*","logs-azure*"],"language":"kuery","query":"event.dataset:azure.activitylogs and azure.activitylogs.operation_name:\"MICROSOFT.STORAGE/STORAGEACCOUNTS/REGENERATEKEY/ACTION\" and event.outcome:(Success or success)\n","related_integrations":[{"integration":"activitylogs","package":"azure","version":"^1.0.0"}],"required_fields":[{"ecs":false,"name":"azure.activitylogs.operation_name","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"}],"setup":"The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"Azure Storage Account Key Regenerated v101.0.2","rule_version":"101.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies a rotation to storage account access keys in Azure. Regenerating access keys can affect any applications or Azure services that are dependent on the storage account key. Adversaries may regenerate a key as a means of acquiring credentials to access systems and resources.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["It's recommended that you rotate your access keys periodically to help keep your storage account secure. Normal key rotation can be exempted from the rule. An abnormal time frame and/or a key rotation from unfamiliar users, hosts, or locations should be investigated."],"from":"now-25m","references":["https://docs.microsoft.com/en-us/azure/storage/common/storage-account-keys-manage?tabs=azure-portal"],"tags":["Elastic","Cloud","Azure","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1528","name":"Steal Application Access Token","reference":"https://attack.mitre.org/techniques/T1528/"}]}],"type":"query","index":["filebeat-*","logs-azure*"],"language":"kuery","query":"event.dataset:azure.activitylogs and azure.activitylogs.operation_name:\"MICROSOFT.STORAGE/STORAGEACCOUNTS/REGENERATEKEY/ACTION\" and event.outcome:(Success or success)\n","related_integrations":[{"integration":"activitylogs","package":"azure","version":"^1.0.0"}],"required_fields":[{"ecs":false,"name":"azure.activitylogs.operation_name","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"}],"setup":"The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."}]},"id":"1e0b832e-957e-43ae-b319-db82d228c908","type":"security-rule"}