{"attributes":{"rule_id":"2326d1b2-9acf-4dee-bd21-867ea7378b4d","versions":[{"name":"GCP Storage Bucket Permissions Modification v102.0.0","rule_version":"102.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when the Identity and Access Management (IAM) permissions are modified for a Google Cloud Platform (GCP) storage bucket. An adversary may modify the permissions on a storage bucket to weaken their target's security controls or an administrator may inadvertently modify the permissions, which could lead to data exposure or loss.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Storage bucket permissions may be modified by system administrators. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."],"references":["https://cloud.google.com/storage/docs/access-control/iam-permissions"],"tags":["Elastic","Cloud","GCP","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1222","name":"File and Directory Permissions Modification","reference":"https://attack.mitre.org/techniques/T1222/"}]}],"type":"query","index":["filebeat-*","logs-gcp*"],"language":"kuery","query":"event.dataset:gcp.audit and event.action:\"storage.setIamPermissions\" and event.outcome:success\n","related_integrations":[{"integration":"audit","package":"gcp","version":"^2.0.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"}],"setup":"The GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"GCP Storage Bucket Permissions Modification v102.0.1","rule_version":"102.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when the Identity and Access Management (IAM) permissions are modified for a Google Cloud Platform (GCP) storage bucket. An adversary may modify the permissions on a storage bucket to weaken their target's security controls or an administrator may inadvertently modify the permissions, which could lead to data exposure or loss.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Storage bucket permissions may be modified by system administrators. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."],"references":["https://cloud.google.com/storage/docs/access-control/iam-permissions"],"tags":["Elastic","Cloud","GCP","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1222","name":"File and Directory Permissions Modification","reference":"https://attack.mitre.org/techniques/T1222/"}]}],"type":"query","index":["filebeat-*","logs-gcp*"],"language":"kuery","query":"event.dataset:gcp.audit and event.action:\"storage.setIamPermissions\" and event.outcome:success\n","related_integrations":[{"integration":"audit","package":"gcp","version":"^2.0.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"}],"setup":"The GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"GCP Storage Bucket Permissions Modification v102.0.2","rule_version":"102.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when the Identity and Access Management (IAM) permissions are modified for a Google Cloud Platform (GCP) storage bucket. An adversary may modify the permissions on a storage bucket to weaken their target's security controls or an administrator may inadvertently modify the permissions, which could lead to data exposure or loss.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Storage bucket permissions may be modified by system administrators. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."],"references":["https://cloud.google.com/storage/docs/access-control/iam-permissions"],"tags":["Elastic","Cloud","GCP","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1222","name":"File and Directory Permissions Modification","reference":"https://attack.mitre.org/techniques/T1222/"}]}],"type":"query","index":["filebeat-*","logs-gcp*"],"language":"kuery","query":"event.dataset:gcp.audit and event.action:\"storage.setIamPermissions\" and event.outcome:success\n","related_integrations":[{"integration":"audit","package":"gcp","version":"^2.0.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"}],"setup":"The GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."}]},"id":"2326d1b2-9acf-4dee-bd21-867ea7378b4d","type":"security-rule"}