{"attributes":{"rule_id":"3115bd2c-0baa-4df0-80ea-45e474b5ef93","versions":[{"name":"Agent Spoofing - Mismatched Agent ID v100.0.0","rule_version":"100.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects events that have a mismatch on the expected event agent ID. The status \"agent_id_mismatch\" occurs when the expected agent ID associated with the API key does not match the actual agent ID in an event. This could indicate attempts to spoof events in order to masquerade actual activity to evade detection.","risk_score":73,"severity":"high","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This is meant to run only on datasources using Elastic Agent 7.14+ since versions prior to that will be missing the necessary field, resulting in false positives."],"from":"now-9m","tags":["Elastic","Threat Detection","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/"}]}],"type":"query","index":["logs-*","metrics-*","traces-*"],"language":"kuery","query":"event.agent_id_status:agent_id_mismatch\n","required_fields":[{"ecs":true,"name":"event.agent_id_status","type":"keyword"}]},{"name":"Agent Spoofing - Mismatched Agent ID v100.0.1","rule_version":"100.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects events that have a mismatch on the expected event agent ID. The status \"agent_id_mismatch\" occurs when the expected agent ID associated with the API key does not match the actual agent ID in an event. This could indicate attempts to spoof events in order to masquerade actual activity to evade detection.","risk_score":73,"severity":"high","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This is meant to run only on datasources using Elastic Agent 7.14+ since versions prior to that will be missing the necessary field, resulting in false positives."],"from":"now-9m","tags":["Elastic","Threat Detection","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/"}]}],"type":"query","index":["logs-*","metrics-*","traces-*"],"language":"kuery","query":"event.agent_id_status:agent_id_mismatch\n","required_fields":[{"ecs":true,"name":"event.agent_id_status","type":"keyword"}]},{"name":"Agent Spoofing - Mismatched Agent ID v100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects events that have a mismatch on the expected event agent ID. The status \"agent_id_mismatch\" occurs when the expected agent ID associated with the API key does not match the actual agent ID in an event. This could indicate attempts to spoof events in order to masquerade actual activity to evade detection.","risk_score":73,"severity":"high","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This is meant to run only on datasources using Elastic Agent 7.14+ since versions prior to that will be missing the necessary field, resulting in false positives."],"from":"now-9m","tags":["Elastic","Threat Detection","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/"}]}],"type":"query","index":["logs-*","metrics-*","traces-*"],"language":"kuery","query":"event.agent_id_status:agent_id_mismatch\n","required_fields":[{"ecs":true,"name":"event.agent_id_status","type":"keyword"}]}]},"id":"3115bd2c-0baa-4df0-80ea-45e474b5ef93","type":"security-rule"}