{"attributes":{"rule_id":"493834ca-f861-414c-8602-150d5505b777","versions":[{"name":"Agent Spoofing - Multiple Hosts Using Same Agent v100.0.0","rule_version":"100.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects when multiple hosts are using the same agent ID. This could occur in the event of an agent being taken over and used to inject illegitimate documents into an instance as an attempt to spoof events in order to masquerade actual activity to evade detection.","risk_score":73,"severity":"high","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This is meant to run only on datasources using Elastic Agent 7.14+ since versions prior to that will be missing the necessary field, resulting in false positives."],"from":"now-9m","tags":["Elastic","Threat Detection","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/"}]}],"query":"event.agent_id_status:*\n","threshold":{"field":["agent.id"],"value":2,"cardinality":[{"field":"host.id","value":2}]},"type":"threshold","index":["logs-*","metrics-*","traces-*"],"language":"kuery","required_fields":[{"ecs":true,"name":"event.agent_id_status","type":"keyword"}]},{"name":"Agent Spoofing - Multiple Hosts Using Same Agent v100.0.1","rule_version":"100.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects when multiple hosts are using the same agent ID. This could occur in the event of an agent being taken over and used to inject illegitimate documents into an instance as an attempt to spoof events in order to masquerade actual activity to evade detection.","risk_score":73,"severity":"high","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This is meant to run only on datasources using Elastic Agent 7.14+ since versions prior to that will be missing the necessary field, resulting in false positives."],"from":"now-9m","tags":["Elastic","Threat Detection","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/"}]}],"query":"event.agent_id_status:*\n","threshold":{"field":["agent.id"],"value":2,"cardinality":[{"field":"host.id","value":2}]},"type":"threshold","index":["logs-*","metrics-*","traces-*"],"language":"kuery","required_fields":[{"ecs":true,"name":"event.agent_id_status","type":"keyword"}]},{"name":"Agent Spoofing - Multiple Hosts Using Same Agent v100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects when multiple hosts are using the same agent ID. This could occur in the event of an agent being taken over and used to inject illegitimate documents into an instance as an attempt to spoof events in order to masquerade actual activity to evade detection.","risk_score":73,"severity":"high","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This is meant to run only on datasources using Elastic Agent 7.14+ since versions prior to that will be missing the necessary field, resulting in false positives."],"from":"now-9m","tags":["Elastic","Threat Detection","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/"}]}],"query":"event.agent_id_status:*\n","threshold":{"field":["agent.id"],"value":2,"cardinality":[{"field":"host.id","value":2}]},"type":"threshold","index":["logs-*","metrics-*","traces-*"],"language":"kuery","required_fields":[{"ecs":true,"name":"event.agent_id_status","type":"keyword"}]}]},"id":"493834ca-f861-414c-8602-150d5505b777","type":"security-rule"}