{"attributes":{"rule_id":"63c056a0-339a-11ed-a261-0242ac120002","versions":[{"name":"Kubernetes Denied Service Account Request v2.0.0","rule_version":"2.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"This rule detects when a service account makes an unauthorized request for resources from the API server. Service accounts follow a very predictable pattern of behavior. A service account should never send an unauthorized request to the API server. This behavior is likely an indicator of compromise or of a problem within the cluster. An adversary may have gained access to credentials/tokens and this could be an attempt to access or create resources to facilitate further movement or execution within the cluster.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Unauthorized requests from service accounts are highly abnormal and more indicative of human behavior or a serious problem within the cluster. This behavior should be investigated further."],"references":["https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections","https://kubernetes.io/docs/reference/access-authn-authz/authentication/#service-account-tokens"],"tags":["Elastic","Kubernetes","Continuous Monitoring","Discovery"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1613","name":"Container and Resource Discovery","reference":"https://attack.mitre.org/techniques/T1613/"}]}],"type":"query","index":["logs-kubernetes.*"],"language":"kuery","query":"event.dataset: \"kubernetes.audit_logs\" \n  and kubernetes.audit.user.username: system\\:serviceaccount\\:* \n  and kubernetes.audit.annotations.authorization_k8s_io/decision: \"forbid\" \n","related_integrations":[{"package":"kubernetes","version":"^1.4.1"}],"required_fields":[{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":false,"name":"kubernetes.audit.annotations.authorization_k8s_io/decision","type":"unknown"},{"ecs":false,"name":"kubernetes.audit.user.username","type":"unknown"}],"setup":"The Kubernetes Fleet integration with Audit Logs enabled or similarly structured data is required to be compatible with this rule."},{"name":"Kubernetes Denied Service Account Request v2.0.1","rule_version":"2.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"This rule detects when a service account makes an unauthorized request for resources from the API server. Service accounts follow a very predictable pattern of behavior. A service account should never send an unauthorized request to the API server. This behavior is likely an indicator of compromise or of a problem within the cluster. An adversary may have gained access to credentials/tokens and this could be an attempt to access or create resources to facilitate further movement or execution within the cluster.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Unauthorized requests from service accounts are highly abnormal and more indicative of human behavior or a serious problem within the cluster. This behavior should be investigated further."],"references":["https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections","https://kubernetes.io/docs/reference/access-authn-authz/authentication/#service-account-tokens"],"tags":["Elastic","Kubernetes","Continuous Monitoring","Discovery"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1613","name":"Container and Resource Discovery","reference":"https://attack.mitre.org/techniques/T1613/"}]}],"type":"query","index":["logs-kubernetes.*"],"language":"kuery","query":"event.dataset: \"kubernetes.audit_logs\" \n  and kubernetes.audit.user.username: system\\:serviceaccount\\:* \n  and kubernetes.audit.annotations.authorization_k8s_io/decision: \"forbid\" \n","related_integrations":[{"package":"kubernetes","version":"^1.4.1"}],"required_fields":[{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":false,"name":"kubernetes.audit.annotations.authorization_k8s_io/decision","type":"unknown"},{"ecs":false,"name":"kubernetes.audit.user.username","type":"unknown"}],"setup":"The Kubernetes Fleet integration with Audit Logs enabled or similarly structured data is required to be compatible with this rule."},{"name":"Kubernetes Denied Service Account Request v2.0.2","rule_version":"2.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"This rule detects when a service account makes an unauthorized request for resources from the API server. Service accounts follow a very predictable pattern of behavior. A service account should never send an unauthorized request to the API server. This behavior is likely an indicator of compromise or of a problem within the cluster. An adversary may have gained access to credentials/tokens and this could be an attempt to access or create resources to facilitate further movement or execution within the cluster.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Unauthorized requests from service accounts are highly abnormal and more indicative of human behavior or a serious problem within the cluster. This behavior should be investigated further."],"references":["https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections","https://kubernetes.io/docs/reference/access-authn-authz/authentication/#service-account-tokens"],"tags":["Elastic","Kubernetes","Continuous Monitoring","Discovery"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1613","name":"Container and Resource Discovery","reference":"https://attack.mitre.org/techniques/T1613/"}]}],"type":"query","index":["logs-kubernetes.*"],"language":"kuery","query":"event.dataset: \"kubernetes.audit_logs\" \n  and kubernetes.audit.user.username: system\\:serviceaccount\\:* \n  and kubernetes.audit.annotations.authorization_k8s_io/decision: \"forbid\" \n","related_integrations":[{"package":"kubernetes","version":"^1.4.1"}],"required_fields":[{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":false,"name":"kubernetes.audit.annotations.authorization_k8s_io/decision","type":"unknown"},{"ecs":false,"name":"kubernetes.audit.user.username","type":"unknown"}],"setup":"The Kubernetes Fleet integration with Audit Logs enabled or similarly structured data is required to be compatible with this rule."}]},"id":"63c056a0-339a-11ed-a261-0242ac120002","type":"security-rule"}