{"attributes":{"rule_id":"9180ffdf-f3d0-4db3-bf66-7a14bcff71b8","versions":[{"name":"GCP Virtual Private Cloud Route Creation v102.0.0","rule_version":"102.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when a virtual private cloud (VPC) route is created in Google Cloud Platform (GCP). Google Cloud routes define the paths that network traffic takes from a virtual machine (VM) instance to other destinations. These destinations can be inside a Google VPC network or outside it. An adversary may create a route in order to impact the flow of network traffic in their target's cloud environment.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Virtual Private Cloud routes may be created by system administrators. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."],"references":["https://cloud.google.com/vpc/docs/routes","https://cloud.google.com/vpc/docs/using-routes"],"tags":["Elastic","Cloud","GCP","Continuous Monitoring","SecOps","Configuration Audit","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.007","name":"Disable or Modify Cloud Firewall","reference":"https://attack.mitre.org/techniques/T1562/007/"}]}]}],"type":"query","index":["filebeat-*","logs-gcp*"],"language":"kuery","query":"event.dataset:gcp.audit and event.action:(v*.compute.routes.insert or \"beta.compute.routes.insert\")\n","related_integrations":[{"integration":"audit","package":"gcp","version":"^2.0.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"}],"setup":"The GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"GCP Virtual Private Cloud Route Creation v102.0.1","rule_version":"102.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when a virtual private cloud (VPC) route is created in Google Cloud Platform (GCP). Google Cloud routes define the paths that network traffic takes from a virtual machine (VM) instance to other destinations. These destinations can be inside a Google VPC network or outside it. An adversary may create a route in order to impact the flow of network traffic in their target's cloud environment.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Virtual Private Cloud routes may be created by system administrators. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."],"references":["https://cloud.google.com/vpc/docs/routes","https://cloud.google.com/vpc/docs/using-routes"],"tags":["Elastic","Cloud","GCP","Continuous Monitoring","SecOps","Configuration Audit","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.007","name":"Disable or Modify Cloud Firewall","reference":"https://attack.mitre.org/techniques/T1562/007/"}]}]}],"type":"query","index":["filebeat-*","logs-gcp*"],"language":"kuery","query":"event.dataset:gcp.audit and event.action:(v*.compute.routes.insert or \"beta.compute.routes.insert\")\n","related_integrations":[{"integration":"audit","package":"gcp","version":"^2.0.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"}],"setup":"The GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"GCP Virtual Private Cloud Route Creation v102.0.2","rule_version":"102.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when a virtual private cloud (VPC) route is created in Google Cloud Platform (GCP). Google Cloud routes define the paths that network traffic takes from a virtual machine (VM) instance to other destinations. These destinations can be inside a Google VPC network or outside it. An adversary may create a route in order to impact the flow of network traffic in their target's cloud environment.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Virtual Private Cloud routes may be created by system administrators. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."],"references":["https://cloud.google.com/vpc/docs/routes","https://cloud.google.com/vpc/docs/using-routes"],"tags":["Elastic","Cloud","GCP","Continuous Monitoring","SecOps","Configuration Audit","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.007","name":"Disable or Modify Cloud Firewall","reference":"https://attack.mitre.org/techniques/T1562/007/"}]}]}],"type":"query","index":["filebeat-*","logs-gcp*"],"language":"kuery","query":"event.dataset:gcp.audit and event.action:(v*.compute.routes.insert or \"beta.compute.routes.insert\")\n","related_integrations":[{"integration":"audit","package":"gcp","version":"^2.0.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"}],"setup":"The GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."}]},"id":"9180ffdf-f3d0-4db3-bf66-7a14bcff71b8","type":"security-rule"}