{"attributes":{"rule_id":"a2795334-2499-11ed-9e1a-f661ea17fbce","versions":[{"name":"Google Workspace Restrictions for Google Marketplace Modified to Allow Any App v2.0.0","rule_version":"2.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects when the Google Marketplace restrictions are changed to allow any application for users in Google Workspace. Malicious APKs created by adversaries may be uploaded to the Google marketplace but not installed on devices managed within Google Workspace. Administrators should set restrictions to not allow any application from the marketplace for security reasons. Adversaries may enable any app to be installed and executed on mobile devices within a Google Workspace environment prior to distributing the malicious APK to the end user.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"### Important Information Regarding Google Workspace Event Lag Times\n- As per Google's documentation, Google Workspace administrators may observe lag times ranging from minutes up to 3 days between the time of an event's occurrence and the event being visible in the Google Workspace admin/audit logs.\n- This rule is configured to run every 10 minutes with a lookback time of 130 minutes.\n- To reduce the risk of false negatives, consider reducing the interval that the Google Workspace (formerly G Suite) Filebeat module polls Google's reporting API for new events.\n- By default, `var.interval` is set to 2 hours (2h). Consider changing this interval to a lower value, such as 10 minutes (10m).\n- See the following references for further information:\n  - https://support.google.com/a/answer/7061566\n  - https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-google_workspace.html","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Applications can be added and removed from blocklists by Google Workspace administrators, but they can all be explicitly allowed for users. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."],"from":"now-130m","interval":"10m","references":["https://support.google.com/a/answer/6089179?hl=en"],"tags":["Elastic","Cloud","Google Workspace","Continuous Monitoring","SecOps","Configuration Audit","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.001","name":"Disable or Modify Tools","reference":"https://attack.mitre.org/techniques/T1562/001/"}]}]}],"type":"query","index":["filebeat-*","logs-google_workspace*"],"language":"kuery","query":"event.dataset:\"google_workspace.admin\" and event.action:\"CHANGE_APPLICATION_SETTING\" and event.category:(iam or configuration)\n    and google_workspace.event.type:\"APPLICATION_SETTINGS\" and google_workspace.admin.application.name:\"Google Workspace Marketplace\"\n        and google_workspace.admin.setting.name:\"Apps Access Setting Allowlist access\"  and google_workspace.admin.new_value:\"ALLOW_ALL\"\n","related_integrations":[{"package":"google_workspace","version":"^1.2.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":false,"name":"google_workspace.admin.application.name","type":"keyword"},{"ecs":false,"name":"google_workspace.admin.new_value","type":"keyword"},{"ecs":false,"name":"google_workspace.admin.setting.name","type":"keyword"},{"ecs":false,"name":"google_workspace.event.type","type":"keyword"}],"setup":"The Google Workspace Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"Google Workspace Restrictions for Google Marketplace Modified to Allow Any App v2.0.1","rule_version":"2.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects when the Google Marketplace restrictions are changed to allow any application for users in Google Workspace. Malicious APKs created by adversaries may be uploaded to the Google marketplace but not installed on devices managed within Google Workspace. Administrators should set restrictions to not allow any application from the marketplace for security reasons. Adversaries may enable any app to be installed and executed on mobile devices within a Google Workspace environment prior to distributing the malicious APK to the end user.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"### Important Information Regarding Google Workspace Event Lag Times\n- As per Google's documentation, Google Workspace administrators may observe lag times ranging from minutes up to 3 days between the time of an event's occurrence and the event being visible in the Google Workspace admin/audit logs.\n- This rule is configured to run every 10 minutes with a lookback time of 130 minutes.\n- To reduce the risk of false negatives, consider reducing the interval that the Google Workspace (formerly G Suite) Filebeat module polls Google's reporting API for new events.\n- By default, `var.interval` is set to 2 hours (2h). Consider changing this interval to a lower value, such as 10 minutes (10m).\n- See the following references for further information:\n  - https://support.google.com/a/answer/7061566\n  - https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-google_workspace.html","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Applications can be added and removed from blocklists by Google Workspace administrators, but they can all be explicitly allowed for users. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."],"from":"now-130m","interval":"10m","references":["https://support.google.com/a/answer/6089179?hl=en"],"tags":["Elastic","Cloud","Google Workspace","Continuous Monitoring","SecOps","Configuration Audit","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.001","name":"Disable or Modify Tools","reference":"https://attack.mitre.org/techniques/T1562/001/"}]}]}],"type":"query","index":["filebeat-*","logs-google_workspace*"],"language":"kuery","query":"event.dataset:\"google_workspace.admin\" and event.action:\"CHANGE_APPLICATION_SETTING\" and event.category:(iam or configuration)\n    and google_workspace.event.type:\"APPLICATION_SETTINGS\" and google_workspace.admin.application.name:\"Google Workspace Marketplace\"\n        and google_workspace.admin.setting.name:\"Apps Access Setting Allowlist access\"  and google_workspace.admin.new_value:\"ALLOW_ALL\"\n","related_integrations":[{"package":"google_workspace","version":"^1.2.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":false,"name":"google_workspace.admin.application.name","type":"keyword"},{"ecs":false,"name":"google_workspace.admin.new_value","type":"keyword"},{"ecs":false,"name":"google_workspace.admin.setting.name","type":"keyword"},{"ecs":false,"name":"google_workspace.event.type","type":"keyword"}],"setup":"The Google Workspace Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},{"name":"Google Workspace Restrictions for Google Marketplace Modified to Allow Any App v2.0.2","rule_version":"2.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects when the Google Marketplace restrictions are changed to allow any application for users in Google Workspace. Malicious APKs created by adversaries may be uploaded to the Google marketplace but not installed on devices managed within Google Workspace. Administrators should set restrictions to not allow any application from the marketplace for security reasons. Adversaries may enable any app to be installed and executed on mobile devices within a Google Workspace environment prior to distributing the malicious APK to the end user.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"### Important Information Regarding Google Workspace Event Lag Times\n- As per Google's documentation, Google Workspace administrators may observe lag times ranging from minutes up to 3 days between the time of an event's occurrence and the event being visible in the Google Workspace admin/audit logs.\n- This rule is configured to run every 10 minutes with a lookback time of 130 minutes.\n- To reduce the risk of false negatives, consider reducing the interval that the Google Workspace (formerly G Suite) Filebeat module polls Google's reporting API for new events.\n- By default, `var.interval` is set to 2 hours (2h). Consider changing this interval to a lower value, such as 10 minutes (10m).\n- See the following references for further information:\n  - https://support.google.com/a/answer/7061566\n  - https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-google_workspace.html","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Applications can be added and removed from blocklists by Google Workspace administrators, but they can all be explicitly allowed for users. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."],"from":"now-130m","interval":"10m","references":["https://support.google.com/a/answer/6089179?hl=en"],"tags":["Elastic","Cloud","Google Workspace","Continuous Monitoring","SecOps","Configuration Audit","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.001","name":"Disable or Modify Tools","reference":"https://attack.mitre.org/techniques/T1562/001/"}]}]}],"type":"query","index":["filebeat-*","logs-google_workspace*"],"language":"kuery","query":"event.dataset:\"google_workspace.admin\" and event.action:\"CHANGE_APPLICATION_SETTING\" and event.category:(iam or configuration)\n    and google_workspace.event.type:\"APPLICATION_SETTINGS\" and google_workspace.admin.application.name:\"Google Workspace Marketplace\"\n        and google_workspace.admin.setting.name:\"Apps Access Setting Allowlist access\"  and google_workspace.admin.new_value:\"ALLOW_ALL\"\n","related_integrations":[{"package":"google_workspace","version":"^1.2.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":false,"name":"google_workspace.admin.application.name","type":"keyword"},{"ecs":false,"name":"google_workspace.admin.new_value","type":"keyword"},{"ecs":false,"name":"google_workspace.admin.setting.name","type":"keyword"},{"ecs":false,"name":"google_workspace.event.type","type":"keyword"}],"setup":"The Google Workspace Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."}]},"id":"a2795334-2499-11ed-9e1a-f661ea17fbce","type":"security-rule"}