{"attributes":{"rule_id":"b4449455-f986-4b5a-82ed-e36b129331f7","versions":[{"name":"Potential Persistence via Atom Init Script Modification v100.0.0","rule_version":"100.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies modifications to the Atom desktop text editor Init File. Adversaries may add malicious JavaScript code to the init.coffee file that will be executed upon the Atom application opening.","risk_score":21,"severity":"low","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-9m","references":["https://github.com/D00MFist/PersistentJXA/blob/master/AtomPersist.js","https://flight-manual.atom.io/hacking-atom/sections/the-init-file/"],"tags":["Elastic","Host","macOS","Threat Detection","Persistence"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1037","name":"Boot or Logon Initialization Scripts","reference":"https://attack.mitre.org/techniques/T1037/"}]}],"type":"query","index":["auditbeat-*","logs-endpoint.events.*"],"language":"kuery","query":"event.category:\"file\" and not event.type:\"deletion\" and\n file.path:/Users/*/.atom/init.coffee and not process.name:(Atom or xpcproxy) and not user.name:root\n","required_fields":[{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"event.type","type":"keyword"},{"ecs":true,"name":"file.path","type":"keyword"},{"ecs":true,"name":"process.name","type":"keyword"},{"ecs":true,"name":"user.name","type":"keyword"}]},{"name":"Potential Persistence via Atom Init Script Modification v100.0.1","rule_version":"100.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies modifications to the Atom desktop text editor Init File. Adversaries may add malicious JavaScript code to the init.coffee file that will be executed upon the Atom application opening.","risk_score":21,"severity":"low","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-9m","references":["https://github.com/D00MFist/PersistentJXA/blob/master/AtomPersist.js","https://flight-manual.atom.io/hacking-atom/sections/the-init-file/"],"tags":["Elastic","Host","macOS","Threat Detection","Persistence"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1037","name":"Boot or Logon Initialization Scripts","reference":"https://attack.mitre.org/techniques/T1037/"}]}],"type":"query","index":["auditbeat-*","logs-endpoint.events.*"],"language":"kuery","query":"event.category:\"file\" and not event.type:\"deletion\" and\n file.path:/Users/*/.atom/init.coffee and not process.name:(Atom or xpcproxy) and not user.name:root\n","required_fields":[{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"event.type","type":"keyword"},{"ecs":true,"name":"file.path","type":"keyword"},{"ecs":true,"name":"process.name","type":"keyword"},{"ecs":true,"name":"user.name","type":"keyword"}]},{"name":"Potential Persistence via Atom Init Script Modification v100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies modifications to the Atom desktop text editor Init File. Adversaries may add malicious JavaScript code to the init.coffee file that will be executed upon the Atom application opening.","risk_score":21,"severity":"low","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-9m","references":["https://github.com/D00MFist/PersistentJXA/blob/master/AtomPersist.js","https://flight-manual.atom.io/hacking-atom/sections/the-init-file/"],"tags":["Elastic","Host","macOS","Threat Detection","Persistence"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1037","name":"Boot or Logon Initialization Scripts","reference":"https://attack.mitre.org/techniques/T1037/"}]}],"type":"query","index":["auditbeat-*","logs-endpoint.events.*"],"language":"kuery","query":"event.category:\"file\" and not event.type:\"deletion\" and\n file.path:/Users/*/.atom/init.coffee and not process.name:(Atom or xpcproxy) and not user.name:root\n","required_fields":[{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"event.type","type":"keyword"},{"ecs":true,"name":"file.path","type":"keyword"},{"ecs":true,"name":"process.name","type":"keyword"},{"ecs":true,"name":"user.name","type":"keyword"}]}]},"id":"b4449455-f986-4b5a-82ed-e36b129331f7","type":"security-rule"}