{"attributes":{"rule_id":"cb71aa62-55c8-42f0-b0dd-afb0bb0b1f51","versions":[{"name":"Suspicious Calendar File Modification v100.0.0","rule_version":"100.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies suspicious modifications of the calendar file by an unusual process. Adversaries may create a custom calendar notification procedure to execute a malicious program at a recurring interval to establish persistence.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Trusted applications for managing calendars and reminders."],"from":"now-9m","references":["https://labs.f-secure.com/blog/operationalising-calendar-alerts-persistence-on-macos","https://github.com/FSecureLABS/CalendarPersist","https://github.com/D00MFist/PersistentJXA/blob/master/CalendarPersist.js"],"tags":["Elastic","Host","macOS","Threat Detection","Persistence"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546/"}]}],"type":"query","index":["logs-endpoint.events.*","auditbeat-*"],"language":"kuery","query":"event.category:file and event.action:modification and\n  file.path:/Users/*/Library/Calendars/*.calendar/Events/*.ics and\n  process.executable:\n  (* and not\n    (\n      /System/Library/* or\n      /System/Applications/Calendar.app/Contents/MacOS/* or\n      /System/Applications/Mail.app/Contents/MacOS/Mail or\n      /usr/libexec/xpcproxy or\n      /sbin/launchd or\n      /Applications/*\n    )\n  )\n","required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"file.path","type":"keyword"},{"ecs":true,"name":"process.executable","type":"keyword"}]},{"name":"Suspicious Calendar File Modification v100.0.1","rule_version":"100.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies suspicious modifications of the calendar file by an unusual process. Adversaries may create a custom calendar notification procedure to execute a malicious program at a recurring interval to establish persistence.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Trusted applications for managing calendars and reminders."],"from":"now-9m","references":["https://labs.f-secure.com/blog/operationalising-calendar-alerts-persistence-on-macos","https://github.com/FSecureLABS/CalendarPersist","https://github.com/D00MFist/PersistentJXA/blob/master/CalendarPersist.js"],"tags":["Elastic","Host","macOS","Threat Detection","Persistence"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546/"}]}],"type":"query","index":["logs-endpoint.events.*","auditbeat-*"],"language":"kuery","query":"event.category:file and event.action:modification and\n  file.path:/Users/*/Library/Calendars/*.calendar/Events/*.ics and\n  process.executable:\n  (* and not\n    (\n      /System/Library/* or\n      /System/Applications/Calendar.app/Contents/MacOS/* or\n      /System/Applications/Mail.app/Contents/MacOS/Mail or\n      /usr/libexec/xpcproxy or\n      /sbin/launchd or\n      /Applications/*\n    )\n  )\n","required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"file.path","type":"keyword"},{"ecs":true,"name":"process.executable","type":"keyword"}]},{"name":"Suspicious Calendar File Modification v100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies suspicious modifications of the calendar file by an unusual process. Adversaries may create a custom calendar notification procedure to execute a malicious program at a recurring interval to establish persistence.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Trusted applications for managing calendars and reminders."],"from":"now-9m","references":["https://labs.f-secure.com/blog/operationalising-calendar-alerts-persistence-on-macos","https://github.com/FSecureLABS/CalendarPersist","https://github.com/D00MFist/PersistentJXA/blob/master/CalendarPersist.js"],"tags":["Elastic","Host","macOS","Threat Detection","Persistence"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546/"}]}],"type":"query","index":["logs-endpoint.events.*","auditbeat-*"],"language":"kuery","query":"event.category:file and event.action:modification and\n  file.path:/Users/*/Library/Calendars/*.calendar/Events/*.ics and\n  process.executable:\n  (* and not\n    (\n      /System/Library/* or\n      /System/Applications/Calendar.app/Contents/MacOS/* or\n      /System/Applications/Mail.app/Contents/MacOS/Mail or\n      /usr/libexec/xpcproxy or\n      /sbin/launchd or\n      /Applications/*\n    )\n  )\n","required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"file.path","type":"keyword"},{"ecs":true,"name":"process.executable","type":"keyword"}]}]},"id":"cb71aa62-55c8-42f0-b0dd-afb0bb0b1f51","type":"security-rule"}