{"attributes":{"rule_id":"d49cc73f-7a16-4def-89ce-9fc7127d7820","versions":[{"name":"Web Application Suspicious Activity: sqlmap User Agent v100.0.0","rule_version":"100.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"This is an example of how to detect an unwanted web client user agent. This search matches the user agent for sqlmap 1.3.11, which is a popular FOSS tool for testing web applications for SQL injection vulnerabilities.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This rule does not indicate that a SQL injection attack occurred, only that the `sqlmap` tool was used. Security scans and tests may result in these errors. If the source is not an authorized security tester, this is generally suspicious or malicious activity."],"references":["http://sqlmap.org/"],"tags":["Elastic","APM"],"type":"query","index":["apm-*-transaction*","traces-apm*"],"language":"kuery","query":"user_agent.original:\"sqlmap/1.3.11#stable (http://sqlmap.org)\"\n","required_fields":[{"ecs":true,"name":"user_agent.original","type":"keyword"}]},{"name":"Web Application Suspicious Activity: sqlmap User Agent v100.0.1","rule_version":"100.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"This is an example of how to detect an unwanted web client user agent. This search matches the user agent for sqlmap 1.3.11, which is a popular FOSS tool for testing web applications for SQL injection vulnerabilities.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This rule does not indicate that a SQL injection attack occurred, only that the `sqlmap` tool was used. Security scans and tests may result in these errors. If the source is not an authorized security tester, this is generally suspicious or malicious activity."],"references":["http://sqlmap.org/"],"tags":["Elastic","APM"],"type":"query","index":["apm-*-transaction*","traces-apm*"],"language":"kuery","query":"user_agent.original:\"sqlmap/1.3.11#stable (http://sqlmap.org)\"\n","required_fields":[{"ecs":true,"name":"user_agent.original","type":"keyword"}]},{"name":"Web Application Suspicious Activity: sqlmap User Agent v100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"This is an example of how to detect an unwanted web client user agent. This search matches the user agent for sqlmap 1.3.11, which is a popular FOSS tool for testing web applications for SQL injection vulnerabilities.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This rule does not indicate that a SQL injection attack occurred, only that the `sqlmap` tool was used. Security scans and tests may result in these errors. If the source is not an authorized security tester, this is generally suspicious or malicious activity."],"references":["http://sqlmap.org/"],"tags":["Elastic","APM"],"type":"query","index":["apm-*-transaction*","traces-apm*"],"language":"kuery","query":"user_agent.original:\"sqlmap/1.3.11#stable (http://sqlmap.org)\"\n","required_fields":[{"ecs":true,"name":"user_agent.original","type":"keyword"}]}]},"id":"d49cc73f-7a16-4def-89ce-9fc7127d7820","type":"security-rule"}