{"attributes":{"name":"Azure AD Global Administrator Role Assigned v101.0.1","rule_id":"04c5a96f-19c5-44fd-9571-a0b033f9086f:101.0.1","rule_version":"101.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"In Azure Active Directory (Azure AD), permissions to manage resources are assigned using roles. The Global Administrator is a role that enables users to have access to all administrative features in Azure AD and services that use Azure AD identities like the Microsoft 365 Defender portal, the Microsoft 365 compliance center, Exchange, SharePoint Online, and Skype for Business Online. Attackers can add users as Global Administrators to maintain access and manage all subscriptions and their settings and resources.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-25m","references":["https://docs.microsoft.com/en-us/azure/active-directory/roles/permissions-reference#global-administrator"],"tags":["Elastic","Cloud","Azure","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098/","subtechnique":[{"id":"T1098.003","name":"Additional Cloud Roles","reference":"https://attack.mitre.org/techniques/T1098/003/"}]}]}],"type":"query","index":["filebeat-*","logs-azure*"],"language":"kuery","query":"event.dataset:azure.auditlogs and azure.auditlogs.properties.category:RoleManagement and\nazure.auditlogs.operation_name:\"Add member to role\" and\nazure.auditlogs.properties.target_resources.0.modified_properties.1.new_value:\"\\\"Global Administrator\\\"\"\n","related_integrations":[{"package":"azure","version":"^1.0.0"}],"required_fields":[{"ecs":false,"name":"azure.auditlogs.operation_name","type":"keyword"},{"ecs":false,"name":"azure.auditlogs.properties.category","type":"keyword"},{"ecs":false,"name":"azure.auditlogs.properties.target_resources.0.modified_properties.1.new_value","type":"unknown"},{"ecs":true,"name":"event.dataset","type":"keyword"}],"setup":"The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"04c5a96f-19c5-44fd-9571-a0b033f9086f:101.0.1","type":"security-rule"}