{"attributes":{"name":"Microsoft IIS Service Account Password Dumped v102.0.1","rule_id":"0564fb9d-90b9-4234-a411-82a546dc1343:102.0.1","rule_version":"102.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies the Internet Information Services (IIS) command-line tool, AppCmd, being used to list passwords. An attacker with IIS web server access via a web shell can decrypt and dump the IIS AppPool service account password using AppCmd.","risk_score":73,"severity":"high","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-9m","max_signals":33,"references":["https://blog.netspi.com/decrypting-iis-passwords-to-break-out-of-the-dmz-part-1/"],"tags":["Elastic","Host","Windows","Threat Detection","Credential Access","Elastic Endgame"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/"}]}],"language":"eql","query":"process where event.type == \"start\" and\n   (process.name : \"appcmd.exe\" or process.pe.original_file_name == \"appcmd.exe\") and\n   process.args : \"/list\" and process.args : \"/text*password\"\n","type":"eql","index":["winlogbeat-*","logs-endpoint.events.*","logs-windows.*","endgame-*"],"required_fields":[{"ecs":true,"name":"event.type","type":"keyword"},{"ecs":true,"name":"process.args","type":"keyword"},{"ecs":true,"name":"process.name","type":"keyword"},{"ecs":true,"name":"process.pe.original_file_name","type":"keyword"}],"setup":"If enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work."},"id":"0564fb9d-90b9-4234-a411-82a546dc1343:102.0.1","type":"security-rule"}