{"attributes":{"name":"Local Account TokenFilter Policy Disabled v1.0.2","rule_id":"07b1ef73-1fde-4a49-a34a-5dd40011b076:1.0.2","rule_version":"1.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies registry modification to the LocalAccountTokenFilterPolicy policy. If this value exists (which doesn't by default) and is set to 1, then remote connections from all local members of Administrators are granted full high-integrity tokens during negotiation.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-9m","references":["https://www.stigviewer.com/stig/windows_server_2008_r2_member_server/2014-04-02/finding/V-36439","https://posts.specterops.io/pass-the-hash-is-dead-long-live-localaccounttokenfilterpolicy-506c25a7c167","https://www.welivesecurity.com/wp-content/uploads/2018/01/ESET_Turla_Mosquito.pdf"],"tags":["Elastic","Host","Windows","Threat Detection","Defense Evasion","Privilege Escalation","Elastic Endgame"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.003","name":"Local Accounts","reference":"https://attack.mitre.org/techniques/T1078/003/"}]}]}],"language":"eql","query":"registry where registry.path : (\n  \"HKLM\\\\*\\\\LocalAccountTokenFilterPolicy\",\n  \"\\\\REGISTRY\\\\MACHINE\\\\*\\\\LocalAccountTokenFilterPolicy\") and\n  registry.data.strings : (\"1\", \"0x00000001\")\n","type":"eql","index":["winlogbeat-*","logs-endpoint.events.*","logs-windows.*","endgame-*"],"required_fields":[{"ecs":true,"name":"registry.data.strings","type":"wildcard"},{"ecs":true,"name":"registry.path","type":"keyword"}]},"id":"07b1ef73-1fde-4a49-a34a-5dd40011b076:1.0.2","type":"security-rule"}