{"attributes":{"name":"AWS RDS Snapshot Export v101.0.1","rule_id":"119c8877-8613-416d-a98a-96b6664ee73a:101.0.1","rule_version":"101.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies the export of an Amazon Relational Database Service (RDS) Aurora database snapshot.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic","Austin Songer"],"false_positives":["Exporting snapshots may be done by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Snapshot exports from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-60m","interval":"10m","references":["https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_StartExportTask.html"],"tags":["Elastic","Cloud","AWS","Continuous Monitoring","SecOps","Asset Visibility","Exfiltration"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0010","name":"Exfiltration","reference":"https://attack.mitre.org/tactics/TA0010/"},"technique":[]}],"type":"query","index":["filebeat-*","logs-aws*"],"language":"kuery","query":"event.dataset:aws.cloudtrail and event.provider:rds.amazonaws.com and event.action:StartExportTask and event.outcome:success\n","related_integrations":[{"integration":"cloudtrail","package":"aws","version":"^1.5.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"},{"ecs":true,"name":"event.provider","type":"keyword"}],"setup":"The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"119c8877-8613-416d-a98a-96b6664ee73a:101.0.1","type":"security-rule"}