{"attributes":{"name":"Azure Automation Runbook Created or Modified v101.0.1","rule_id":"16280f1e-57e6-4242-aa21-bb4d16f13b2f:101.0.1","rule_version":"101.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when an Azure Automation runbook is created or modified. An adversary may create or modify an Azure Automation runbook to execute malicious code and maintain persistence in their target's environment.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-25m","references":["https://powerzure.readthedocs.io/en/latest/Functions/operational.html#create-backdoor","https://github.com/hausec/PowerZure","https://posts.specterops.io/attacking-azure-azure-ad-and-introducing-powerzure-ca70b330511a","https://azure.microsoft.com/en-in/blog/azure-automation-runbook-management/"],"tags":["Elastic","Cloud","Azure","Continuous Monitoring","SecOps","Configuration Audit"],"type":"query","index":["filebeat-*","logs-azure*"],"language":"kuery","query":"event.dataset:azure.activitylogs and\n  azure.activitylogs.operation_name:\n  (\n    \"MICROSOFT.AUTOMATION/AUTOMATIONACCOUNTS/RUNBOOKS/DRAFT/WRITE\" or\n    \"MICROSOFT.AUTOMATION/AUTOMATIONACCOUNTS/RUNBOOKS/WRITE\" or\n    \"MICROSOFT.AUTOMATION/AUTOMATIONACCOUNTS/RUNBOOKS/PUBLISH/ACTION\"\n  ) and\n  event.outcome:(Success or success)\n","related_integrations":[{"integration":"activitylogs","package":"azure","version":"^1.0.0"}],"required_fields":[{"ecs":false,"name":"azure.activitylogs.operation_name","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"}],"setup":"The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"16280f1e-57e6-4242-aa21-bb4d16f13b2f:101.0.1","type":"security-rule"}