{"attributes":{"name":"AWS IAM Group Creation v101.0.2","rule_id":"169f3a93-efc7-4df2-94d6-0d9438c310d1:101.0.2","rule_version":"101.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies the creation of a group in AWS Identity and Access Management (IAM). Groups specify permissions for multiple users. Any user in a group automatically has the permissions that are assigned to the group.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["A group may be created by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Group creations by unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-60m","interval":"10m","references":["https://awscli.amazonaws.com/v2/documentation/api/latest/reference/iam/create-group.html","https://docs.aws.amazon.com/IAM/latest/APIReference/API_CreateGroup.html"],"tags":["Elastic","Cloud","AWS","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136/","subtechnique":[{"id":"T1136.003","name":"Cloud Account","reference":"https://attack.mitre.org/techniques/T1136/003/"}]}]}],"type":"query","index":["filebeat-*","logs-aws*"],"language":"kuery","query":"event.dataset:aws.cloudtrail and event.provider:iam.amazonaws.com and event.action:CreateGroup and event.outcome:success\n","related_integrations":[{"integration":"cloudtrail","package":"aws","version":"^1.5.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"},{"ecs":true,"name":"event.provider","type":"keyword"}],"setup":"The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"169f3a93-efc7-4df2-94d6-0d9438c310d1:101.0.2","type":"security-rule"}