{"attributes":{"name":"Suspicious ImagePath Service Creation v100.0.1","rule_id":"36a8e048-d888-4f61-a8b9-0f9e2e40f317:100.0.1","rule_version":"100.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies the creation of a suspicious ImagePath value. This could be an indication of an adversary attempting to stealthily persist or escalate privileges through abnormal service creation.","risk_score":73,"severity":"high","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-9m","tags":["Elastic","Host","Windows","Threat Detection","Persistence"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543/","subtechnique":[{"id":"T1543.003","name":"Windows Service","reference":"https://attack.mitre.org/techniques/T1543/003/"}]}]}],"language":"eql","query":"registry where registry.path : \"HKLM\\\\SYSTEM\\\\ControlSet*\\\\Services\\\\*\\\\ImagePath\" and\n /* add suspicious registry ImagePath values here */\n registry.data.strings : (\"%COMSPEC%*\", \"*\\\\.\\\\pipe\\\\*\")\n","type":"eql","index":["logs-endpoint.events.*"],"required_fields":[{"ecs":true,"name":"registry.data.strings","type":"wildcard"},{"ecs":true,"name":"registry.path","type":"keyword"}]},"id":"36a8e048-d888-4f61-a8b9-0f9e2e40f317:100.0.1","type":"security-rule"}