{"attributes":{"name":"Attempted Bypass of Okta MFA v102.0.2","rule_id":"3805c3dc-f82c-4f8d-891e-63c24d3102b0:102.0.2","rule_version":"102.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects attempts to bypass Okta multi-factor authentication (MFA). An adversary may attempt to bypass the Okta MFA policies configured for an organization in order to obtain unauthorized access to an application.","risk_score":73,"severity":"high","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/","https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy"],"tags":["Elastic","Identity","Okta","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1111","name":"Multi-Factor Authentication Interception","reference":"https://attack.mitre.org/techniques/T1111/"}]}],"type":"query","index":["filebeat-*","logs-okta*"],"language":"kuery","query":"event.dataset:okta.system and event.action:user.mfa.attempt_bypass\n","related_integrations":[{"package":"okta","version":"^1.3.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"}],"setup":"The Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"3805c3dc-f82c-4f8d-891e-63c24d3102b0:102.0.2","type":"security-rule"}