{"attributes":{"name":"Malware - Prevented - Elastic Endgame v100.0.0","rule_id":"3b382770-efbb-44f4-beed-f5e0a051b895:100.0.0","rule_version":"100.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Elastic Endgame prevented Malware. Click the Elastic Endgame icon in the event.module column or the link in the rule.reference column for additional information.","risk_score":73,"severity":"high","license":"Elastic License v2","author":["Elastic"],"from":"now-15m","interval":"10m","max_signals":10000,"tags":["Elastic","Elastic Endgame"],"type":"query","index":["endgame-*"],"language":"kuery","query":"event.kind:alert and event.module:endgame and endgame.metadata.type:prevention and (event.action:file_classification_event or endgame.event_subtype_full:file_classification_event)\n","required_fields":[{"ecs":false,"name":"endgame.event_subtype_full","type":"unknown"},{"ecs":false,"name":"endgame.metadata.type","type":"unknown"},{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.kind","type":"keyword"},{"ecs":true,"name":"event.module","type":"keyword"}]},"id":"3b382770-efbb-44f4-beed-f5e0a051b895:100.0.0","type":"security-rule"}