{"attributes":{"name":"Binary Executed from Shared Memory Directory v101.0.2","rule_id":"3f3f9fe2-d095-11ec-95dc-f661ea17fbce:101.0.2","rule_version":"101.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies the execution of a binary by root in Linux shared memory directories: (/dev/shm/, /run/shm/, /var/run/, /var/lock/). This activity is to be considered highly abnormal and should be investigated. Threat actors have placed executables used for persistence on high-uptime servers in these directories as system backdoors.","risk_score":73,"severity":"high","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Directories /dev/shm and /run/shm are temporary file storage directories in Linux. They are intended to appear as a mounted file system, but uses virtual memory instead of a persistent storage device and thus are used for mounting file systems in legitimate purposes."],"from":"now-9m","references":["https://linuxsecurity.com/features/fileless-malware-on-linux","https://twitter.com/GossiTheDog/status/1522964028284411907","https://www.elastic.co/security-labs/a-peek-behind-the-bpfdoor"],"tags":["Elastic","Host","Linux","Threat Detection","Execution","BPFDoor"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/"}]}],"language":"eql","query":"process where event.type == \"start\" and\n    event.action == \"exec\" and user.name == \"root\" and\n    process.executable : (\n        \"/dev/shm/*\",\n        \"/run/shm/*\",\n        \"/var/run/*\",\n        \"/var/lock/*\"\n    ) and\n    not process.executable : ( \"/var/run/docker/*\")\n","type":"eql","index":["logs-endpoint.events.*"],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.type","type":"keyword"},{"ecs":true,"name":"process.executable","type":"keyword"},{"ecs":true,"name":"user.name","type":"keyword"}]},"id":"3f3f9fe2-d095-11ec-95dc-f661ea17fbce:101.0.2","type":"security-rule"}