{"attributes":{"name":"Web Application Suspicious Activity: No User Agent v100.0.2","rule_id":"43303fd4-4839-4e48-b2b2-803ab060758d:100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"A request to a web application server contained no identifying user agent string.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Some normal applications and scripts may contain no user agent. Most legitimate web requests from the Internet contain a user agent string. Requests from web browsers almost always contain a user agent string. If the source is unexpected, the user unauthorized, or the request unusual, these may indicate suspicious or malicious activity."],"references":["https://en.wikipedia.org/wiki/User_agent"],"tags":["Elastic","APM"],"type":"query","filters":[{"$state":{"store":"appState"},"exists":{"field":"user_agent.original"},"meta":{"disabled":false,"indexRefName":"kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index","key":"user_agent.original","negate":true,"type":"exists","value":"exists"}}],"index":["apm-*-transaction*","traces-apm*"],"language":"kuery","query":"url.path:*\n","required_fields":[{"ecs":true,"name":"url.path","type":"wildcard"}]},"id":"43303fd4-4839-4e48-b2b2-803ab060758d:100.0.2","type":"security-rule"}