{"attributes":{"name":"AWS GuardDuty Detector Deletion v101.0.2","rule_id":"523116c0-d89d-4d7c-82c2-39e6845a78ef:101.0.2","rule_version":"101.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies the deletion of an Amazon GuardDuty detector. Upon deletion, GuardDuty stops monitoring the environment and all existing findings are lost.","risk_score":73,"severity":"high","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["The GuardDuty detector may be deleted by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Detector deletions by unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-60m","interval":"10m","references":["https://awscli.amazonaws.com/v2/documentation/api/latest/reference/guardduty/delete-detector.html","https://docs.aws.amazon.com/guardduty/latest/APIReference/API_DeleteDetector.html"],"tags":["Elastic","Cloud","AWS","Continuous Monitoring","SecOps","Monitoring"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.001","name":"Disable or Modify Tools","reference":"https://attack.mitre.org/techniques/T1562/001/"}]}]}],"type":"query","index":["filebeat-*","logs-aws*"],"language":"kuery","query":"event.dataset:aws.cloudtrail and event.provider:guardduty.amazonaws.com and event.action:DeleteDetector and event.outcome:success\n","related_integrations":[{"integration":"cloudtrail","package":"aws","version":"^1.5.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"},{"ecs":true,"name":"event.provider","type":"keyword"}],"setup":"The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"523116c0-d89d-4d7c-82c2-39e6845a78ef:101.0.2","type":"security-rule"}