{"attributes":{"name":"AWS EFS File System or Mount Deleted v101.0.2","rule_id":"536997f7-ae73-447d-a12d-bff1e8f5f0a0:101.0.2","rule_version":"101.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects when an EFS File System or Mount is deleted. An adversary could break any file system using the mount target that is being deleted, which might disrupt instances or applications using those mounts. The mount must be deleted prior to deleting the File System, or the adversary will be unable to delete the File System.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Austin Songer"],"false_positives":["File System or Mount being deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. File System Mount deletion by unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-60m","interval":"10m","references":["https://docs.aws.amazon.com/efs/latest/ug/API_DeleteFileSystem.html","https://docs.aws.amazon.com/efs/latest/ug/API_DeleteMountTarget.html"],"tags":["Elastic","Cloud","AWS","Continuous Monitoring","SecOps","Data Protection"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0040","name":"Impact","reference":"https://attack.mitre.org/tactics/TA0040/"},"technique":[{"id":"T1485","name":"Data Destruction","reference":"https://attack.mitre.org/techniques/T1485/"}]}],"type":"query","index":["filebeat-*","logs-aws*"],"language":"kuery","query":"event.dataset:aws.cloudtrail and event.provider:elasticfilesystem.amazonaws.com and\nevent.action:(DeleteMountTarget or DeleteFileSystem) and event.outcome:success\n","related_integrations":[{"integration":"cloudtrail","package":"aws","version":"^1.5.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"},{"ecs":true,"name":"event.provider","type":"keyword"}],"setup":"The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"536997f7-ae73-447d-a12d-bff1e8f5f0a0:101.0.2","type":"security-rule"}