{"attributes":{"name":"Attempt to Modify an Okta Policy v102.0.0","rule_id":"6731fbf2-8f28-49ed-9ab9-9a918ceb5a45:102.0.0","rule_version":"102.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects attempts to modify an Okta policy. An adversary may attempt to modify an Okta policy in order to weaken an organization's security controls. For example, an adversary may attempt to modify an Okta multi-factor authentication (MFA) policy in order to weaken the authentication requirements for user accounts.","risk_score":21,"severity":"low","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Consider adding exceptions to this rule to filter false positives if Okta policies are regularly modified in your organization."],"references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/","https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy"],"tags":["Elastic","Identity","Okta","Continuous Monitoring","SecOps","Monitoring","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.007","name":"Disable or Modify Cloud Firewall","reference":"https://attack.mitre.org/techniques/T1562/007/"}]}]}],"type":"query","index":["filebeat-*","logs-okta*"],"language":"kuery","query":"event.dataset:okta.system and event.action:policy.lifecycle.update\n","related_integrations":[{"package":"okta","version":"^1.3.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"}],"setup":"The Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"6731fbf2-8f28-49ed-9ab9-9a918ceb5a45:102.0.0","type":"security-rule"}