{"attributes":{"name":"Scheduled Task Created by a Windows Script v100.0.2","rule_id":"689b9d57-e4d5-4357-ad17-9c334609d79a:100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"A scheduled task was created by a Windows script via cscript.exe, wscript.exe or powershell.exe. This can be abused by an adversary to establish persistence.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"## Triage and analysis\n\nDecode the base64 encoded Tasks Actions registry value to investigate the task's configured action.","author":["Elastic"],"false_positives":["Legitimate scheduled tasks may be created during installation of new software."],"from":"now-9m","tags":["Elastic","Host","Windows","Threat Detection","Persistence"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1053","name":"Scheduled Task/Job","reference":"https://attack.mitre.org/techniques/T1053/","subtechnique":[{"id":"T1053.005","name":"Scheduled Task","reference":"https://attack.mitre.org/techniques/T1053/005/"}]}]}],"language":"eql","query":"sequence by host.id with maxspan = 30s\n  [any where (event.category == \"library\" or (event.category == \"process\" and event.action : \"Image loaded*\")) and\n   (dll.name : \"taskschd.dll\" or file.name : \"taskschd.dll\") and\n   process.name : (\"cscript.exe\", \"wscript.exe\", \"powershell.exe\", \"pwsh.exe\", \"powershell_ise.exe\")]\n  [registry where registry.path : \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\\Tasks\\\\*\\\\Actions\"]\n","type":"eql","index":["winlogbeat-*","logs-endpoint.events.*","logs-windows.*"],"required_fields":[{"ecs":true,"name":"dll.name","type":"keyword"},{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"file.name","type":"keyword"},{"ecs":true,"name":"host.id","type":"keyword"},{"ecs":true,"name":"process.name","type":"keyword"},{"ecs":true,"name":"registry.path","type":"keyword"}]},"id":"689b9d57-e4d5-4357-ad17-9c334609d79a:100.0.2","type":"security-rule"}