{"attributes":{"name":"Suspicious WMIC XSL Script Execution v101.0.1","rule_id":"7f370d54-c0eb-4270-ac5a-9a6020585dc6:101.0.1","rule_version":"101.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies WMIC allowlist bypass techniques by alerting on suspicious execution of scripts. When WMIC loads scripting libraries it may be indicative of an allowlist bypass.","risk_score":47,"severity":"medium","license":"Elastic License v2","author":["Elastic"],"from":"now-9m","tags":["Elastic","Host","Windows","Threat Detection","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1220","name":"XSL Script Processing","reference":"https://attack.mitre.org/techniques/T1220/"}]}],"language":"eql","query":"sequence by process.entity_id with maxspan = 2m\n[process where event.type == \"start\" and\n   (process.name : \"WMIC.exe\" or process.pe.original_file_name : \"wmic.exe\") and\n   process.args : (\"format*:*\", \"/format*:*\", \"*-format*:*\") and\n   not process.command_line : \"* /format:table *\"]\n[any where (event.category == \"library\" or (event.category == \"process\" and event.action : \"Image loaded*\")) and\n (dll.name : (\"jscript.dll\", \"vbscript.dll\") or file.name : (\"jscript.dll\", \"vbscript.dll\"))]\n","type":"eql","index":["winlogbeat-*","logs-endpoint.events.*","logs-windows.*"],"required_fields":[{"ecs":true,"name":"dll.name","type":"keyword"},{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"event.type","type":"keyword"},{"ecs":true,"name":"file.name","type":"keyword"},{"ecs":true,"name":"process.args","type":"keyword"},{"ecs":true,"name":"process.command_line","type":"wildcard"},{"ecs":true,"name":"process.entity_id","type":"keyword"},{"ecs":true,"name":"process.name","type":"keyword"},{"ecs":true,"name":"process.pe.original_file_name","type":"keyword"}]},"id":"7f370d54-c0eb-4270-ac5a-9a6020585dc6:101.0.1","type":"security-rule"}