{"attributes":{"name":"Process Injection - Detected - Elastic Endgame v100.0.2","rule_id":"80c52164-c82a-402c-9964-852533d58be1:100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Elastic Endgame detected Process Injection. Click the Elastic Endgame icon in the event.module column or the link in the rule.reference column for additional information.","risk_score":73,"severity":"high","license":"Elastic License v2","author":["Elastic"],"from":"now-15m","interval":"10m","max_signals":10000,"tags":["Elastic","Elastic Endgame","Threat Detection","Privilege Escalation"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055/"}]}],"type":"query","index":["endgame-*"],"language":"kuery","query":"event.kind:alert and event.module:endgame and endgame.metadata.type:detection and (event.action:kernel_shellcode_event or endgame.event_subtype_full:kernel_shellcode_event)\n","required_fields":[{"ecs":false,"name":"endgame.event_subtype_full","type":"unknown"},{"ecs":false,"name":"endgame.metadata.type","type":"unknown"},{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.kind","type":"keyword"},{"ecs":true,"name":"event.module","type":"keyword"}]},"id":"80c52164-c82a-402c-9964-852533d58be1:100.0.2","type":"security-rule"}