{"attributes":{"name":"Temporarily Scheduled Task Creation v2.0.1","rule_id":"81ff45f8-f8c2-4e28-992e-5a0e8d98e0fe:2.0.1","rule_version":"2.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Indicates the creation and deletion of a scheduled task within a short time interval. Adversaries can use these to proxy malicious execution via the schedule service and perform clean up.","risk_score":47,"severity":"medium","license":"Elastic License v2","author":["Elastic"],"false_positives":["Legitimate scheduled tasks may be created during installation of new software."],"from":"now-9m","references":["https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698"],"tags":["Elastic","Host","Windows","Threat Detection","Defense Evasion","Persistence"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1053","name":"Scheduled Task/Job","reference":"https://attack.mitre.org/techniques/T1053/","subtechnique":[{"id":"T1053.005","name":"Scheduled Task","reference":"https://attack.mitre.org/techniques/T1053/005/"}]}]}],"language":"eql","query":"sequence by host.id, winlog.event_data.TaskName with maxspan=5m\n   [iam where event.action == \"scheduled-task-created\" and not user.name : \"*$\"]\n   [iam where event.action == \"scheduled-task-deleted\" and not user.name : \"*$\"]\n","type":"eql","index":["winlogbeat-*","logs-system.*"],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"host.id","type":"keyword"},{"ecs":true,"name":"user.name","type":"keyword"},{"ecs":false,"name":"winlog.event_data.TaskName","type":"unknown"}]},"id":"81ff45f8-f8c2-4e28-992e-5a0e8d98e0fe:2.0.1","type":"security-rule"}