{"attributes":{"name":"Microsoft 365 Global Administrator Role Assigned v101.0.1","rule_id":"88671231-6626-4e1b-abb7-6e361a171fbb:101.0.1","rule_version":"101.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"In Azure Active Directory (Azure AD), permissions to manage resources are assigned using roles. The Global Administrator is a role that enables users to have access to all administrative features in Azure AD and services that use Azure AD identities like the Microsoft 365 Defender portal, the Microsoft 365 compliance center, Exchange, SharePoint Online, and Skype for Business Online. Attackers can add users as Global Administrators to maintain access and manage all subscriptions and their settings and resources.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-25m","references":["https://docs.microsoft.com/en-us/azure/active-directory/roles/permissions-reference#global-administrator"],"tags":["Elastic","Cloud","Microsoft 365","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098/","subtechnique":[{"id":"T1098.003","name":"Additional Cloud Roles","reference":"https://attack.mitre.org/techniques/T1098/003/"}]}]}],"type":"query","index":["filebeat-*","logs-o365*"],"language":"kuery","query":"event.dataset:o365.audit and event.code:\"AzureActiveDirectory\" and event.action:\"Add member to role.\" and\no365.audit.ModifiedProperties.Role_DisplayName.NewValue:\"Global Administrator\"\n","related_integrations":[{"package":"o365","version":"^1.3.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.code","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"},{"ecs":false,"name":"o365.audit.ModifiedProperties.Role_DisplayName.NewValue","type":"unknown"}],"setup":"The Office 365 Logs Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"88671231-6626-4e1b-abb7-6e361a171fbb:101.0.1","type":"security-rule"}