{"attributes":{"name":"SeDebugPrivilege Enabled by a Suspicious Process v1.0.1","rule_id":"97020e61-e591-4191-8a3b-2861a2b887cd:1.0.1","rule_version":"1.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies the creation of a process running as SYSTEM and impersonating a Windows core binary privileges. Adversaries may create a new process with a different token to escalate privileges and bypass access controls.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-9m","references":["https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4703","https://blog.palantir.com/windows-privilege-abuse-auditing-detection-and-defense-3078a403d74e"],"tags":["Elastic","Host","Windows","Threat Detection","Privilege Escalation"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1134","name":"Access Token Manipulation","reference":"https://attack.mitre.org/techniques/T1134/"}]}],"language":"eql","query":"any where event.provider: \"Microsoft-Windows-Security-Auditing\" and\n event.action : \"Token Right Adjusted Events\" and\n\n winlog.event_data.EnabledPrivilegeList : \"SeDebugPrivilege\" and\n\n /* exclude processes with System Integrity  */\n not winlog.event_data.SubjectUserSid : (\"S-1-5-18\", \"S-1-5-19\", \"S-1-5-20\") and\n\n not winlog.event_data.ProcessName :\n         (\"?:\\\\Windows\\\\System32\\\\msiexec.exe\",\n          \"?:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\",\n          \"?:\\\\Windows\\\\System32\\\\lsass.exe\",\n          \"?:\\\\Windows\\\\WinSxS\\\\*\",\n          \"?:\\\\Program Files\\\\*\",\n          \"?:\\\\Program Files (x86)\\\\*\",\n          \"?:\\\\Windows\\\\System32\\\\MRT.exe\",\n          \"?:\\\\Windows\\\\System32\\\\cleanmgr.exe\",\n          \"?:\\\\Windows\\\\System32\\\\taskhostw.exe\",\n          \"?:\\\\Windows\\\\System32\\\\mmc.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Temp\\\\*-*\\\\DismHost.exe\",\n          \"?:\\\\Windows\\\\System32\\\\auditpol.exe\",\n          \"?:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSe.exe\",\n          \"?:\\\\Windows\\\\SysWOW64\\\\wbem\\\\WmiPrvSe.exe\")\n","type":"eql","index":["winlogbeat-*","logs-windows.*"],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.provider","type":"keyword"},{"ecs":false,"name":"winlog.event_data.EnabledPrivilegeList","type":"unknown"},{"ecs":false,"name":"winlog.event_data.ProcessName","type":"keyword"},{"ecs":false,"name":"winlog.event_data.SubjectUserSid","type":"keyword"}],"setup":"Windows Event 4703 logs Token Privileges changes and need to be configured (Enable).\n\nSteps to implement the logging policy with with Advanced Audit Configuration:\n\n```\nComputer Configuration >\nPolicies >\nWindows Settings >\nSecurity Settings >\nAdvanced Audit Policies Configuration >\nAudit Policies >\nDetailed Tracking >\nToken Right Adjusted Events (Success)\n```"},"id":"97020e61-e591-4191-8a3b-2861a2b887cd:1.0.1","type":"security-rule"}