{"attributes":{"name":"Potential Abuse of Repeated MFA Push Notifications v101.0.2","rule_id":"97a8e584-fd3b-421f-9b9d-9c9d9e57e9d7:101.0.2","rule_version":"101.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Detects when an attacker abuses the Multi-Factor authentication mechanism by repeatedly issuing login requests until the user eventually accepts the Okta push notification. An adversary may attempt to bypass the Okta MFA policies configured for an organization to obtain unauthorized access.","risk_score":73,"severity":"high","license":"Elastic License v2","note":"","author":["Elastic"],"references":["https://www.mandiant.com/resources/russian-targeting-gov-business","https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy"],"tags":["Elastic","Identity","Okta","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/"}]}],"language":"eql","query":"sequence by user.email with maxspan=10m\n  [any where event.module == \"okta\" and event.action == \"user.mfa.okta_verify.deny_push\"]\n  [any where event.module == \"okta\" and event.action == \"user.mfa.okta_verify.deny_push\"]\n  [any where event.module == \"okta\" and event.action == \"user.authentication.sso\"]\n","type":"eql","index":["filebeat-*","logs-okta*"],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.module","type":"keyword"},{"ecs":true,"name":"user.email","type":"keyword"}],"setup":"The Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"97a8e584-fd3b-421f-9b9d-9c9d9e57e9d7:101.0.2","type":"security-rule"}