{"attributes":{"name":"Web Application Suspicious Activity: POST Request Declined v100.0.1","rule_id":"a87a4e42-1d82-44bd-b0bf-d9b7f91fb89e:100.0.1","rule_version":"100.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"A POST request to a web application returned a 403 response, which indicates the web application declined to process the request because the action requested was not allowed.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Security scans and tests may result in these errors. Misconfigured or buggy applications may produce large numbers of these errors. If the source is unexpected, the user unauthorized, or the request unusual, these may indicate suspicious or malicious activity."],"references":["https://en.wikipedia.org/wiki/HTTP_403"],"tags":["Elastic","APM"],"type":"query","index":["apm-*-transaction*","traces-apm*"],"language":"kuery","query":"http.response.status_code:403 and http.request.method:post\n","required_fields":[{"ecs":true,"name":"http.request.method","type":"keyword"},{"ecs":true,"name":"http.response.status_code","type":"long"}]},"id":"a87a4e42-1d82-44bd-b0bf-d9b7f91fb89e:100.0.1","type":"security-rule"}