{"attributes":{"name":"Timestomping using Touch Command v100.0.2","rule_id":"b0046934-486e-462f-9487-0d4cf9e429c6:100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Timestomping is an anti-forensics technique which is used to modify the timestamps of a file, often to mimic files that are in the same folder.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-9m","max_signals":33,"tags":["Elastic","Host","Linux","macOS","Threat Detection","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070/","subtechnique":[{"id":"T1070.006","name":"Timestomp","reference":"https://attack.mitre.org/techniques/T1070/006/"}]}]}],"language":"eql","query":"process where event.type == \"start\" and\n process.name : \"touch\" and user.id != \"0\" and\n process.args : (\"-r\", \"-t\", \"-a*\",\"-m*\") and\n not process.args : (\"/usr/lib/go-*/bin/go\", \"/usr/lib/dracut/dracut-functions.sh\", \"/tmp/KSInstallAction.*/m/.patch/*\")\n","type":"eql","index":["auditbeat-*","logs-endpoint.events.*"],"required_fields":[{"ecs":true,"name":"event.type","type":"keyword"},{"ecs":true,"name":"process.args","type":"keyword"},{"ecs":true,"name":"process.name","type":"keyword"},{"ecs":true,"name":"user.id","type":"keyword"}],"setup":"If enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work."},"id":"b0046934-486e-462f-9487-0d4cf9e429c6:100.0.2","type":"security-rule"}