{"attributes":{"name":"Multiple Alerts in Different ATT&CK Tactics on a Single Host v1.0.2","rule_id":"b946c2f7-df06-4c00-a5aa-1f6fbc7bb72c:1.0.2","rule_version":"1.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"This rule uses alert data to determine when multiple alerts in different phases of an attack involving the same host are triggered. Analysts can use this to prioritize triage and response, as these hosts are more likely to be compromised.","risk_score":73,"severity":"high","license":"Elastic License v2","timeline_id":"4434b91a-94ca-4a89-83cb-a37cdc0532b7","timeline_title":"Alerts Involving a Single Host Timeline","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["False positives can occur because the rules may be mapped to a few MITRE ATT&CK tactics. Use the attached Timeline to determine which detections were triggered on the host."],"from":"now-24h","interval":"1h","tags":["Elastic","Threat Detection","Higher-Order Rules"],"query":"signal.rule.name:* and kibana.alert.rule.threat.tactic.id:*\n","threshold":{"field":["host.id"],"value":1,"cardinality":[{"field":"kibana.alert.rule.threat.tactic.id","value":3}]},"type":"threshold","index":[".alerts-*"],"language":"kuery","required_fields":[{"ecs":false,"name":"kibana.alert.rule.threat.tactic.id","type":"unknown"},{"ecs":false,"name":"signal.rule.name","type":"unknown"}]},"id":"b946c2f7-df06-4c00-a5aa-1f6fbc7bb72c:1.0.2","type":"security-rule"}