{"attributes":{"name":"Cobalt Strike Command and Control Beacon v101.0.0","rule_id":"cf53f532-9cc9-445a-9ae7-fced307ec53c:101.0.0","rule_version":"101.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Cobalt Strike is a threat emulation platform commonly modified and used by adversaries to conduct network attack and exploitation campaigns. This rule detects a network activity algorithm leveraged by Cobalt Strike implant beacons for command and control.","risk_score":73,"severity":"high","license":"Elastic License v2","note":"## Threat intel\n\nThis activity has been observed in FIN7 campaigns.","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["This rule should be tailored to either exclude systems, as sources or destinations, in which this behavior is expected."],"from":"now-9m","references":["https://blog.morphisec.com/fin7-attacks-restaurant-industry","https://www.fireeye.com/blog/threat-research/2017/04/fin7-phishing-lnk.html","https://www.elastic.co/security-labs/collecting-cobalt-strike-beacons-with-the-elastic-stack"],"tags":["Elastic","Network","Threat Detection","Command and Control","Host"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0011","name":"Command and Control","reference":"https://attack.mitre.org/tactics/TA0011/"},"technique":[{"id":"T1071","name":"Application Layer Protocol","reference":"https://attack.mitre.org/techniques/T1071/"},{"id":"T1568","name":"Dynamic Resolution","reference":"https://attack.mitre.org/techniques/T1568/","subtechnique":[{"id":"T1568.002","name":"Domain Generation Algorithms","reference":"https://attack.mitre.org/techniques/T1568/002/"}]}]}],"type":"query","index":["auditbeat-*","filebeat-*","packetbeat-*","logs-endpoint.events.*"],"language":"lucene","query":"event.category:(network OR network_traffic) AND type:(tls OR http) AND network.transport:tcp AND destination.domain:/[a-z]{3}.stage.[0-9]{8}\\..*/\n"},"id":"cf53f532-9cc9-445a-9ae7-fced307ec53c:101.0.0","type":"security-rule"}