{"attributes":{"name":"Privilege Escalation via Windir Environment Variable v100.0.1","rule_id":"d563aaba-2e72-462b-8658-3e5ea22db3a6:100.0.1","rule_version":"100.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies a privilege escalation attempt via a rogue Windows directory (Windir) environment variable. This is a known primitive that is often combined with other vulnerabilities to elevate privileges.","risk_score":73,"severity":"high","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"from":"now-9m","references":["https://www.tiraniddo.dev/2017/05/exploiting-environment-variables-in.html"],"tags":["Elastic","Host","Windows","Threat Detection","Privilege Escalation"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574/","subtechnique":[{"id":"T1574.007","name":"Path Interception by PATH Environment Variable","reference":"https://attack.mitre.org/techniques/T1574/007/"}]}]}],"language":"eql","query":"registry where registry.path : (\"HKEY_USERS\\\\*\\\\Environment\\\\windir\", \"HKEY_USERS\\\\*\\\\Environment\\\\systemroot\") and\n not registry.data.strings : (\"C:\\\\windows\", \"%SystemRoot%\")\n","type":"eql","index":["logs-endpoint.events.*"],"required_fields":[{"ecs":true,"name":"registry.data.strings","type":"wildcard"},{"ecs":true,"name":"registry.path","type":"keyword"}]},"id":"d563aaba-2e72-462b-8658-3e5ea22db3a6:100.0.1","type":"security-rule"}