{"attributes":{"name":"Attempts to Brute Force an Okta User Account v102.0.1","rule_id":"e08ccd49-0380-4b2b-8d71-8000377d6e49:102.0.1","rule_version":"102.0.1","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies when an Okta user account is locked out 3 times within a 3 hour window. An adversary may attempt a brute force or password spraying attack to obtain unauthorized access to user accounts. The default Okta authentication policy ensures that a user account is locked out after 10 failed authentication attempts.","risk_score":47,"severity":"medium","license":"Elastic License v2","note":"","author":["Elastic","@BenB196","Austin Songer"],"from":"now-180m","references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/","https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy"],"tags":["Elastic","Identity","Okta","Continuous Monitoring","SecOps","Identity and Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/"}]}],"query":"event.dataset:okta.system and event.action:user.account.lock\n","threshold":{"field":["okta.actor.alternate_id"],"value":3},"type":"threshold","index":["filebeat-*","logs-okta*"],"language":"kuery","related_integrations":[{"package":"okta","version":"^1.3.0"}],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.dataset","type":"keyword"}],"setup":"The Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."},"id":"e08ccd49-0380-4b2b-8d71-8000377d6e49:102.0.1","type":"security-rule"}