{"attributes":{"name":"Ransomware - Prevented - Elastic Endgame v100.0.2","rule_id":"e3c5d5cb-41d5-4206-805c-f30561eae3ac:100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Elastic Endgame prevented ransomware. Click the Elastic Endgame icon in the event.module column or the link in the rule.reference column for additional information.","risk_score":73,"severity":"high","license":"Elastic License v2","author":["Elastic"],"from":"now-15m","interval":"10m","max_signals":10000,"tags":["Elastic","Elastic Endgame"],"type":"query","index":["endgame-*"],"language":"kuery","query":"event.kind:alert and event.module:endgame and endgame.metadata.type:prevention and (event.action:ransomware_event or endgame.event_subtype_full:ransomware_event)\n","required_fields":[{"ecs":false,"name":"endgame.event_subtype_full","type":"unknown"},{"ecs":false,"name":"endgame.metadata.type","type":"unknown"},{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.kind","type":"keyword"},{"ecs":true,"name":"event.module","type":"keyword"}]},"id":"e3c5d5cb-41d5-4206-805c-f30561eae3ac:100.0.2","type":"security-rule"}