{"attributes":{"name":"Service Creation via Local Kerberos Authentication v100.0.0","rule_id":"e4e31051-ee01-4307-a6ee-b21b186958f4:100.0.0","rule_version":"100.0.0","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies a suspicious local successful logon event where the Logon Package is Kerberos, the remote address is set to localhost, followed by a sevice creation from the same LogonId. This may indicate an attempt to leverage a Kerberos relay attack variant that can be used to elevate privilege locally from a domain joined user to local System privileges.","risk_score":73,"severity":"high","license":"Elastic License v2","author":["Elastic"],"from":"now-9m","references":["https://github.com/Dec0ne/KrbRelayUp","https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html","https://github.com/cube0x0/KrbRelay","https://gist.github.com/tyranid/c24cfd1bd141d14d4925043ee7e03c82"],"tags":["Elastic","Host","Windows","Threat Detection","Privilege Escalation","Credential Access"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543/","subtechnique":[{"id":"T1543.003","name":"Windows Service","reference":"https://attack.mitre.org/techniques/T1543/003/"}]}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1558","name":"Steal or Forge Kerberos Tickets","reference":"https://attack.mitre.org/techniques/T1558/"}]}],"language":"eql","query":"sequence by host.id with maxspan=5m\n [authentication where\n\n  /* event 4624 need to be logged */\n  event.action == \"logged-in\" and event.outcome == \"success\" and\n\n  /* authenticate locally using relayed kerberos Ticket */\n  winlog.event_data.AuthenticationPackageName :\"Kerberos\" and winlog.logon.type == \"Network\" and\n  cidrmatch(source.ip, \"127.0.0.0/8\", \"::1\") and source.port > 0] by winlog.event_data.TargetLogonId\n\n  [any where\n   /* event 4697 need to be logged */\n   event.action : \"service-installed\"] by winlog.event_data.SubjectLogonId\n","type":"eql","index":["winlogbeat-*","logs-system.*"],"required_fields":[{"ecs":true,"name":"event.action","type":"keyword"},{"ecs":true,"name":"event.outcome","type":"keyword"},{"ecs":true,"name":"host.id","type":"keyword"},{"ecs":true,"name":"source.ip","type":"ip"},{"ecs":true,"name":"source.port","type":"long"},{"ecs":false,"name":"winlog.event_data.AuthenticationPackageName","type":"keyword"},{"ecs":false,"name":"winlog.event_data.SubjectLogonId","type":"keyword"},{"ecs":false,"name":"winlog.event_data.TargetLogonId","type":"keyword"},{"ecs":false,"name":"winlog.logon.type","type":"unknown"}]},"id":"e4e31051-ee01-4307-a6ee-b21b186958f4:100.0.0","type":"security-rule"}