{"attributes":{"name":"SoftwareUpdate Preferences Modification v100.0.2","rule_id":"f683dcdf-a018-4801-b066-193d4ae6c8e5:100.0.2","rule_version":"100.0.2","stack_version_min":"8.5.0","stack_version_max":"8.7.0","description":"Identifies changes to the SoftwareUpdate preferences using the built-in defaults command. Adversaries may abuse this in an attempt to disable security updates.","risk_score":47,"severity":"medium","license":"Elastic License v2","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Authorized SoftwareUpdate Settings Changes"],"from":"now-9m","references":["https://blog.checkpoint.com/2017/07/13/osxdok-refuses-go-away-money/"],"tags":["Elastic","Host","macOS","Threat Detection","Defense Evasion"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.001","name":"Disable or Modify Tools","reference":"https://attack.mitre.org/techniques/T1562/001/"}]}]}],"type":"query","index":["auditbeat-*","logs-endpoint.events.*"],"language":"kuery","query":"event.category:process and event.type:(start or process_started) and\n process.name:defaults and\n process.args:(write and \"-bool\" and (com.apple.SoftwareUpdate or /Library/Preferences/com.apple.SoftwareUpdate.plist) and not (TRUE or true))\n","required_fields":[{"ecs":true,"name":"event.category","type":"keyword"},{"ecs":true,"name":"event.type","type":"keyword"},{"ecs":true,"name":"process.args","type":"keyword"},{"ecs":true,"name":"process.name","type":"keyword"}]},"id":"f683dcdf-a018-4801-b066-193d4ae6c8e5:100.0.2","type":"security-rule"}