{
  "name": "Some new name",
  "description": "Changing the name and disabling this query",
  "rule_id": "query-rule-id",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "user.name: root or user.name: admin",
  "enabled": false
}
