{
  "description": "405 Response (Method Not Allowed)",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "405 Response (Method Not Allowed)",
  "query": "http.response.status_code:405",
  "risk_score": 50,
  "rule_id": "75ee75d8-c180-481c-ba88-ee50129a6aef",
  "severity": "low",
  "type": "query",
  "version": 1
}
