{
  "description": "A request to web application returned a 405 response which indicates the web application declined to process the request because the HTTP method was not allowed for the resource.",
  "false_positives": [
    "Security scans and tests may result in these errors. Misconfigured or buggy applications may produce large numbers of these errors. If the source is unexpected, or the user is unauthorized, or the request is unusual, these may be suspicious or malicious activity."
  ],
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "max_signals": 33,
  "name": "Web Application Suspicious Activity: Unauthorized Method",
  "query": "http.response.status_code:405",
  "references": ["https://en.wikipedia.org/wiki/HTTP_405"],
  "risk_score": 50,
  "rule_id": "75ee75d8-c180-481c-ba88-ee50129a6aef",
  "severity": "low",
  "tags": ["Elastic", "apm"],
  "type": "query",
  "version": 1
}
