{
  "description": "500 Response on Admin page",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "500 Response on Admin page",
  "query": "url.path:\"/admin/\" and http.response.status_code:500",
  "risk_score": 50,
  "rule_id": "054f669c-b065-492e-acd9-15e44fc42380",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
