{
  "rule_id": "23f75a46-2e46-4db5-92f7-e71e6b62a25f",
  "risk_score": 50,
  "description": "All logs [Filebeat MongoDB] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "All logs [Filebeat MongoDB] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "log.level: *",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
