{
  "rule_id": "15dbb758-e607-4c56-b5c2-01338007117c",
  "risk_score": 50,
  "description": "All logs [Filebeat MongoDB] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "All logs [Filebeat MongoDB] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "log.level: *",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
