{
  "rule_id": "d181937f-1135-4209-a9c6-f3c5b95ca3b2",
  "risk_score": 50,
  "description": "All ASA Logs [Filebeat Cisco]",
  "immutable": true,
  "interval": "5m",
  "name": "All ASA Logs [Filebeat Cisco]",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "cisco.asa.message_id :*",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
