{
  "rule_id": "76ae7bd6-1131-486b-aa40-cde4dc3eccce",
  "risk_score": 50,
  "description": "Apache errors log [Filebeat Apache] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Apache errors log [Filebeat Apache] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.dataset:apache.error",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
