{
  "rule_id": "933704b3-29bf-46df-926c-a08fc06a7e80",
  "risk_score": 50,
  "description": "Apache access logs [Filebeat Apache] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Apache access logs [Filebeat Apache] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.dataset:apache.access",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
