{
  "rule_id": "e5674d54-f23a-4587-afb2-b5d841a8f8c8",
  "risk_score": 50,
  "description": "ASA Firewall flows [Filebeat Cisco]",
  "immutable": true,
  "interval": "5m",
  "name": "ASA Firewall flows [Filebeat Cisco]",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "cisco.asa.message_id:* and event.action:\"flow-expiration\"",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
