{
  "rule_id": "51816ad4-44e4-474b-99ab-4a3844758ad3",
  "risk_score": 50,
  "description": "ASA Firewall Events [Filebeat Cisco]",
  "immutable": true,
  "interval": "5m",
  "name": "ASA Firewall Events [Filebeat Cisco]",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "cisco.asa.message_id:* and event.action:\"firewall-rule\"",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
