{
  "rule_id": "064d2642-705c-4f38-84c5-bfec8dcf0aea",
  "risk_score": 50,
  "description": "ASA Firewall Events [Filebeat Cisco]",
  "immutable": true,
  "interval": "5m",
  "name": "ASA Firewall Events [Filebeat Cisco]",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "cisco.asa.message_id:* and event.action:\"firewall-rule\"",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
