{
  "rule_id": "bb34fb13-a8e2-4ac1-adf3-4c55d2bd88f8",
  "risk_score": 50,
  "description": "ASA Firewall flows [Filebeat Cisco]",
  "immutable": true,
  "interval": "5m",
  "name": "ASA Firewall flows [Filebeat Cisco]",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "cisco.asa.message_id:* and event.action:\"flow-expiration\"",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
