{
  "rule_id": "bf86a2f5-24be-4beb-a9a9-582d6e5b47b5",
  "risk_score": 50,
  "description": "Audit Events [Filebeat Auditd] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Audit Events [Filebeat Auditd] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.dataset:auditd.log",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
