{
  "rule_id": "f9486a5d-86ed-46d3-9121-232ba8cd436e",
  "risk_score": 50,
  "description": "Audit Events [Filebeat Auditd] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Audit Events [Filebeat Auditd] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.dataset:auditd.log",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
