{
  "rule_id": "b52f7c26-780b-49df-b5d5-266614d1c0d7",
  "risk_score": 50,
  "description": "Command shell started by Internet Explorer",
  "immutable": true,
  "interval": "5m",
  "name": "Command shell started by Internet Explorer",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.parent.name:iexplore.exe",
  "language": "kuery",
  "filters": [
    {
      "query": {
        "match": {
          "process.name": {
            "query": "cmd.exe",
            "type": "phrase"
          }
        }
      }
    },
    {
      "query": {
        "match": {
          "event.action": {
            "query": "Process Create (rule: ProcessCreate)",
            "type": "phrase"
          }
        }
      }
    }
  ],
  "enabled": false,
  "version": 1
}
