{
  "description": "Command shell started by Svchost",
  "enabled": false,
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "key": "process.name",
        "negate": false,
        "params": {
          "query": "cmd.exe"
        },
        "type": "phrase",
        "value": "cmd.exe"
      },
      "query": {
        "match": {
          "process.name": {
            "query": "cmd.exe",
            "type": "phrase"
          }
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
        "key": "event.action",
        "negate": false,
        "params": {
          "query": "Process Create (rule: ProcessCreate)"
        },
        "type": "phrase",
        "value": "Process Create (rule: ProcessCreate)"
      },
      "query": {
        "match": {
          "event.action": {
            "query": "Process Create (rule: ProcessCreate)",
            "type": "phrase"
          }
        }
      }
    }
  ],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Command shell started by Svchost",
  "query": "process.parent.name:svchost.exe",
  "risk_score": 50,
  "rule_id": "2e4f8a5e-ce68-44e0-9243-1f57d44c4f30",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
