{
  "description": "Windows - Detect Use of cmd.exe to Launch Script Interpreters",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows - Detect Use of cmd.exe to Launch Script Interpreters",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\" and process.name:(\"wscript.exe\" or \"cscript.exe\") and process.parent.name:\"cmd.exe\"",
  "risk_score": 50,
  "rule_id": "b17c215e-8fa5-4087-b8d1-87761a90d710",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
