{
  "description": "Windows - New External Device Attached",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows - New External Device Attached",
  "query": "event.code:6416",
  "risk_score": 50,
  "rule_id": "c0747553-5763-5d85-cd97-898f2daa2bde",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
