{
  "description": "Network - Protocols passing authentication in cleartext",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Network - Protocols passing authentication in cleartext",
  "query": "destination.port:(21 or 23 or 110 or 143) and network.transport:tcp",
  "risk_score": 50,
  "rule_id": "31f32b3c-415a-4a18-b60f-5748a337246b",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
