{
  "description": "Windows - Detect PsExec With accepteula Flag",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows - Detect PsExec With accepteula Flag",
  "query": "process.name:PsExec.exe and process.args:\"-accepteula\"",
  "risk_score": 50,
  "rule_id": "304b0e0c-bd06-46f8-aeda-2e719ae434d1",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
