{
  "description": "Windows - Windows Event Log Cleared",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows - Windows Event Log Cleared",
  "query": "event.code:(1102 or 1100)",
  "risk_score": 50,
  "rule_id": "b94b5177-ca7f-468a-9a1d-aef39c30a3ae",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
