{
  "description": "Windows - Processes created by netsh",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows - Processes created by netsh",
  "query": "process.parent.name:netsh.exe",
  "risk_score": 50,
  "rule_id": "e312dd9e-4760-4a71-a241-9b9a835a51c4",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
