{
  "description": "Windows - Child Processes of Spoolsv.exe",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows - Child Processes of Spoolsv.exe",
  "query": "process.parent.name:spoolsv.exe and not process.name:regsvr32.exe ",
  "risk_score": 50,
  "rule_id": "dcc45d35-f42e-4f97-81e8-90b0597ea0d1",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
