{
  "description": "Network - Detect Long DNS TXT Record Response",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Network - Detect Long DNS TXT Record Response",
  "query": "network.protocol:dns and server.bytes>100 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16 and not destination.ip:169.254.169.254 and not destination.ip:127.0.0.53",
  "risk_score": 50,
  "rule_id": "cc28f445-318e-4850-8b0d-5ad53eaded74",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
