{
  "description": "Windows - Detect New Local Admin account",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows - Detect New Local Admin account",
  "query": "event.code:(4720 or 4732) and winlog.event_data.TargetUserName:Administrators",
  "risk_score": 50,
  "rule_id": "461db51b-b1a1-49de-ac63-e1bcbd445602",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
