{
  "description": "Network - Detect Large Outbound ICMP Packets",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Network - Detect Large Outbound ICMP Packets",
  "query": "network.transport:icmp and network.bytes>1000 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "risk_score": 50,
  "rule_id": "4fce2a7e-0e11-4f17-bae3-8873c5ae62be",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
