{
  "description": "Elastic Endpoint prevented Process Injection. Click the Elastic Endpoint icon in the event.module column or the link in the rule.reference column in the External Alerts tab of the SIEM Detections page for additional information.",
  "from": "now-660s",
  "index": [
    "endgame-*"
  ],
  "interval": "10m",
  "language": "kuery",
  "max_signals": 100,
  "name": "Process Injection - Prevented - Elastic Endpoint",
  "query": "event.kind:alert and event.module:endgame and event.action:kernel_shellcode_event and endgame.metadata.type:prevention",
  "risk_score": 47,
  "rule_id": "990838aa-a953-4f3e-b3cb-6ddf7584de9e",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Endpoint"
  ],
  "type": "query",
  "version": 1
}
