{
  "description": "Elastic Endpoint detected Credential Manipulation. Click the Elastic Endpoint icon in the event.module column or the link in the rule.reference column in the External Alerts tab of the SIEM Detections page for additional information.",
  "from": "now-660s",
  "index": [
    "endgame-*"
  ],
  "interval": "10m",
  "language": "kuery",
  "max_signals": 100,
  "name": "Credential Manipulation - Detected - Elastic Endpoint",
  "query": "event.kind:alert and event.module:endgame and event.action:token_manipulation_event and endgame.metadata.type:detection",
  "risk_score": 73,
  "rule_id": "c0be5f31-e180-48ed-aa08-96b36899d48f",
  "severity": "high",
  "tags": [
    "Elastic",
    "Endpoint"
  ],
  "type": "query",
  "version": 1
}
