{
  "description": "Elastic Endpoint Security Alert - Credential dumping detected.",
  "index": [
    "endgame-*"
  ],
  "language": "kuery",
  "max_signals": 33,
  "name": "Cred Dumping - Detected - Elastic Endpoint",
  "query": "event.kind:alert and event.module:endgame and event.action:cred_theft_event and endgame.metadata.type:detection",
  "risk_score": 73,
  "rule_id": "571afc56-5ed9-465d-a2a9-045f099f6e7e",
  "severity": "high",
  "tags": [
    "Elastic",
    "Endpoint"
  ],
  "type": "query",
  "version": 1
}
