{
  "description": "Detects writing DLL files to known locations associated with Windows files vulnerable to DLL search order hijacking.",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "DLL Search Order Hijack",
  "query": " event.action:\"File created (rule: FileCreate)\"  and    not winlog.user.identifier:(\"S-1-5-18\" or \"S-1-5-19\" or \"S-1-5-20\") and    file.path:(\"C\\Windows\\ehome\\cryptbase.dll\" or               \"C\\Windows\\System32\\Sysprep\\cryptbase.dll\" or               \"C\\Windows\\System32\\Sysprep\\cryptsp.dll\" or               \"C\\Windows\\System32\\Sysprep\\rpcrtremote.dll\" or               \"C\\Windows\\System32\\Sysprep\\uxtheme.dll\" or               \"C\\Windows\\System32\\Sysprep\\dwmapi.dll\" or               \"C\\Windows\\System32\\Sysprep\\shcore.dll\" or               \"C\\Windows\\System32\\Sysprep\\oleacc.dll\" or               \"C\\Windows\\System32\\ntwdblib.dll\") ",
  "risk_score": 50,
  "rule_id": "73fbc44c-c3cd-48a8-a473-f4eb2065c716",
  "severity": "medium",
  "tags": ["EIA"],
  "threats": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1088",
          "name": "Bypass User Account Control",
          "reference": "https://attack.mitre.org/techniques/T1088/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1088",
          "name": "Bypass User Account Control",
          "reference": "https://attack.mitre.org/techniques/T1088/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
