{
  "rule_id": "2f7403da-1a4c-46bb-8ecc-c1a596e10cd0",
  "risk_score": 50,
  "description": "EQL - Bypass UAC via CMSTP",
  "immutable": true,
  "interval": "5m",
  "name": "EQL - Bypass UAC via CMSTP",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\" and process.parent.name:\"cmstp.exe\" and process.parent.args:(\"/s\" and \"/au\")",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
