{
  "description": "EQL - Audio Capture via SoundRecorder",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "EQL - Audio Capture via SoundRecorder",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\" and process.name:\"SoundRecorder.exe\" and process.args:\"/FILE\"",
  "risk_score": 50,
  "rule_id": "f8e06892-ed10-4452-892e-2c5a38d552f1",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
