{
  "description": "EQL - Disable Windows Firewall Rules with Netsh",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "EQL - Disable Windows Firewall Rules with Netsh",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\" and process.name:\"netsh.exe\" and process.args:(\"firewall\" and \"set\" and \"disable\") or process.args:(\"advfirewall\" and \"state\" and \"off\")",
  "risk_score": 50,
  "rule_id": "4b438734-3793-4fda-bd42-ceeada0be8f9",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
