{
  "description": "EQL -Bypass UAC Via sdclt",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "EQL -Bypass UAC Via sdclt",
  "query": " event.action:\"Process Create (rule: ProcessCreate)\" and process.name:\"sdclt.exe\" and process.args:\"/kickoffelev\" and not process.executable:(\"C:\\Windows\\System32\\sdclt.exe\" or \"C:\\Windows\\System32\\control.exe\" or \"C:\\Windows\\SysWOW64\\sdclt.exe\" or \"C:\\Windows\\SysWOW64\\control.exe\")",
  "risk_score": 50,
  "rule_id": "f68d83a1-24cb-4b8d-825b-e8af400b9670",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
