{
  "description": "EQL - Audio Capture via PowerShell",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "EQL - Audio Capture via PowerShell",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\" and process.name:\"powershell.exe\" and process.args:\"WindowsAudioDevice-Powershell-Cmdlet\"",
  "risk_score": 50,
  "rule_id": "b27b9f47-0a20-4807-8377-7f899b4fbada",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
