{
  "description": "EQL - Windows Script Executing PowerShell",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "EQL - Windows Script Executing PowerShell",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\" and process.parent.name:(\"wscript.exe\" or \"cscript.exe\") and process.name:\"powershell.exe\"",
  "risk_score": 50,
  "rule_id": "f545ff26-3c94-4fd0-bd33-3c7f95a3a0fc",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
