{
  "rule_id": "0022d47d-39c7-4f69-a232-4fe9dc7a3acd",
  "risk_score": 50,
  "description": "EQL - System Shells via Services",
  "immutable": true,
  "interval": "5m",
  "name": "EQL - System Shells via Services",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": " event.action:\"Process Create (rule: ProcessCreate)\" and    process.parent.name:\"services.exe\" and    process.name:(\"cmd.exe\" or \"powershell.exe\")",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
