{
  "description": "Identifies use of wmic.exe to run commands on remote hosts. This could be indicative of adversary lateral movement but will be noisy if commonly done by admins.",
  "false_positives": [
    "The WMIC utility provides a command-line interface for WMI, which can be used for an array of administrative capabilities. It's important to baseline your environment to determine any abnormal use of this tool."
  ],
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "max_signals": 33,
  "name": "WMIC Command Lateral Movement",
  "query": "   event.action:\"Process Create (rule: ProcessCreate)\" and  process.name:\"wmic.exe\" and process.args:(\"/node\" or \"-node\") and process.args:(\"call\" or \"set\")",
  "risk_score": 21,
  "rule_id": "9616587f-6396-42d0-bd31-ef8dbd806210",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0008",
        "name": "Lateral Movement",
        "reference": "https://attack.mitre.org/tactics/TA0008/"
      },
      "technique": [
        {
          "id": "T1047",
          "name": "Windows Management Instrumentation",
          "reference": "https://attack.mitre.org/techniques/T1047/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
