{
  "description": "Identifies User Account Control (UAC) bypass via cmstp.  Attackers bypass UAC to stealthily execute code with elevated permissions.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Bypass UAC via SDCLT",
  "query": " event.action:\"Process Create (rule: ProcessCreate)\" and process.name:\"sdclt.exe\" and process.args:\"/kickoffelev\" and not process.executable:(\"C:\\Windows\\System32\\sdclt.exe\" or \"C:\\Windows\\System32\\control.exe\" or \"C:\\Windows\\SysWOW64\\sdclt.exe\" or \"C:\\Windows\\SysWOW64\\control.exe\")",
  "risk_score": 25,
  "rule_id": "f68d83a1-24cb-4b8d-825b-e8af400b9670",
  "severity": "low",
  "tags": [
    "EIA"
  ],
  "threats": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1088",
          "name": "Bypass User Account Control",
          "reference": "https://attack.mitre.org/techniques/T1088/"
        }
      ]
    }
  ],
  "to": "now",
  "type": "query",
  "version": 1
}
