{
  "description": "Identifies use of the SysInternals tool PsExec to execute commands on a remote host. This is an indication of lateral movement and may detect adversaries.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "PsExec Lateral Movement Command",
  "query": "process.name:psexec.exe and event.action:\"Network connection detected (rule: NetworkConnect)\" ",
  "risk_score": 50,
  "rule_id": "55d551c6-333b-4665-ab7e-5d14a59715ce",
  "severity": "low",
  "tags": [
    "EIA"
  ],
  "to": "now",
  "type": "query",
  "version": 1
}
