{
  "description": "An adversary can leverage a computer's peripheral devices or applications to capture audio recordings for the purpose of listening into sensitive conversations to gather information.",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Audio Capture via PowerShell",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\" and process.name:\"powershell.exe\" and process.args:\"WindowsAudioDevice-Powershell-Cmdlet\"",
  "risk_score": 25,
  "rule_id": "b27b9f47-0a20-4807-8377-7f899b4fbada",
  "severity": "low",
  "tags": ["EIA"],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Collection",
        "reference": "https://attack.mitre.org/tactics/TA0009/"
      },
      "technique": [
        {
          "id": "T1123",
          "name": "Audio Capture",
          "reference": "https://attack.mitre.org/techniques/T1123/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
