{
  "description": "Identifies use of the fsutil command to delete the volume USNJRNL. This technique is used by attackers to eliminate evidence of files created during post-exploitation activities.",
  "language": "kuery",
  "name": "Delete Volume USN Journal with fsutil",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\"  and   process.name:\"fsutil.exe\" and    process.args:(\"usn\" and \"deletejournal\")",
  "risk_score": 25,
  "rule_id": "f675872f-6d85-40a3-b502-c0d2ef101e92",
  "severity": "low",
  "tags": ["EIA"],
  "threats": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1107",
          "name": "File Deletion",
          "reference": "https://attack.mitre.org/techniques/T1107/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
