{
  "rule_id": "a3659964-da0d-41af-a23a-fc5243ffbe38",
  "risk_score": 50,
  "description": "Error logs [Filebeat MongoDB] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Error logs [Filebeat MongoDB] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "log.level: F or log.level: W",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
