{
  "rule_id": "7b366135-1454-4fa7-9887-3de39a88f583",
  "risk_score": 50,
  "description": "Error Logs [Filebeat AWS]",
  "immutable": true,
  "interval": "5m",
  "name": "Error Logs [Filebeat AWS]",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "",
  "language": "kuery",
  "filters": [
    {
      "query": {
        "match": {
          "aws.s3access.http_status": {
            "query": "200",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "value": "200",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "200"
        },
        "key": "aws.s3access.http_status",
        "negate": true,
        "type": "phrase"
      },
      "$state": {
        "store": "appState"
      }
    },
    {
      "query": {
        "match": {
          "fileset.name": {
            "query": "s3access",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
        "value": "s3access",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "s3access"
        },
        "key": "fileset.name",
        "negate": false,
        "type": "phrase"
      },
      "$state": {
        "store": "appState"
      }
    }
  ],
  "enabled": false
}