{
  "rule_id": "c53e9e00-a135-47d5-a102-8dbbbbdfb152",
  "risk_score": 50,
  "description": "Error logs [Filebeat MongoDB] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Error logs [Filebeat MongoDB] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "log.level: F or log.level: W",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
