{
  "rule_id": "4c4011b2-3f99-44fb-9e8c-e027af43baa7",
  "risk_score": 50,
  "description": "Events Search [Filebeat Iptables] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Events Search [Filebeat Iptables] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "iptables.length :*",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
