{
  "rule_id": "c0cfe4e1-9094-43f7-972a-92f0d2b24c3c",
  "risk_score": 50,
  "description": "Events Search [Filebeat Iptables] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Events Search [Filebeat Iptables] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "iptables.length :*",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
