{
  "rule_id": "029370cb-94a4-45bb-87de-42cce5313a60",
  "risk_score": 50,
  "description": "groupadd logs [Filebeat System] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "groupadd logs [Filebeat System] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "system.auth.groupadd:*",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
