{
  "rule_id": "edd287d7-1626-4aaf-8c1d-a15603033e0a",
  "risk_score": 50,
  "description": "Host Stats [Filebeat Suricata] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Host Stats [Filebeat Suricata] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "",
  "language": "kuery",
  "filters": [
    {
      "query": {
        "match": {
          "suricata.eve.event_type": {
            "query": "stats",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "value": "stats",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "stats",
          "type": "phrase"
        },
        "key": "suricata.eve.event_type",
        "negate": false,
        "type": "phrase",
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index"
      },
      "$state": {
        "store": "appState"
      }
    },
    {
      "query": {
        "match": {
          "event.module": {
            "query": "suricata",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "value": "suricata",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "suricata",
          "type": "phrase"
        },
        "key": "event.module",
        "negate": false,
        "type": "phrase",
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index"
      },
      "$state": {
        "store": "appState"
      }
    }
  ],
  "enabled": false
}