{
  "rule_id": "fd7d8e3a-24a3-4f10-812b-b3b469670324",
  "risk_score": 50,
  "description": "Linux: Shell Activity By Web Server",
  "immutable": true,
  "interval": "5m",
  "name": "Linux: Shell Activity By Web Server",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name: bash and (user.name: apache or www)",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
