{
  "rule_id": "738f771f-2d9b-4409-adc2-82159e24cf6d",
  "risk_score": 50,
  "description": "Linux ld.so process activity",
  "immutable": true,
  "interval": "5m",
  "name": "Linux ld.so process activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:ld.so",
  "language": "kuery",
  "filters": [],
  "enabled": false
}