{
  "description": "Linux: Web Download",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Linux: Web Download",
  "query": "process.name: (curl or wget) and event.action:executed",
  "risk_score": 50,
  "rule_id": "e8ec93a6-49d2-4467-8c12-81c435fcc519",
  "severity": "low",
  "type": "query",
  "version": 1
}
