{
  "description": "The Tcpdump program ran on a Linux host. Tcpdump is a network monitoring or packet sniffing tool that can be used to capture insecure credentials or data in motion. Sniffing can also be used to discover details of network services as a prelude to lateral movement or defense evasion.",
  "false_positives": [
    "Some normal use of this command may originate from server or network administrators engaged in network troubleshooting."
  ],
  "index": [
    "auditbeat-*"
  ],
  "language": "kuery",
  "max_signals": 100,
  "name": "Network Sniffing via Tcpdump",
  "query": "process.name: tcpdump and event.action:executed",
  "risk_score": 21,
  "rule_id": "7a137d76-ce3d-48e2-947d-2747796a78c0",
  "severity": "low",
  "tags": [
    "Elastic",
    "Linux"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1040",
          "name": "Network Sniffing",
          "reference": "https://attack.mitre.org/techniques/T1040/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0007",
        "name": "Discovery",
        "reference": "https://attack.mitre.org/tactics/TA0007/"
      },
      "technique": [
        {
          "id": "T1040",
          "name": "Network Sniffing",
          "reference": "https://attack.mitre.org/techniques/T1040/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
