{
  "description": "Linux: Ptrace Activity",
  "enabled": false,
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Linux: Ptrace Activity",
  "query": "process.name: ptrace and event.action:executed",
  "risk_score": 50,
  "rule_id": "1bff9259-e160-4920-bf72-4c96b6dbb7af",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
