{
  "description": "Linux lzop activity - possible @JulianRunnels",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Linux lzop activity",
  "query": "process.name:lzop and event.action:executed",
  "risk_score": 50,
  "rule_id": "d7359214-54a4-4572-9e51-ebf79cda9b04",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
