{
  "rule_id": "da20a7a9-ba71-40f4-a43e-8a5f821e900a",
  "risk_score": 50,
  "description": "Linux ld.so process activity",
  "immutable": true,
  "interval": "5m",
  "name": "Linux ld.so process activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:ld.so",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
