{
  "description": "Linux: Strace Activity",
    "language": "kuery",
  "name": "Linux: Strace Activity",
  "query": "process.name: strace and event.action:executed",
  "risk_score": 50,
  "rule_id": "d6450d4e-81c6-46a3-bd94-079886318ed5",
  "severity": "low",
  "type": "query",
  "version": 1
}
