{
  "description": "Linux ld.so process activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Linux ld.so process activity",
  "query": "process.name:ld.so and event.action:executed",
  "risk_score": 50,
  "rule_id": "3f31a31c-f7cf-4268-a0df-ec1a98099e7f",
  "severity": "low",
  "type": "query",
  "version": 1
}
