{
  "rule_id": "3b98cacf-9ab0-4989-8fe9-d61a1f623d43",
  "risk_score": 50,
  "description": "Linux unusual shell activity",
  "immutable": true,
  "interval": "5m",
  "name": "Linux unusual shell activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:*sh",
  "language": "kuery",
  "filters": [
    {
      "meta": {
        "negate": true,
        "type": "phrase",
        "key": "process.name",
        "value": "bash",
        "params": {
          "query": "bash"
        },
        "disabled": false,
        "alias": null,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index"
      },
      "query": {
        "match": {
          "process.name": {
            "query": "bash",
            "type": "phrase"
          }
        }
      },
      "$state": {
        "store": "appState"
      }
    },
    {
      "meta": {
        "negate": true,
        "type": "phrase",
        "key": "process.executable",
        "value": "/bin/dash",
        "params": {
          "query": "/bin/dash"
        },
        "disabled": false,
        "alias": null,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index"
      },
      "query": {
        "match": {
          "process.executable": {
            "query": "/bin/dash",
            "type": "phrase"
          }
        }
      },
      "$state": {
        "store": "appState"
      }
    },
    {
      "meta": {
        "negate": true,
        "type": "phrase",
        "key": "process.name",
        "value": "ReportCrash",
        "params": {
          "query": "ReportCrash"
        },
        "disabled": false,
        "alias": null,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[2].meta.index"
      },
      "query": {
        "match": {
          "process.name": {
            "query": "ReportCrash",
            "type": "phrase"
          }
        }
      },
      "$state": {
        "store": "appState"
      }
    }
  ],
  "enabled": false
}