{
  "description": "Linux lzop activity - possible @JulianRunnels",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Linux lzop activity",
  "query": "process.name:lzop and event.action:executed",
  "risk_score": 50,
  "rule_id": "d7359214-54a4-4572-9e51-ebf79cda9b04",
  "severity": "low",
  "type": "query",
  "version": 1
}
