{
  "rule_id": "746bd6fc-d5b8-41ed-86cf-b0f82ab40923",
  "risk_score": 50,
  "description": "Linux lzop activity - possible @JulianRunnels",
  "immutable": true,
  "interval": "5m",
  "name": "Linux lzop activity - possible @JulianRunnels",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:lzop",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
