{
  "rule_id": "2e3900de-9b4a-4dbe-b755-e0063615045c",
  "risk_score": 50,
  "description": "Linux: Whoami Commmand",
  "immutable": true,
  "interval": "5m",
  "name": "Linux: Whoami Commmand",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name: whoami",
  "language": "kuery",
  "filters": [
    {
      "meta": {
        "negate": false,
        "type": "phrase",
        "key": "event.action",
        "value": "process_started",
        "params": {
          "query": "process_started"
        },
        "disabled": false,
        "alias": null,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index"
      },
      "query": {
        "match": {
          "event.action": {
            "query": "process_started",
            "type": "phrase"
          }
        }
      },
      "$state": {
        "store": "appState"
      }
    },
    {
      "meta": {
        "negate": false,
        "type": "phrase",
        "key": "event.dataset",
        "value": "process",
        "params": {
          "query": "process"
        },
        "disabled": false,
        "alias": null,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index"
      },
      "query": {
        "match": {
          "event.dataset": {
            "query": "process",
            "type": "phrase"
          }
        }
      },
      "$state": {
        "store": "appState"
      }
    }
  ],
  "enabled": false,
  "version": 1
}
