{
  "description": "Linux: Java Process Connecting to the Internet",
  "enabled": false,
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "key": "process.name",
        "negate": false,
        "params": {
          "query": "java"
        },
        "type": "phrase",
        "value": "java"
      },
      "query": {
        "match": {
          "process.name": {
            "query": "java",
            "type": "phrase"
          }
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
        "key": "event.action",
        "negate": false,
        "params": {
          "query": "socket_opened"
        },
        "type": "phrase",
        "value": "socket_opened"
      },
      "query": {
        "match": {
          "event.action": {
            "query": "socket_opened",
            "type": "phrase"
          }
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[2].meta.index",
        "key": "destination.ip",
        "negate": true,
        "params": {
          "query": "127.0.0.1"
        },
        "type": "phrase",
        "value": "127.0.0.1"
      },
      "query": {
        "match": {
          "destination.ip": {
            "query": "127.0.0.1",
            "type": "phrase"
          }
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[3].meta.index",
        "key": "destination.ip",
        "negate": true,
        "params": {
          "query": "::1"
        },
        "type": "phrase",
        "value": "::1"
      },
      "query": {
        "match": {
          "destination.ip": {
            "query": "::1",
            "type": "phrase"
          }
        }
      }
    }
  ],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Linux: Java Process Connecting to the Internet",
  "query": "not destination.ip: 10.0.0.0/8 and not 172.16.0.0/12",
  "risk_score": 50,
  "rule_id": "7f65b8c5-27ed-4cf6-a088-3a20d2f84bf5",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
