{
  "rule_id": "33edf607-5997-49cf-999a-71887e88d9d2",
  "risk_score": 50,
  "description": "Linux lzop activity - possible @JulianRunnels",
  "immutable": true,
  "interval": "5m",
  "name": "Linux lzop activity - possible @JulianRunnels",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:lzop",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
