{
  "description": "Detect ssh processes with the `-R` flag which can be used to forward a port on a local system to the local system so that someone on the remote system can connect to the local system. This is often used by attackers to create encrypted tunnels through firewalls for pivoting and persistence.",
    "language": "kuery",
  "name": "Linux: SSH Port Forwarding",
  "query": "process.name:ssh and process.args:\"-R\" and event.action:executed",
  "references": [
    "  - https://www.ssh.com/ssh/tunneling,https://www.ssh.com/ssh/tunneling/example,https://attack.mitre.org/techniques/T1184/"
  ],
  "risk_score": 50,
  "rule_id": "45d256ab-e665-445b-8306-2f83a8db59f8",
  "severity": "low",
  "type": "query",
  "version": 1
}
