{
  "description": "ld.so runs in a privlieged context and can be used to escape restrictive environments by spawning a shell in order to elevate privlieges or move laterally.",
  "false_positives": [
    "ld.so is a dual-use tool that can be used for benign or malicious activity. Some normal use of this command may originate from developers or administrators. Use of ld.so by non-engineers or ordinary users is uncommon."
  ],
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "max_signals": 33,
  "name": "Ld.so Process Activity",
  "query": "process.name:ld.so and event.action:executed",
  "risk_score": 25,
  "rule_id": "3f31a31c-f7cf-4268-a0df-ec1a98099e7f",
  "severity": "low",
  "tags": ["Elastic", "linux"],
  "type": "query",
  "version": 1
}
