{
  "description": "Linux: Mknod Activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Linux: Mknod Activity",
  "query": "process.name: mknod and event.action:executed",
  "risk_score": 50,
  "rule_id": "61c31c14-507f-4627-8c31-072556b89a9c",
  "severity": "low",
  "type": "query",
  "version": 1
}
