{
  "rule_id": "c6b6ac2e-d3c8-435f-b6b2-208dbd7c4fb9",
  "risk_score": 50,
  "description": "Linux ld.so process activity",
  "immutable": true,
  "interval": "5m",
  "name": "Linux ld.so process activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:ld.so",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
