{
  "description": "Linux: Whoami Commmand",
  "enabled": false,
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Linux: Whoami Commmand",
  "query": "process.name: whoami and event.action:executed",
  "risk_score": 50,
  "rule_id": "120559c6-5e24-49f4-9e30-8ffe697df6b9",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
