{
  "description": "Linux lzop activity - possible @JulianRunnels",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Linux lzop activity - possible @JulianRunnels",
  "query": "process.name:lzop",
  "risk_score": 50,
  "rule_id": "d89b05b1-9b2b-45ea-9876-4a74550af6a6",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
