{
  "description": "Linux: Process Started in Temp Directory",
  "enabled": false,
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Linux: Process Started in Temp Directory",
  "query": "process.working_directory: /tmp and event.action:executed",
  "risk_score": 50,
  "rule_id": "df959768-b0c9-4d45-988c-5606a2be8e5a",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
