{
  "description": "Linux Network - Anomalous Process Using HTTP/S Ports",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Linux Network - Anomalous Process Using HTTP/S Ports",
  "query": "(destination.port:443 or destination.port:80) and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16 and not process.name:curl and not process.name:http and not process.name:https and not process.name:nginx and not process.name:packetbeat and not process.name:python2 and not process.name:snapd and not process.name:wget",
  "risk_score": 50,
  "rule_id": "be40c674-1799-4a00-934d-0b2d54495913",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
