{
  "description": "Identifies suspicious commands executed via a web server, which may suggest a vulnerability and remote shell access.",
  "enabled": false,
  "false_positives": [
    "Network monitoring or management products may have a web server component that runs shell commands as part of normal behavior."
  ],
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "index": [
    "auditbeat-*"
  ],
  "interval": "5m",
  "language": "kuery",
  "max_signals": 33,
  "name": "Linux: Shell Activity By Web Server",
  "query": "process.name: bash and (user.name: apache or www) and event.action:executed",
  "references": [
    "https://pentestlab.blog/tag/web-shell/"
  ],
  "risk_score": 50,
  "rule_id": "231876e7-4d1f-4d63-a47c-47dd1acdc1cb",
  "severity": "low",
  "tags": [
    "EIA",
    "auditbeat"
  ],
  "threats": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/techniques/TA0003/"
      },
      "techniques": [
        {
          "id": "T1100",
          "name": "Web Shell",
          "reference": "https://attack.mitre.org/techniques/T1215/"
        }
      ]
    }
  ],
  "to": "now",
  "type": "query",
  "version": 1
}
