{
  "rule_id": "52b05dad-5753-4bcb-9f68-5db1e069d11d",
  "risk_score": 50,
  "description": "Linux: Shell Activity By Web Server",
  "immutable": true,
  "interval": "5m",
  "name": "Linux: Shell Activity By Web Server",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name: bash and (user.name: apache or www)",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
