{
  "description": "Linux: Tcpdump Activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Linux: Tcpdump Activity",
  "query": "process.name: tcpdump and event.action:executed",
  "risk_score": 50,
  "rule_id": "7a137d76-ce3d-48e2-947d-2747796a78c0",
  "severity": "low",
  "type": "query",
  "version": 1
}
