{
  "rule_id": "3f31a31c-f7cf-4268-a0df-ec1a98099e7f",
  "risk_score": 50,
  "description": "Linux ld.so process activity",
  "immutable": true,
  "interval": "5m",
  "name": "Linux ld.so process activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:ld.so",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
