{
  "description": "Linux: Hping Activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Linux: Hping Activity",
  "query": "process.name: hping  and event.action:executed",
  "risk_score": 50,
  "rule_id": "90169566-2260-4824-b8e4-8615c3b4ed52",
  "severity": "low",
  "type": "query",
  "version": 1
}
