{
  "description": "Linux: Ptrace Activity",
    "language": "kuery",
  "name": "Linux: Ptrace Activity",
  "query": "process.name: ptrace and event.action:executed",
  "risk_score": 50,
  "rule_id": "1bff9259-e160-4920-bf72-4c96b6dbb7af",
  "severity": "low",
  "type": "query",
  "version": 1
}
