{
  "description": "Linux: Rawshark Activity",
    "language": "kuery",
  "name": "Linux: Rawshark Activity",
  "query": "process.name: rawshark and event.action:executed",
  "risk_score": 50,
  "rule_id": "30eb2b9d-b53b-4ba5-bfab-7119a8b84029",
  "severity": "low",
  "type": "query",
  "version": 1
}
