{
  "description": "Linux: Nping Activity",
  "enabled": false,
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "key": "event.dataset",
        "negate": false,
        "params": {
          "query": "process"
        },
        "type": "phrase",
        "value": "process"
      },
      "query": {
        "match": {
          "event.dataset": {
            "query": "process",
            "type": "phrase"
          }
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
        "key": "event.action",
        "negate": false,
        "params": {
          "query": "process_started"
        },
        "type": "phrase",
        "value": "process_started"
      },
      "query": {
        "match": {
          "event.action": {
            "query": "process_started",
            "type": "phrase"
          }
        }
      }
    }
  ],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Linux: Nping Activity",
  "query": "process.name: nmap",
  "risk_score": 50,
  "rule_id": "0d69150b-96f8-467c-a86d-a67a3378ce77",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
