{
  "rule_id": "333e9911-a5f4-4141-b7d4-761a17ac59bc",
  "risk_score": 50,
  "description": "Main Log [Filebeat Icinga] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Main Log [Filebeat Icinga] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "",
  "language": "kuery",
  "filters": [
    {
      "query": {
        "match": {
          "event.module": {
            "query": "icinga",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "value": "icinga",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "icinga",
          "type": "phrase"
        },
        "key": "event.module",
        "negate": false,
        "type": "phrase",
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index"
      },
      "$state": {
        "store": "appState"
      }
    },
    {
      "query": {
        "match": {
          "fileset.name": {
            "query": "main",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "value": "main",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "main",
          "type": "phrase"
        },
        "key": "fileset.name",
        "negate": false,
        "type": "phrase",
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index"
      },
      "$state": {
        "store": "appState"
      }
    }
  ],
  "enabled": false,
  "version": 1
}
