{
  "rule_id": "143cb236-0956-4f42-a706-814bcaa0cf5a",
  "risk_score": 50,
  "description": "Network - RPC (Remote Procedure Call) from the Internet\t",
  "immutable": true,
  "interval": "5m",
  "name": "Network - RPC (Remote Procedure Call) from the Internet\t",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "destination.port:3389 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
