{
  "description": "Network - Port 8000 Activity to the Internet\t",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Network - Port 8000 Activity to the Internet\t",
  "query": "destination.port:8000 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "risk_score": 50,
  "rule_id": "08d5d7e2-740f-44d8-aeda-e41f4263efaf",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
