{
  "description": "Network - Tor Activity to the Internet",
  "language": "kuery",
  "name": "Network - Tor Activity to the Internet",
  "query": "(destination.port:9001 or destination.port:9030) and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "risk_score": 50,
  "rule_id": "7d2c38d7-ede7-4bdf-b140-445906e6c540",
  "severity": "low",
  "type": "query",
  "version": 1
}
