{
  "description": "Network - Telnet Port Activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Network - Telnet Port Activity",
  "query": "destination.port:23",
  "risk_score": 50,
  "rule_id": "34fde489-94b0-4500-a76f-b8a157cf9269",
  "severity": "low",
  "type": "query",
  "version": 1
}
