{
  "description": "Network - RPC (Remote Procedure Call) from the Internet",
  "language": "kuery",
  "name": "Network - RPC (Remote Procedure Call) from the Internet",
  "query": "destination.port:3389 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "risk_score": 50,
  "rule_id": "143cb236-0956-4f42-a706-814bcaa0cf5a",
  "severity": "low",
  "type": "query",
  "version": 1
}
