{
  "description": "Network - SMTP to the Internet",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Network - SMTP to the Internet",
  "query": "destination.port:25 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "risk_score": 50,
  "rule_id": "67a9beba-830d-4035-bfe8-40b7e28f8ac4",
  "severity": "low",
  "type": "query",
  "version": 1
}
