{
  "description": "Network - IRC (Internet Relay Chat) Protocol Activity to the Internet",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Network - IRC (Internet Relay Chat) Protocol Activity to the Internet",
  "query": "(destination.port:20 or destination.port:21) and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "risk_score": 50,
  "rule_id": "c6474c34-4953-447a-903e-9fcb7b6661aa",
  "severity": "low",
  "type": "query",
  "version": 1
}
