{
  "rule_id": "32923416-763a-4531-bb35-f33b9232ecdb",
  "risk_score": 50,
  "description": "Network - RPC (Remote Procedure Call) to the Internet\t",
  "immutable": true,
  "interval": "5m",
  "name": "Network - RPC (Remote Procedure Call) to the Internet\t",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "destination.port:135 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
