{
  "description": "This signal detects events that may indicate use of a PPTP VPN connection. Some threat actors use these types of connections to tunnel their traffic while avoiding detection.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "interval": "5m",
  "language": "kuery",
  "name": "PPTP (Point to Point Tunneling Protocol) Activity",
  "query": "network.transport: tcp and destination.port: 1723",
  "risk_score": 25,
  "rule_id": "d2053495-8fe7-4168-b3df-dad844046be3",
  "severity": "low",
  "tags": [
    "Elastic",
    "network"
  ],
  "to": "now",
  "type": "query",
  "version": 1
}
