{
  "description": "Network - Port 26 Activity",
  "language": "kuery",
  "name": "Network - Port 26 Activity",
  "query": "destination.port:26",
  "risk_score": 50,
  "rule_id": "d7e62693-aab9-4f66-a21a-3d79ecdd603d",
  "severity": "low",
  "type": "query",
  "version": 1
}
