{
  "description": "Network - NAT Traversal Port Activity",
  "language": "kuery",
  "name": "Network - NAT Traversal Port Activity",
  "query": "destination.port:4500",
  "risk_score": 50,
  "rule_id": "a9cb3641-ff4b-4cdc-a063-b4b8d02a67c7",
  "severity": "low",
  "type": "query",
  "version": 1
}
