{
  "description": "Network - Telnet Port Activity\t",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Network - Telnet Port Activity\t",
  "query": "destination.port:23",
  "risk_score": 50,
  "rule_id": "34fde489-94b0-4500-a76f-b8a157cf9269",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
