{
  "description": "Network - PPTP (Point to Point Tunneling Protocol) Activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Network - PPTP (Point to Point Tunneling Protocol) Activity",
  "query": "destination.port:1723",
  "risk_score": 50,
  "rule_id": "d2053495-8fe7-4168-b3df-dad844046be3",
  "severity": "low",
  "type": "query",
  "version": 1
}
