{
  "rule_id": "3094b73d-e134-4216-b822-c9c1ba54e24f",
  "risk_score": 50,
  "description": "Network - Port 26 Activity\t",
  "immutable": true,
  "interval": "5m",
  "name": "Network - Port 26 Activity\t",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "destination.port:26",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
