{
  "rule_id": "89c732d5-55f6-4221-8b47-3cba5ffe81b1",
  "risk_score": 50,
  "description": "Nginx error logs [Filebeat Nginx] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Nginx error logs [Filebeat Nginx] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.module:nginx AND message:*",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
