{
  "description": "A request to a web application server contained no identifying user agent string.",
  "false_positives": [
    "Some normal applications and scripts may contain no user agent. Most legitimate web requests from the Internet contain a user agent string. Requests from web browsers almost always contain a user agent string. If the source is unexpected, the user unauthorized, or the request unusual, these may indicate suspicious or malicious activity."
  ],
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "exists": {
        "field": "user_agent.original"
      },
      "meta": {
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "key": "user_agent.original",
        "negate": true,
        "type": "exists",
        "value": "exists"
      }
    }
  ],
  "index": [
    "apm-*-transaction*"
  ],
  "language": "kuery",
  "max_signals": 100,
  "name": "Web Application Suspicious Activity: No User Agent",
  "query": "url.path: *",
  "references": [
    "https://en.wikipedia.org/wiki/User_agent"
  ],
  "risk_score": 47,
  "rule_id": "43303fd4-4839-4e48-b2b2-803ab060758d",
  "severity": "medium",
  "tags": [
    "Elastic",
    "APM"
  ],
  "type": "query",
  "version": 1
}
