{
  "rule_id": "7c5a4164-62e1-400d-b132-94ff67c91c10",
  "risk_score": 50,
  "description": "PAN-OS Threats [Filebeat PANW] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "PAN-OS Threats [Filebeat PANW] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "panw.panos:* and event.category: \"security_threat\"",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
