{
  "rule_id": "20d61d3d-5b4d-49ec-9042-6bff836b0f18",
  "risk_score": 50,
  "description": "PAN-OS Threats [Filebeat PANW] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "PAN-OS Threats [Filebeat PANW] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "panw.panos:* and event.category: \"security_threat\"",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
