{
  "rule_id": "9d32e645-92e9-471a-8c02-25738d12c55d",
  "risk_score": 50,
  "description": "PAN-OS Flows [Filebeat PANW] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "PAN-OS Flows [Filebeat PANW] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "panw.panos:* and event.category: \"network_traffic\"",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
