{
  "description": "Powershell network connection",
  "enabled": false,
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "key": "event.action",
        "negate": false,
        "params": {
          "query": "Network connection detected (rule: NetworkConnect)"
        },
        "type": "phrase",
        "value": "Network connection detected (rule: NetworkConnect)"
      },
      "query": {
        "match": {
          "event.action": {
            "query": "Network connection detected (rule: NetworkConnect)",
            "type": "phrase"
          }
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
        "key": "destination.ip",
        "negate": true,
        "params": {
          "query": "169.254.169.254"
        },
        "type": "phrase",
        "value": "169.254.169.254"
      },
      "query": {
        "match": {
          "destination.ip": {
            "query": "169.254.169.254",
            "type": "phrase"
          }
        }
      }
    }
  ],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Powershell network connection",
  "query": "process.name:powershell.exe",
  "risk_score": 50,
  "rule_id": "8e792144-39a6-4a63-9779-2f12719dc132",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
