{
  "description": "Process started by Windows Defender",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Process started by Windows Defender",
  "query": "parent.process.name:MsMpEng.exe",
  "risk_score": 50,
  "rule_id": "b3da3321-417d-494b-854c-b40369e063f0",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
