{
  "rule_id": "b1f57051-c341-4a6a-b932-aa0b86f2cd0b",
  "risk_score": 50,
  "description": "Process started by Windows Defender",
  "immutable": true,
  "interval": "5m",
  "name": "Process started by Windows Defender",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "parent.process.name:MsMpEng.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
