{
  "description": "Process started by MS Office program - possible payload",
  "enabled": false,
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "key": "event.action",
        "negate": false,
        "params": {
          "query": "Process Create (rule: ProcessCreate)"
        },
        "type": "phrase",
        "value": "Process Create (rule: ProcessCreate)"
      },
      "query": {
        "match": {
          "event.action": {
            "query": "Process Create (rule: ProcessCreate)",
            "type": "phrase"
          }
        }
      }
    }
  ],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Process started by MS Office program - possible payload",
  "query": "        process.parent.name:EXCEL.EXE or process.parent.name:MSPUB.EXE or process.parent.name:OUTLOOK.EXE or process.parent.name:POWERPNT.EXE or process.parent.name:VISIO.EXE or process.parent.name:WINWORD.EXE",
  "risk_score": 50,
  "rule_id": "3181b814-08e3-43f9-b77a-a2530603b131",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
