{
  "rule_id": "7bcbc979-b9c3-45b0-8369-be8ee87519ba",
  "risk_score": 50,
  "description": "Process started by Windows Defender",
  "immutable": true,
  "interval": "5m",
  "name": "Process started by Windows Defender",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "parent.process.name:MsMpEng.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
