{
  "rule_id": "cb23119f-f151-4bad-b232-c3f743ffb169",
  "risk_score": 50,
  "description": "PSexec activity",
  "immutable": true,
  "interval": "5m",
  "name": "PSexec activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:PsExec.exe or process.name:PsExec64.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
