{
  "rule_id": "7ffb7249-e63c-49e4-843e-40f5a25833b2",
  "risk_score": 50,
  "description": "PSexec activity",
  "immutable": true,
  "interval": "5m",
  "name": "PSexec activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:PsExec.exe or process.name:PsExec64.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
