{
  "rule_id": "3ec480a1-cdaf-4c86-b466-37585b6381d4",
  "risk_score": 50,
  "description": "Query Durations [Filebeat PostgreSQL] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Query Durations [Filebeat PostgreSQL] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.duration:*",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
