{
  "rule_id": "d655f83e-67fa-4207-80db-d706787d558f",
  "risk_score": 50,
  "description": "Santa Logs Search [Filebeat Santa] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Santa Logs Search [Filebeat Santa] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "",
  "language": "kuery",
  "filters": [
    {
      "query": {
        "match": {
          "event.module": {
            "query": "santa",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "value": "santa",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "santa",
          "type": "phrase"
        },
        "key": "event.module",
        "negate": false,
        "type": "phrase",
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index"
      },
      "$state": {
        "store": "appState"
      }
    },
    {
      "query": {
        "match": {
          "event.dataset": {
            "query": "log",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "value": "log",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "log",
          "type": "phrase"
        },
        "key": "event.dataset",
        "negate": false,
        "type": "phrase",
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index"
      },
      "$state": {
        "store": "appState"
      }
    }
  ],
  "enabled": false
}
