{
  "description": "(Search) Windows 10",
  "enabled": false,
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "key": "agent.hostname",
        "negate": false,
        "params": {
          "query": "LAPTOP-CQNI37L2"
        },
        "type": "phrase"
      },
      "query": {
        "match": {
          "agent.hostname": {
            "query": "LAPTOP-CQNI37L2",
            "type": "phrase"
          }
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
        "key": "event.provider",
        "negate": false,
        "params": {
          "query": "Microsoft-Windows-Sysmon"
        },
        "type": "phrase"
      },
      "query": {
        "match": {
          "event.provider": {
            "query": "Microsoft-Windows-Sysmon",
            "type": "phrase"
          }
        }
      }
    }
  ],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "(Search) Windows 10",
  "query": "",
  "risk_score": 50,
  "rule_id": "5d00c579-794c-4f64-be52-1ed8cae2b11e",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
