{
  "rule_id": "8278e750-62c7-4e0b-9f56-80840f809642",
  "risk_score": 50,
  "description": "Slow logs [Filebeat Redis] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Slow logs [Filebeat Redis] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.dataset:redis.slowlog",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
