{
  "rule_id": "673cc902-a654-40bb-bec6-1250cb9163ca",
  "risk_score": 50,
  "description": "Slow logs [Filebeat Redis] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Slow logs [Filebeat Redis] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.dataset:redis.slowlog",
  "language": "kuery",
  "filters": [],
  "enabled": false
}