{
  "rule_id": "e51b9252-9735-4e10-af4e-83884e41b8d7",
  "risk_score": 50,
  "description": "Slow logs [Filebeat MySQL] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Slow logs [Filebeat MySQL] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "",
  "language": "kuery",
  "filters": [
    {
      "query": {
        "match": {
          "event.module": {
            "query": "mysql",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "value": "mysql",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "mysql",
          "type": "phrase"
        },
        "key": "event.module",
        "negate": false,
        "type": "phrase",
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index"
      },
      "$state": {
        "store": "appState"
      }
    },
    {
      "query": {
        "match": {
          "fileset.name": {
            "query": "slowlog",
            "type": "phrase"
          }
        }
      },
      "meta": {
        "value": "slowlog",
        "disabled": false,
        "alias": null,
        "params": {
          "query": "slowlog",
          "type": "phrase"
        },
        "key": "fileset.name",
        "negate": false,
        "type": "phrase",
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index"
      },
      "$state": {
        "store": "appState"
      }
    }
  ],
  "enabled": false,
  "version": 1
}
