{
  "rule_id": "5f903032-56f2-48a8-8309-13a50ddb7c03",
  "risk_score": 50,
  "description": "Slow Queries [Filebeat PostgreSQL] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Slow Queries [Filebeat PostgreSQL] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.duration>30000000",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
