{
  "description": "Splunk - Processes created by netsh",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Splunk - Processes created by netsh",
  "query": "process.parent.name:netsh.exe",
  "risk_score": 50,
  "rule_id": "ce7a0bde-7406-4729-a075-a215f4571ff6",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
