{
  "description": "Splunk - Processes launching netsh",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Splunk - Processes launching netsh",
  "query": "process.name:netsh.exe and event.action:\"Process Create (rule: ProcessCreate)\" ",
  "risk_score": 50,
  "rule_id": "600dba95-f1c6-4a4d-aae1-c79cbd8a5ddd",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
