{
  "description": "Splunk - Detect Long DNS TXT Record Response",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Splunk - Detect Long DNS TXT Record Response",
  "query": "network.protocol:dns and server.bytes>100 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16 and not destination.ip:169.254.169.254 and not destination.ip:127.0.0.53",
  "risk_score": 50,
  "rule_id": "2cdf84be-1c9c-4184-9880-75b9a6ddeaba",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
