{
  "description": "SQLmap user agent",
  "language": "kuery",
  "name": "SQLmap user agent",
  "query": "user_agent.original:\"sqlmap/1.3.11#stable (http://sqlmap.org)\"",
  "risk_score": 50,
  "rule_id": "d49cc73f-7a16-4def-89ce-9fc7127d7820",
  "severity": "low",
  "type": "query",
  "version": 1
}
