{
  "rule_id": "6cc6d34a-fb3b-4e8a-a40b-9fb0e94472ce",
  "risk_score": 50,
  "description": "SSH login attempts [Filebeat System] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "SSH login attempts [Filebeat System] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.dataset:system.auth AND system.auth.ssh.event:*",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
