{
  "rule_id": "0c46ece9-0759-4989-9b9f-c0a97a70f7f2",
  "risk_score": 50,
  "description": "Stacktraces [Filebeat Kafka] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Stacktraces [Filebeat Kafka] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "kafka.log.trace.class:*",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
