{
  "rule_id": "2f4f407c-f1c3-409f-a3a1-b06438595c84",
  "risk_score": 50,
  "description": "Startup Errors [Filebeat Icinga] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Startup Errors [Filebeat Icinga] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "log.level:critical",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
