{
  "rule_id": "68881825-8511-4d12-a4e6-faca164f676d",
  "risk_score": 50,
  "description": "Startup Errors [Filebeat Icinga] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Startup Errors [Filebeat Icinga] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "log.level:critical",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
