{
  "rule_id": "f2076d0c-946e-462e-82ca-3e31f0128c89",
  "risk_score": 50,
  "description": "Sudo commands [Filebeat System] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Sudo commands [Filebeat System] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "system.auth.sudo:*",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
