{
  "rule_id": "fc2a4b2b-73de-4d03-837d-1d003fc6d219",
  "risk_score": 50,
  "description": "Sudo commands [Filebeat System] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Sudo commands [Filebeat System] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "system.auth.sudo:*",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
