{
  "description": "Suricata eval PHP Function in an HTTP Request",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata eval PHP Function in an HTTP Request",
  "query": "event.module:suricata and event.kind:alert and (suricata.eve.alert.signature_id:2610088 or rule.id: 2610088)",
  "risk_score": 50,
  "rule_id": "8c77b4ed-4e98-438b-adb0-d645d4a4ea26",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
