{
  "description": "Suricata non-SMB Traffic on TCP Port 139 (SMB)",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata non-SMB Traffic on TCP Port 139 (SMB)",
  "query": "suricata.eve.alert.signature_id:2610011 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "c259ab53-4b1a-42f6-b204-fe057c521515",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
