{
  "description": "Suricata Directory Traversal Characters in HTTP Response",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Directory Traversal Characters in HTTP Response",
  "query": "event.module:suricata and event.kind:alert and (suricata.eve.alert.signature_id:2610086 or rule.id:2610086)",
  "references": [
    "https://github.com/travisbgreen/hunting-rules/blob/master/hunting.rules#L89",
    "This group of signatures detects directory traversal characters in a header of an HTTP response. This is not something you should see on a typical network and could indicate an attempt to exploit the web application."
  ],
  "risk_score": 75,
  "rule_id": "a6406974-ea70-45b5-b5d8-ca17695adbde",
  "severity": "high",
  "threats": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0001",
        "name": "initial access",
        "reference": "https://attack.mitre.org/tactics/TA0001/"
      },
      "techniques": [
        {
          "id": "T1190",
          "name": "exploit public-facing application",
          "reference": "https://attack.mitre.org/techniques/T1190/"
        }
      ]
    }
  ],
  "to": "now",
  "type": "query",
  "version": 1
}
