{
  "description": "Suricata Windows Executable Served by JPEG Web Content",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Windows Executable Served by JPEG Web Content",
  "query": "suricata.eve.alert.signature_id:2610084 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "f7f038f4-b97a-4d0c-b3b6-d5fa1ad15951",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
