{
  "description": "Suricata non-TLS on TLS Port",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata non-TLS on TLS Port",
  "query": "suricata.eve.alert.signature_id:2610004 and (event.module:suricata and event.kind:alert) and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "risk_score": 50,
  "rule_id": "b060c87f-af49-40eb-acee-561a1f1331aa",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
