{
  "rule_id": "fcf0d82a-adc3-438f-8bd7-41d3b253e012",
  "risk_score": 50,
  "description": "Suricata Mimikatz Artifacts in an HTTP POST",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata Mimikatz Artifacts in an HTTP POST",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "suricata.eve.alert.signature_id:2610155 and (event.module:suricata and event.kind:alert)",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
