{
  "description": "Suricata Category - Potentially Vulnerable Web Application Access",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Potentially Vulnerable Web Application Access",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"access to a potentially vulnerable web application\" or rule.category: \"access to a potentially vulnerable web application\")",
  "risk_score": 75,
  "rule_id": "0993e926-1a01-4c28-918a-cdd5741a19a8",
  "severity": "medium",
  "to": "now",
  "type": "query",
  "version": 1
}
