{
  "description": "Suricata Directory Traversal in Downloaded Zip File",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Directory Traversal in Downloaded Zip File",
  "query": "event.module:suricata and event.kind:alert and (suricata.eve.alert.signature_id:2610085 or rule.id:2610085)",
  "references": [
    "https://github.com/travisbgreen/hunting-rules/blob/master/hunting.rules#L88",
    "This group of signatures detects directory traversal characters in a zip archive downloaded over the network. This is not something you should see on a typical network and could indicate an attempt to trick a user to overwrite system files."
  ],
  "risk_score": 75,
  "rule_id": "d5d990bc-303c-4241-8138-6ba3cf2ee93e",
  "severity": "medium",
  "threats": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "techniques": [
        {
          "id": "T1204",
          "name": "user execution",
          "reference": "https://attack.mitre.org/techniques/T1204/"
        }
      ]
    }
  ],
  "to": "now",
  "type": "query",
  "version": 1
}
