{
  "description": "Suricata non-FTP Traffic on Port 21",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata non-FTP Traffic on Port 21",
  "query": "suricata.eve.alert.signature_id:2610006 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "ee2b07ec-94dd-48b2-b46b-7bef47cc43fc",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
