{
  "description": "Suricata Directory Traversal Characters in an HTTP Request Header",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Directory Traversal Characters in an HTTP Request Header",
  "query": "event.module:suricata and event.kind:alert and (suricata.eve.alert.signature_id: (2610161 or 2610162) or rule.id: (2610161 or 2610162))",
  "references": [
    "https://github.com/travisbgreen/hunting-rules/blob/master/hunting.rules#L179-L184",
    "This group of signatures detects directory traversal characters in a header of an HTTP request. This is not something you should see on a typical network and could indicate an attempt to exploit the web application."
  ],
  "risk_score": 50,
  "rule_id": "7c663c8d-cdfd-4605-9dd6-d682fa4ade8c",
  "severity": "medium",
  "threats": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0001",
        "name": "initial access",
        "reference": "https://attack.mitre.org/tactics/TA0001/"
      },
      "techniques": [
        {
          "id": "T1190",
          "name": "exploit public-facing application",
          "reference": "https://attack.mitre.org/techniques/T1190/"
        }
      ]
    }
  ],
  "to": "now",
  "type": "query",
  "version": 1
}
