{
  "description": "Suricata Category - Web Application Attack",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Web Application Attack",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Web Application Attack\" or rule.category: \"Web Application Attack\")",
  "risk_score": 75,
  "rule_id": "e856918b-f26e-4893-84b9-3deb65046fb7",
  "severity": "high",
  "to": "now",
  "type": "query",
  "version": 1
}
