{
  "description": "Suricata Category - Successful User Privilege Gain",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Successful User Privilege Gain",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Successful User Privilege Gain\" or rule.category: \"Successful User Privilege Gain\")",
  "risk_score": 50,
  "rule_id": "f8ebd022-6e92-4b80-ac49-7ee011ba2ce0",
  "severity": "high",
  "to": "now",
  "type": "query",
  "version": 1
}
