{
  "rule_id": "190bd112-f831-4813-98b2-e45a934277c2",
  "risk_score": 50,
  "description": "Suricata Category - Default Username and Password Login Attempt",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata Category - Default Username and Password Login Attempt",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Attempt to login by a default username and password\" or rule.category: \"Attempt to login by a default username and password\")",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
