{
  "description": "Suricata Category - Suspicious Filename Detected",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Suspicious Filename Detected",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"A suspicious filename was detected\" or rule.category: \"A suspicious filename was detected\")",
  "risk_score": 25,
  "rule_id": "d0489b07-8140-4e3d-a2b7-52f2c06fdc7c",
  "severity": "medium",
  "to": "now",
  "type": "query",
  "version": 1
}
