{
  "description": "Suricata Category - Targeted Malicious Activity",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Targeted Malicious Activity",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Targeted Malicious Activity was Detected\" or rule.category: \"Targeted Malicious Activity was Detected\")",
  "risk_score": 75,
  "rule_id": "d299379d-41de-4640-96b6-77aaa9adfa6f",
  "severity": "high",
  "to": "now",
  "type": "query",
  "version": 1
}
