{
  "description": "Suricata Category - A suspicious string was detected",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - A suspicious string was detected",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"A suspicious string was detected\" or rule.category: \"A suspicious string was detected\")",
  "risk_score": 50,
  "rule_id": "2a3d91c1-5065-46ab-bed0-93f80835b1d5",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
