{
  "description": "Suricata Category - Potential Corporate Privacy Violation",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Potential Corporate Privacy Violation",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Potential Corporate Privacy Violation\" or rule.category: \"Potential Corporate Privacy Violation\")",
  "risk_score": 25,
  "rule_id": "1c70f5d5-eae0-4d00-b35a-d34ca607094e",
  "severity": "high",
  "to": "now",
  "type": "query",
  "version": 1
}
