{
  "description": "Suricata Category - Unknown Traffic",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Unknown Traffic",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Unknown Traffic\" or rule.category: \"Unknown Traffic\")",
  "risk_score": 25,
  "rule_id": "827ea90c-00c2-45f7-b873-dd060297b2d2",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
