{
  "description": "Suricata shell_exec PHP Function in an HTTP POST",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata shell_exec PHP Function in an HTTP POST",
  "query": "suricata.eve.alert.signature_id:2610087 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "082fca48-4707-485a-aedb-340ee77e0687",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
