{
  "description": "Suricata Base64 Encoded Start-Process Powershell Execution",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Base64 Encoded Start-Process Powershell Execution",
  "query": "(event.module:suricata and event.kind:alert) and suricata.eve.alert.signature_id: (2610194 or 2610195 or 2610196 or 2610197 or 2610198 or 2610199)",
  "risk_score": 50,
  "rule_id": "372dce88-003d-4bcf-8c95-34ea8be180a1",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
