{
  "rule_id": "019ed38e-38ff-450f-9efb-1a0f968c9d91",
  "risk_score": 50,
  "description": "Suricata IMAP Traffic on Unusual Port, internet Destination",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata IMAP Traffic on Unusual Port, internet Destination",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "suricata.eve.alert.signature_id:2610009 and (event.module:suricata and event.kind:alert) and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
