{
  "description": "Suricata Category - Non-Standard Protocol or Event",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Non-Standard Protocol or Event",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Detection of a non-standard protocol or event\" or rule.category: \"Detection of a non-standard protocol or event\")",
  "risk_score": 50,
  "rule_id": "82f9f485-873b-4eeb-b231-052ab81e05b8",
  "severity": "medium",
  "to": "now",
  "type": "query",
  "version": 1
}
