{
  "description": "Suricata Category - Information Leak",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Information Leak",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Information Leak\" or rule.category: \"Information Leak\")",
  "risk_score": 25,
  "rule_id": "95df8ff4-7169-4c84-ae50-3561b1d1bc91",
  "severity": "medium",
  "to": "now",
  "type": "query",
  "version": 1
}
