{
  "description": "Suricata Commonly Abused DNS Domain Detected",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Commonly Abused DNS Domain Detected",
  "query": "suricata.eve.alert.signature:(TGI* and *HUNT* and *Abused* and *TLD*) and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "1844dfe1-b05e-4ca6-b367-6b9e3a1fe227",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
