{
  "description": "Suricata Category - Attempted Denial of Service",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Attempted Denial of Service",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Attempted Denial of Service\" or rule.category: \"Attempted Denial of Service\")",
  "risk_score": 50,
  "rule_id": "a62927f4-2488-4679-b56f-cda1a7f4c9e1",
  "severity": "high",
  "to": "now",
  "type": "query",
  "version": 1
}
