{
  "description": "Suricata RPC Traffic on HTTP Ports",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata RPC Traffic on HTTP Ports",
  "query": "suricata.eve.alert.signature_id:2610012 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "87e77fb6-b555-43be-adc5-f57c6aaf7cd0",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
