{
  "description": "Suricata Base64 Encoded New-Object Powershell Execution",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Base64 Encoded New-Object Powershell Execution",
  "query": "event.module:suricata and event.kind:alert and (suricata.eve.alert.signature_id: (2610188 or 2610189 or 2610190 or 2610191 or 2610192 or 2610193) or rule.id: (2610188 or 2610189 or 2610190 or 2610191 or 2610192 or 2610193))",
  "references": [
    "https://github.com/travisbgreen/hunting-rules/blob/master/hunting.rules#L191-L196",
    "This group of signatures detect base-64 encoded variations of the 'New-Object' Powershell cmdlet. This is not something you should see on a typical network and could indicate a possible command and control channel."
  ],
  "risk_score": 50,
  "rule_id": "d14d5401-0f7a-4933-b816-1b8f823e3d84",
  "severity": "high",
  "threats": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0011",
        "name": "command and control",
        "reference": "https://attack.mitre.org/tactics/TA0011/"
      },
      "techniques": [
        {
          "id": "T1001",
          "name": "data obfuscation",
          "reference": "https://attack.mitre.org/techniques/T1001/"
        },
        {
          "id": "T1132",
          "name": "data encoding",
          "reference": "https://attack.mitre.org/techniques/T1132/"
        }
      ]
    }
  ],
  "to": "now",
  "type": "query",
  "version": 1
}
