{
  "description": "Suricata Mimikatz Artifacts in an HTTP POST",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Mimikatz Artifacts in an HTTP POST",
  "query": "suricata.eve.alert.signature_id:2610155 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "1b62e8af-c10d-4708-9a74-118cb1c9ed8a",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
