{
  "description": "Suricata Directory Traversal in Downloaded Zip File",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Directory Traversal in Downloaded Zip File",
  "query": "suricata.eve.alert.signature_id:2610085 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "d5d990bc-303c-4241-8138-6ba3cf2ee93e",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
