{
  "description": "Suricata Double Encoded Characters in an HTTP POST",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Double Encoded Characters in an HTTP POST",
  "query": "suricata.eve.alert.signature_id:2610090 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "a839a360-94ae-4219-b1cc-458d836333a7",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
