{
  "description": "Suricata DNS Traffic on Unusual UDP Port",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata DNS Traffic on Unusual UDP Port",
  "query": "suricata.eve.alert.signature_id:2610015 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "2343d9a4-365b-45b2-acb0-76934d43c75b",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
