{
  "description": "Suricata Possible Cobalt Strike Malleable C2 Null Response",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Possible Cobalt Strike Malleable C2 Null Response",
  "query": "(event.module:suricata and event.kind:alert) and suricata.eve.alert.signature_id: (2610202 or 2610203)",
  "risk_score": 50,
  "rule_id": "6099a760-7293-4e26-8aa8-b984abb32ac6",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
