{
  "rule_id": "3309bffa-7c43-409a-acea-6631c1b077e5",
  "risk_score": 50,
  "description": "Suricata Category - Generic ICMP event",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata Category - Generic ICMP event",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Generic ICMP event\" or rule.category: \"Generic ICMP event\")",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
