{
  "rule_id": "59135ddf-2f5f-46f1-a7f5-af4cb5de54fe",
  "risk_score": 50,
  "description": "Suricata SSH Traffic Not on Port 22, Internet Destination",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata SSH Traffic Not on Port 22, Internet Destination",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "suricata.eve.alert.signature_id:2610007 and (event.module:suricata and event.kind:alert) and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
