{
  "description": "Suricata non-DNS Traffic on TCP Port 53",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata non-DNS Traffic on TCP Port 53",
  "query": "suricata.eve.alert.signature_id:2610014 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "67c7d28e-8be4-49ae-9c89-5c328ea245dc",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
