{
  "description": "Suricata Serialized PHP Detected",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Serialized PHP Detected",
  "query": "suricata.eve.alert.signature_id:2610091 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "3baa5b65-d11e-40fb-a9b4-6b2a6a062d48",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
