{
  "description": "Suricata non-IMAP Traffic on Port 1443 (IMAP)",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata non-IMAP Traffic on Port 1443 (IMAP)",
  "query": "suricata.eve.alert.signature_id:2610010 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "241b6a1d-4f73-4b68-bd98-22e909681930",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
