{
  "rule_id": "44a5c55a-a34f-43c3-8f21-df502862aa9b",
  "risk_score": 50,
  "description": "Suricata Category - System Call Detected",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata Category - System Call Detected",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"A system call was detected\" or rule.category: \"A system call was detected\")",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
