{
  "description": "Suricata Category - Attempted Information Leak",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Attempted Information Leak",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Attempted Information Leak\" or rule.category: \"Attempted Information Leak\")",
  "risk_score": 50,
  "rule_id": "88d69362-f496-41d6-8e6b-a2dbaed3513f",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
