{
  "description": "Suricata Category - Large Scale Information Leak",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Large Scale Information Leak",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Large Scale Information Leak\" or rule.category: \"Large Scale Information Leak\")",
  "risk_score": 75,
  "rule_id": "ca98de30-c703-4170-97ae-ab2b340f6080",
  "severity": "medium",
  "to": "now",
  "type": "query",
  "version": 1
}
