{
  "description": "Suricata Double Encoded Characters in a URI",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Double Encoded Characters in a URI",
  "query": "(event.module:suricata and event.kind:alert) and suricata.eve.alert.signature_id: (2610092 or 2610093 or 2610094 or 2610095)",
  "risk_score": 50,
  "rule_id": "1ed4d2d1-330c-4c7d-b32d-2d8805437946",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
