{
  "rule_id": "3f28971e-0fe4-48b1-b916-0901533ae64e",
  "risk_score": 50,
  "description": "Suricata RPC Traffic on HTTP Ports",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata RPC Traffic on HTTP Ports",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "suricata.eve.alert.signature_id:2610012 and (event.module:suricata and event.kind:alert)",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
