{
  "description": "Suricata CobaltStrike Artifact in an DNS Request",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata CobaltStrike Artifact in an DNS Request",
  "query": "event.module:suricata and event.kind:alert and (suricata.eve.alert.signature_id: (2610166 or 2610167 or 2610168) or rule.id: (2610166 or 2610167 or 2610168))",
  "risk_score": 100,
  "rule_id": "481ef0f5-beda-4fa2-8bfb-039c95500deb",
  "severity": "high",
  "to": "now",
  "type": "query",
  "version": 1
}
