{
  "rule_id": "93007a8d-443e-452d-bb9f-37c4ef0ac852",
  "risk_score": 50,
  "description": "Suricata HTTP Traffic On Unusual Port, Internet Destination",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata HTTP Traffic On Unusual Port, Internet Destination",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": " suricata.eve.alert.signature_id:2610001 and (event.module:suricata and event.kind:alert) and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
