{
  "description": "Suricata Base64 Encoded New-Object Powershell Execution",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Base64 Encoded New-Object Powershell Execution",
  "query": "(event.module:suricata and event.kind:alert) and suricata.eve.alert.signature_id: (2610188 or 2610189 or 2610190 or 2610191 or 2610192 or 2610193)",
  "risk_score": 50,
  "rule_id": "d14d5401-0f7a-4933-b816-1b8f823e3d84",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
