{
  "description": "Suricata Category - Potentially Bad Traffic",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Potentially Bad Traffic",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Potentially Bad Traffic\" or rule.category: \"Potentially Bad Traffic\")",
  "risk_score": 25,
  "rule_id": "197cdd5a-9880-4780-a87c-594d0ed2b7b4",
  "severity": "medium",
  "to": "now",
  "type": "query",
  "version": 1
}
