{
  "description": "Suricata Category - Decode of an RPC Query",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Decode of an RPC Query",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Decode of an RPC Query\" or rule.category: \"Decode of an RPC Query\")",
  "risk_score": 50,
  "rule_id": "e9fc5bd3-c8a1-442c-be6d-032da07c508b",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
