{
  "rule_id": "76ffa464-ec03-42e1-87ee-87760c331061",
  "risk_score": 50,
  "description": "Suricata Category - Network Trojan Detected",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata Category - Network Trojan Detected",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"A Network Trojan was detected\" or rule.category: \"A Network Trojan was detected\")",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
