{
  "description": "Suricata Directory Traversal Characters in HTTP Response",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Directory Traversal Characters in HTTP Response",
  "query": "suricata.eve.alert.signature_id:2610086 and (event.module:suricata and event.kind:alert)",
  "risk_score": 50,
  "rule_id": "a6406974-ea70-45b5-b5d8-ca17695adbde",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
