{
  "rule_id": "084f131e-0d11-43b9-824b-049611569da4",
  "risk_score": 50,
  "description": "Suricata eval PHP Function in an HTTP Request",
  "immutable": true,
  "interval": "5m",
  "name": "Suricata eval PHP Function in an HTTP Request",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "suricata.eve.alert.signature_id:2610088 and (event.module:suricata and event.kind:alert)",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
