{
  "description": "Suricata Category - Successful Credential Theft",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Suricata Category - Successful Credential Theft",
  "query": "event.module: suricata and event.kind: alert and (suricata.eve.alert.category: \"Successful Credential Theft Detected\" or rule.category: \"Successful Credential Theft Detected\")",
  "risk_score": 75,
  "rule_id": "90f3e735-2187-4e8e-8d28-6e3249964851",
  "severity": "high",
  "to": "now",
  "type": "query",
  "version": 1
}
