{
  "rule_id": "837a8e7c-2541-44d1-80bd-973e739b6ba7",
  "risk_score": 50,
  "description": "Syslog logs [Filebeat System] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Syslog logs [Filebeat System] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.dataset:system.syslog",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
