{
  "rule_id": "02c24939-9391-45e0-a992-17a4f5ffc3ee",
  "risk_score": 50,
  "description": "Syslog logs [Filebeat System] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Syslog logs [Filebeat System] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.dataset:system.syslog",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
