{
  "rule_id": "0294c7e1-92ce-4ef3-900b-32388486552f",
  "risk_score": 50,
  "description": "Traefik logs [Filebeat Traefik] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Traefik logs [Filebeat Traefik] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.module:traefik",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
