{
  "rule_id": "87e4309d-5cc5-4f11-a13e-a66bde5d1d2e",
  "risk_score": 50,
  "description": "Traefik logs [Filebeat Traefik] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Traefik logs [Filebeat Traefik] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.module:traefik",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
