{
  "rule_id": "dae232cd-6b2a-457d-9052-bcc4706f268b",
  "risk_score": 50,
  "description": "Ubiquiti Firewall Blocked Events [Filebeat Iptables] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Ubiquiti Firewall Blocked Events [Filebeat Iptables] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "iptables.ubiquiti.rule_set :* and event.outcome : \"deny\"",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
