{
  "rule_id": "92301fd6-cb56-43a2-aab1-dd04431ef3b6",
  "risk_score": 50,
  "description": "Ubiquiti Firewall Events [Filebeat Iptables] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Ubiquiti Firewall Events [Filebeat Iptables] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "iptables.ubiquiti.rule_set :*",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
