{
  "rule_id": "a09c3455-d029-48c2-b74e-96a489f71e2c",
  "risk_score": 50,
  "description": "Ubiquiti Firewall Events [Filebeat Iptables] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Ubiquiti Firewall Events [Filebeat Iptables] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "iptables.ubiquiti.rule_set :*",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
