{
  "rule_id": "3e8091f6-cfb4-4396-8e41-7eaf8cfc28bf",
  "risk_score": 50,
  "description": "Ubiquiti Firewall Blocked Events [Filebeat Iptables] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Ubiquiti Firewall Blocked Events [Filebeat Iptables] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "iptables.ubiquiti.rule_set :* and event.outcome : \"deny\"",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
