{
  "rule_id": "f677f7d6-34d3-4419-8222-0b5a4bb5c32a",
  "risk_score": 50,
  "description": "Ubiquiti Firewall Allowed Events [Filebeat Iptables] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "Ubiquiti Firewall Allowed Events [Filebeat Iptables] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "iptables.ubiquiti.rule_set :* and event.outcome : \"allow\"",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
