{
  "rule_id": "0dde6a64-de84-417d-bdac-8995120be894",
  "risk_score": 50,
  "description": "useradd logs [Filebeat System] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "useradd logs [Filebeat System] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "system.auth.useradd:*",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
