{
  "rule_id": "fb6f1c42-e0fe-41bf-aacc-db652a474db9",
  "risk_score": 50,
  "description": "useradd logs [Filebeat System] ECS",
  "immutable": true,
  "interval": "5m",
  "name": "useradd logs [Filebeat System] ECS",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "system.auth.useradd:*",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
