{
  "description": "Windows Registry Query, Network",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Registry Query, Network",
  "query": "event.code: 1 and process.name:reg.exe and process.args:*query* and process.args:*reg*",
  "risk_score": 50,
  "rule_id": "f5412e37-981e-4d37-a1b2-eddaf797445a",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
