{
  "description": "Command shell started by Powershell",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Command shell started by Powershell",
  "query": "process.parent.name:powershell.exe and process.name:cmd.exe",
  "risk_score": 50,
  "rule_id": "0f616aee-8161-4120-857e-742366f5eeb3",
  "severity": "low",
  "type": "query",
  "version": 1
}
