{
  "rule_id": "c4f1c224-36d5-4670-b829-98d9fd9bfd1f",
  "risk_score": 50,
  "description": "Windows Credential Dumping via Registry Save",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Credential Dumping via Registry Save",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.code: 1 and process.name:reg.exe and process.args:*save* and (process.args:*sam* or process.args:*system*)",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
