{
  "description": "Windows Mimikatz activity",
  "enabled": false,
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows Mimikatz activity",
  "query": "event.code: 1 and process.name:mimikatz.exe",
  "risk_score": 50,
  "rule_id": "5346463d-062f-419d-88ff-7a5e97875210",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
