{
  "description": "Windows Credential Dumping via ImageLoad",
  "language": "kuery",
  "name": "Windows Credential Dumping via ImageLoad",
  "query": "event.code:7 and not process.name:Sysmon.exe and not process.name:Sysmon64.exe and not process.name:svchost.exe and not process.name:logonui.exe and (file.path:*samlib.dll* or file.path:*WinSCard.dll* or file.path:*cryptdll.dll* or file.path:*hid.dll* or file.path:*vaultcli.dll*)",
  "risk_score": 50,
  "rule_id": "f872647c-d070-4b1c-afcc-055f081d9205",
  "severity": "low",
  "type": "query",
  "version": 1
}
