{
  "rule_id": "5126f4a6-cdcf-4113-bb8c-3c00433b9d00",
  "risk_score": 50,
  "description": "Windows Credential Dumping via ImageLoad",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Credential Dumping via ImageLoad",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.code:7 and not process.name:Sysmon.exe and not process.name:Sysmon64.exe and not process.name:svchost.exe and not process.name:logonui.exe and (file.path:*samlib.dll* or file.path:*WinSCard.dll* or file.path:*cryptdll.dll* or file.path:*hid.dll* or file.path:*vaultcli.dll*)",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
