{
  "description": "Windows Signed Binary Proxy Execution Download",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Signed Binary Proxy Execution Download",
  "query": " event.code:3 and http and (process.name:certutil.exe or process.name:replace.exe)",
  "risk_score": 50,
  "rule_id": "68ecc190-cce2-4021-b976-c7c846ac0a00",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
