{
  "description": "Windows Execution via Trusted Developer Utilities",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Execution via Trusted Developer Utilities",
  "query": "event.code:1 and (process.name:MSBuild.exe or process.name:msxsl.exe)",
  "risk_score": 50,
  "rule_id": "9d110cb3-5f4b-4c9a-b9f5-53f0a1707ae1",
  "severity": "low",
  "type": "query",
  "version": 1
}
