{
  "description": "Windows Netcat network activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Netcat network activity",
  "query": "process.name:ncat.exe and event.action:\"Network connection detected (rule: NetworkConnect)\"",
  "risk_score": 50,
  "rule_id": "ebdc4b6f-7fdb-4c21-bbd6-59e1ed11024a",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
