{
  "rule_id": "08c357f5-3b75-4144-97c8-a1afcfaa6754",
  "risk_score": 50,
  "description": "Windows Burp CE activity",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Burp CE activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:BurpSuiteCommunity.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
