{
  "description": "Windows Management Instrumentation (WMI) Execution",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Management Instrumentation (WMI) Execution",
  "query": "event.code:1 and (process.parent.args:*wmiprvse.exe* or process.name:wmic.exe or process.args:*wmic* )",
  "risk_score": 50,
  "rule_id": "cec5eb81-6e01-40e5-a1bf-bf175cce4eb4",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
