{
  "description": "Windows Priv Escalation via Accessibility Features",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Priv Escalation via Accessibility Features",
  "query": "event.code:1 and process.parent.name:winlogon.exe and (process.name:atbroker.exe or process.name:displayswitch.exe or process.name:magnify.exe or process.name:narrator.exe or process.name:osk.exe or process.name:sethc.exe or process.name:utilman.exe)",
  "risk_score": 50,
  "rule_id": "7405ddf1-6c8e-41ce-818f-48bea6bcaed8",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
