{
  "rule_id": "44b46461-8574-4c8c-a5b3-69ef4dd6682c",
  "risk_score": 50,
  "description": "Windows Iodine activity",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Iodine activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:iodine.exe or process.name:iodined.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false
}