{
  "description": "Identifies a suspicious parent child process relationship with cmd.exe spawning form Internet Explorer.",
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "max_signals": 33,
  "name": "Internet Explorer spawning cmd.exe",
  "query": "process.parent.name:iexplore.exe and process.name:cmd.exe",
  "risk_score": 21,
  "rule_id": "7a6e1e81-deae-4cf6-b807-9a768fff3c06",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1059",
          "name": "Command-Line Interface",
          "reference": "https://attack.mitre.org/techniques/T1059/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
