{
  "rule_id": "b9074c74-6d23-4b07-927e-cc18b318a088",
  "risk_score": 50,
  "description": "Windows Registry Query, Local",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Registry Query, Local",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.code: 1 and process.name:reg.exe and process.args:*query* and process.args:*reg*",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
