{
  "rule_id": "b79e0875-eee9-4775-ab7c-770794d20553",
  "risk_score": 50,
  "description": "Windows Persistence via BITS Jobs",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Persistence via BITS Jobs",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.code:1 and (process.name:bitsadmin.exe or process.args:*Start-BitsTransfer*)",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
