{
  "description": "Windows whoami command activity",
    "language": "kuery",
  "name": "Windows whoami command activity",
  "query": "process.name:whoami.exe and event.code:1",
  "risk_score": 50,
  "rule_id": "ef862985-3f13-4262-a686-5f357bbb9bc2",
  "severity": "low",
  "type": "query",
  "version": 1
}
