{
  "rule_id": "068a7dcf-6b5a-49c6-83c9-cbd4bcdf6554",
  "risk_score": 50,
  "description": "Windows Burp CE activity",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Burp CE activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:BurpSuiteCommunity.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false
}
