{
  "description": "Windows Defense Evasion or Persistence via Hidden Files",
  "language": "kuery",
  "name": "Windows Defense Evasion or Persistence via Hidden Files",
  "query": "event.code:1 and process.name:attrib.exe and (process.args:\"+h\" or process.args:\"+s\")",
  "risk_score": 50,
  "rule_id": "340a0063-baba-447b-8396-26a5cc1eb684",
  "severity": "low",
  "type": "query",
  "version": 1
}
