{
  "description": "Windows Indirect Command Execution",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Indirect Command Execution",
  "query": "event.code:1 and process.parent.name:pcalua.exe or (process.name:bash.exe or process.name:forfiles.exe or process.name:pcalua.exe)",
  "risk_score": 50,
  "rule_id": "ff969842-c573-4e69-8e12-02fb303290f2",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
