{
  "description": "Windows: Misc LOLBin Connecting to the Internet",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows: Misc LOLBin Connecting to the Internet",
  "query": "(process.name:expand.exe or process.name:extrac.exe or process.name:ieexec.exe or process.name:makecab.exe) and event.action:\"Network connection detected (rule: NetworkConnect)\" and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "risk_score": 50,
  "rule_id": "63e65ec3-43b1-45b0-8f2d-45b34291dc44",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
