{
  "rule_id": "a783a79d-14a1-4bb3-bbcb-ea6e16c7c723",
  "risk_score": 50,
  "description": "Windows Network - Anomalous Windows Process Using HTTP/S Ports",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Network - Anomalous Windows Process Using HTTP/S Ports",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "(destination.port:443 or destination.port:80) and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16 and not process.name:chrome.exe and not process.name:explorer.exe and not process.name:filebeat.exe and not process.name:firefox.exe and not process.name:iexplore.exe and not process.name:jusched.exe and not process.name:MpCmdRun.exe and not process.name:MpSigStub.exe and not process.name:msfeedssync.exe and not process.name:packetbeat.exe and not process.name:powershell.exe and not process.name:procexp64.exe and not process.name:svchost.exe and not process.name:taskhostw.exe and not process.name:winlogbeat.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
