{
  "description": "Windows Credential Dumping via Registry Save",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Credential Dumping via Registry Save",
  "query": "event.code: 1 and process.name:reg.exe and process.args:*save* and (process.args:*sam* or process.args:*system*)",
  "risk_score": 50,
  "rule_id": "9f6fb56f-4bbd-404e-b955-49dfba7c0e68",
  "severity": "low",
  "type": "query",
  "version": 1
}
