{
  "description": "Windows Registry Query, Local",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Registry Query, Local",
  "query": "event.code: 1 and process.name:reg.exe and process.args:*query* and process.args:*reg*",
  "risk_score": 50,
  "rule_id": "b9074c74-6d23-4b07-927e-cc18b318a088",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
