{
  "description": "Windows Persistence via BITS Jobs",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Persistence via BITS Jobs",
  "query": "event.code:1 and (process.name:bitsadmin.exe or process.args:*Start-BitsTransfer*)",
  "risk_score": 50,
  "rule_id": "7904fb20-172c-43fb-83e4-bfe27e3c702c",
  "severity": "low",
  "type": "query",
  "version": 1
}
