{
  "description": "Windows Wireshark activity",
  "language": "kuery",
  "name": "Windows Wireshark activity",
  "query": "process.name:wireshark.exe",
  "risk_score": 50,
  "rule_id": "9af965ed-d501-4541-97f6-5f8d2a39737b",
  "severity": "low",
  "type": "query",
  "version": 1
}
