{
  "description": "Identifies attempts to create new users via the SYSTEM account.",
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "max_signals": 33,
  "name": "Net command via SYSTEM account",
  "query": "process.name: (net.exe or net1.exe) and user.name:SYSTEM",
  "risk_score": 21,
  "rule_id": "c3f5dc81-a8b4-4144-95a7-d0a818d7355d",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1136",
          "name": "Create Account",
          "reference": "https://attack.mitre.org/techniques/T1136/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
