{
  "description": "Windows Persistence or Priv Escalation via Hooking",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Persistence or Priv Escalation via Hooking",
  "query": "event.code:1 and process.name:mavinject.exe and processs.args:*INJECTRUNNING*",
  "risk_score": 50,
  "rule_id": "015f070d-cf70-437c-99d1-472e31d36b03",
  "severity": "low",
  "type": "query",
  "version": 1
}
