{
  "description": "Windows Defense Evasion via Windows Event Log Tools",
  "language": "kuery",
  "name": "Windows Defense Evasion via Windows Event Log Tools",
  "query": "event.code:1 and process.name:wevtutil.exe",
  "risk_score": 50,
  "rule_id": "07979a67-ab4d-460f-9ff3-bf1352de6762",
  "severity": "low",
  "type": "query",
  "version": 1
}
