{
  "description": "Windows Payload Obfuscation via Certutil",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Payload Obfuscation via Certutil",
  "query": "event.code:1 and process.name:certutil.exe and (process.args:*encode* or process.args:*ToBase64String*)",
  "risk_score": 50,
  "rule_id": "ce7c270c-c69b-47dd-8c21-60a35e92f372",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
