{
  "description": "WinDump activity",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "WinDump activity",
  "query": "process.name:WinDump.exe",
  "risk_score": 50,
  "rule_id": "61c56cf4-0c08-4ad5-83ea-d2fe6ac62fa8",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
