{
  "rule_id": "03ef1aca-2fdf-4fb4-8c98-d1ebbbfc08f9",
  "risk_score": 50,
  "description": "Windows Defense evasion via Filter Manager",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Defense evasion via Filter Manager",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.code:1 and process.name:fltmc.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
