{
  "description": "Identifies use of scrcons.exe, which is a Windows Management Instrumentation (WMI) Standard Event Consumer scripting application.",
  "false_positives": [
    " Windows Management Instrumentation (WMI) processes can be used for an array of administrative capabilities. It's important to baseline your environment to determine any abnormal use of this tool."
  ],
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "max_signals": 33,
  "name": "Execution via Scrcons",
  "query": "process.name:scrcons.exe",
  "risk_score": 21,
  "rule_id": "7e6cd4b9-6346-4683-b3e6-6a3e66f3208f",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1047",
          "name": "Windows Management Instrumentation",
          "reference": "https://attack.mitre.org/techniques/T1047/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
