{
  "description": "Binaries signed with trusted digital certificates can execute on Windows systems protected by digital signature validation. Adversaries may use these binaries to 'live off the land' and execute malicious files that could bypass application whitelisting and signature validation.",
  "false_positives": [
    "Security testing may produce events like this. Activity of this kind performed by non-engineers and ordinary users is unusual."
  ],
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "max_signals": 100,
  "name": "Execution via Signed Binary",
  "query": "event.code:1 and http and (process.name:certutil.exe or process.name:msiexec.exe)",
  "risk_score": 21,
  "rule_id": "7edb573f-1f9b-4161-8c19-c7c383bb17f2",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1218",
          "name": "Signed Binary Proxy Execution",
          "reference": "https://attack.mitre.org/techniques/T1218/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1218",
          "name": "Signed Binary Proxy Execution",
          "reference": "https://attack.mitre.org/techniques/T1218/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
