{
  "description": "Windows Defense evasion via Filter Manager",
  "language": "kuery",
  "name": "Windows Defense evasion via Filter Manager",
  "query": "event.code:1 and process.name:fltmc.exe",
  "risk_score": 50,
  "rule_id": "06dceabf-adca-48af-ac79-ffdf4c3b1e9a",
  "severity": "low",
  "type": "query",
  "version": 1
}
