{
  "rule_id": "13a85a44-7aae-46bb-9d1c-e778ca740783",
  "risk_score": 50,
  "description": "Windows Defense Evasion - Decoding Using Certutil",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Defense Evasion - Decoding Using Certutil",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.code:1 and process.name:attrib.exe and (process.args:*+h* or process.args:*+s*)",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
