{
  "description": "Windows Execution via Compiled HTML File",
  "language": "kuery",
  "name": "Windows Execution via Compiled HTML File",
  "query": "event.code:1 and process.name:hh.exe",
  "risk_score": 50,
  "rule_id": "e3343ab9-4245-4715-b344-e11c56b0a47f",
  "severity": "low",
  "type": "query",
  "version": 1
}
