{
  "rule_id": "eb70c7bf-b8bb-460c-ae33-b9fe329321c2",
  "risk_score": 50,
  "description": "Windows net command activity by the SYSTEM account",
  "immutable": true,
  "interval": "5m",
  "name": "Windows net command activity by the SYSTEM account",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "user.name:SYSTEM",
  "language": "kuery",
  "filters": [
    {
      "meta": {
        "type": "phrases",
        "key": "process.name",
        "value": "net.exe, net1.exe",
        "params": [
          "net.exe",
          "net1.exe"
        ],
        "alias": null,
        "negate": false,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index"
      },
      "query": {
        "bool": {
          "should": [
            {
              "match_phrase": {
                "process.name": "net.exe"
              }
            },
            {
              "match_phrase": {
                "process.name": "net1.exe"
              }
            }
          ],
          "minimum_should_match": 1
        }
      },
      "$state": {
        "store": "appState"
      }
    }
  ],
  "enabled": false
}