{
  "description": "Windows net command activity by the SYSTEM account",
  "enabled": false,
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows net command activity by the SYSTEM account",
  "query": "process.name: (net.exe or net1.exe) and user.name:SYSTEM",
  "risk_score": 50,
  "rule_id": "c3f5dc81-a8b4-4144-95a7-d0a818d7355d",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
