{
  "description": "Windows Signed Binary Proxy Execution",
  "language": "kuery",
  "name": "Windows Signed Binary Proxy Execution",
  "query": "event.code:1 and http and (process.name:certutil.exe or process.name:msiexec.exe)",
  "risk_score": 50,
  "rule_id": "7edb573f-1f9b-4161-8c19-c7c383bb17f2",
  "severity": "low",
  "type": "query",
  "version": 1
}
