{
  "description": "WinDump activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "WinDump activity",
  "query": "process.name:WinDump.exe",
  "risk_score": 50,
  "rule_id": "a342cfcb-8420-46a4-8d85-53edc631e0d6",
  "severity": "low",
  "type": "query",
  "version": 1
}
