{
  "rule_id": "7edadee3-98ae-472c-b1c4-8c0a2c4877cc",
  "risk_score": 50,
  "description": "Windows: Background Intelligent Transfer Service (BITS) Connecting to the Internet",
  "immutable": true,
  "interval": "5m",
  "name": "Windows: Background Intelligent Transfer Service (BITS) Connecting to the Internet",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:bitsadmin.exe and event.action:\"Network connection detected (rule: NetworkConnect)\" and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
