{
  "description": "Windows Persistence via Modification of Existing Service",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Persistence via Modification of Existing Service",
  "query": "event.code:1 and process.args:*sc*config*binpath* and (process.name:cmd.exe or process.name:powershell.exe or process.name:sc.exe)",
  "risk_score": 50,
  "rule_id": "3bb04809-84ab-4487-bd99-ccc58675bd40",
  "severity": "low",
  "type": "query",
  "version": 1
}
