{
  "rule_id": "8f504e59-540b-4e99-8823-dfe2647909ab",
  "risk_score": 50,
  "description": "WinDump activity",
  "immutable": true,
  "interval": "5m",
  "name": "WinDump activity",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:WinDump.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
