{
  "rule_id": "07979a67-ab4d-460f-9ff3-bf1352de6762",
  "risk_score": 50,
  "description": "Windows Defense Evasion via Windows Event Log Tools",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Defense Evasion via Windows Event Log Tools",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.code:1 and process.name:wevtutil.exe",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
