{
  "description": "Windows Remote Management Execution",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows Remote Management Execution",
  "query": "(process.name:wsmprovhost.exe or process.name:winrm.cmd) and (process.args:*Enable-PSRemoting -Force* or process.args:*Invoke-Command -computer_name* or process.args:*wmic*node*process call create*)",
  "risk_score": 50,
  "rule_id": "ced66221-3e07-40ee-8588-5f107e7d50d8",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
