{
  "description": "PSexec activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "PSexec activity",
  "query": "process.name:PsExec.exe or process.name:PsExec64.exe",
  "risk_score": 50,
  "rule_id": "3e61ab8b-0f39-4d2e-ab64-332f0d0b3ad7",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
