{
  "description": "Windows Mimikatz activity",
  "enabled": false,
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "key": "event.action",
        "negate": false,
        "params": {
          "query": "Process Create (rule: ProcessCreate)"
        },
        "type": "phrase",
        "value": "Process Create (rule: ProcessCreate)"
      },
      "query": {
        "match": {
          "event.action": {
            "query": "Process Create (rule: ProcessCreate)",
            "type": "phrase"
          }
        }
      }
    }
  ],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows Mimikatz activity",
  "query": "process.name:mimikatz.exe",
  "risk_score": 50,
  "rule_id": "5346463d-062f-419d-88ff-7a5e97875210",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
