{
  "description": "Windows Mimikatz activity",
    "language": "kuery",
  "name": "Windows Mimikatz activity",
  "query": "event.code: 1 and process.name:mimikatz.exe",
  "risk_score": 50,
  "rule_id": "5346463d-062f-419d-88ff-7a5e97875210",
  "severity": "low",
  "type": "query",
  "version": 1
}
