{
  "description": "Adversaries can use Regsvcs.exe and Regasm.exe to proxy execution of code through a trusted Windows utility.",
  "false_positives": [
    "Administrators may use the command prompt for regular administrative tasks. It's important to baseline your environment for network connections being made from the command prompt to determine any abnormal use of this tool."
  ],
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "max_signals": 33,
  "name": "Execution via Regsvcs/Regasm",
  "query": "event.code:1 and (process.name:regasm.exe or process.name:regsvcs.exe)",
  "risk_score": 21,
  "rule_id": "5c12412f-602c-4120-8c4f-69d723dbba04",
  "severity": "low",
  "tags": [
    "Elastic",
    "D-SA",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1121",
          "name": "Regsvcs/Regasm",
          "reference": "https://attack.mitre.org/techniques/T1121/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
