{
  "rule_id": "ddc98179-5c99-4213-8b87-3605aa427fc3",
  "risk_score": 50,
  "description": "Windows: Command Prompt Connecting to the Internet",
  "immutable": true,
  "interval": "5m",
  "name": "Windows: Command Prompt Connecting to the Internet",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:cmd.exe and event.action:\"Network connection detected (rule: NetworkConnect)\" and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
