{
  "rule_id": "a998ef31-f60e-455c-9d61-692d09ee0f63",
  "risk_score": 50,
  "description": "Windows: Microsoft HTML Application (HTA) Connecting to the Internet",
  "immutable": true,
  "interval": "5m",
  "name": "Windows: Microsoft HTML Application (HTA) Connecting to the Internet",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "process.name:mshta.exe and event.action:\"Network connection detected (rule: NetworkConnect)\" and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
