{
  "description": "Windows nmap scan activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows nmap scan activity",
  "query": "process.name:nmap.exe and event.action:\"Network connection detected (rule: NetworkConnect)\"",
  "risk_score": 50,
  "rule_id": "54413985-a3da-4f45-b238-75afb65a1bae",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
