{
  "description": "Windows Netcat activity",
    "language": "kuery",
  "name": "Windows Netcat activity",
  "query": "process.name:ncat.exe and event.code:1",
  "risk_score": 50,
  "rule_id": "e2437364-0c89-4e65-a34b-782cfbb7690b",
  "severity": "low",
  "type": "query",
  "version": 1
}
