{
  "description": "Process started by MS Office program - possible payload",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Process started by MS Office program - possible payload",
  "query": "process.parent.name:EXCEL.EXE or process.parent.name:MSPUB.EXE or process.parent.name:OUTLOOK.EXE or process.parent.name:POWERPNT.EXE or process.parent.name:VISIO.EXE or process.parent.name:WINWORD.EXE and event.code:1",
  "risk_score": 50,
  "rule_id": "838dcec6-ce9a-4cdd-9ca8-f6512cf6d559",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
