{
  "description": "Command shell started by Svchost",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Command shell started by Svchost",
  "query": "process.parent.name:svchost.exe and process.name:cmd.exe",
  "risk_score": 50,
  "rule_id": "fd7a6052-58fa-4397-93c3-4795249ccfa2",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
