{
  "description": "Command shell started by Internet Explorer",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Command shell started by Internet Explorer",
  "query": "process.parent.name:iexplore.exe and process.name:cmd.exe",
  "risk_score": 50,
  "rule_id": "7a6e1e81-deae-4cf6-b807-9a768fff3c06",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
