{
  "description": "Windows Iodine activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Iodine activity",
  "query": "event.code: 1 and process.name:iodine.exe or process.name:iodined.exe",
  "risk_score": 50,
  "rule_id": "fcbbf0b2-99c5-4c7f-8411-dc9ee392e43f",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
