{
  "description": "Windows Defense Evasion - Decoding Using Certutil",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Defense Evasion - Decoding Using Certutil",
  "query": "event.code:1 and process.name:attrib.exe and (process.args:*+h* or process.args:*+s*)",
  "risk_score": 50,
  "rule_id": "d9642bf2-87d0-45c2-8781-2bd2017cdbb8",
  "severity": "low",
  "type": "query",
  "version": 1
}
