{
  "description": "Windows Indirect Command Execution",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows Indirect Command Execution",
  "query": "event.code:1 and process.parent.name:pcalua.exe or (process.name:bash.exe or process.name:forfiles.exe or process.name:pcalua.exe)",
  "risk_score": 50,
  "rule_id": "ff969842-c573-4e69-8e12-02fb303290f2",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
