{
  "description": "Windows Scheduled Task Activity",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Scheduled Task Activity",
  "query": "event.code:1 and (process.name:schtasks.exe or process.name:taskeng.exe) or (event.code:1 and process.name:svchost.exe and not process.parent.executable: \"C:\\Windows\\System32\\services.exe\" )",
  "risk_score": 50,
  "rule_id": "a1abd54d-3021-4f21-b2d1-0c6bc5c4051f",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
