{
  "description": "Windows net command activity by the SYSTEM account",
  "enabled": false,
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": null,
        "disabled": false,
        "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
        "key": "process.name",
        "negate": false,
        "params": [
          "net.exe",
          "net1.exe"
        ],
        "type": "phrases",
        "value": "net.exe, net1.exe"
      },
      "query": {
        "bool": {
          "minimum_should_match": 1,
          "should": [
            {
              "match_phrase": {
                "process.name": "net.exe"
              }
            },
            {
              "match_phrase": {
                "process.name": "net1.exe"
              }
            }
          ]
        }
      }
    }
  ],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Windows net command activity by the SYSTEM account",
  "query": "user.name:SYSTEM",
  "risk_score": 50,
  "rule_id": "c3f5dc81-a8b4-4144-95a7-d0a818d7355d",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
