{
  "description": "Process Execution via WMI",
  "language": "kuery",
  "name": "Process Execution via WMI",
  "query": "process.name:scrcons.exe",
  "risk_score": 50,
  "rule_id": "7e6cd4b9-6346-4683-b3e6-6a3e66f3208f",
  "severity": "low",
  "type": "query",
  "version": 1
}
