{
  "description": "Windows Execution via Microsoft HTML Application (HTA)",
  "language": "kuery",
  "name": "Windows Execution via Microsoft HTML Application (HTA)",
  "query": "event.code:1 and (process.parent.args:*mshta* or process.args:*mshta*)",
  "risk_score": 50,
  "rule_id": "b007cc82-c522-48d1-b7a7-53f63c50c494",
  "severity": "low",
  "type": "query",
  "version": 1
}
