{
  "description": "Windows net user command activity",
    "language": "kuery",
  "name": "Windows net user command activity",
  "query": "process.name:net.exe and process.args:user and event.code:1",
  "risk_score": 50,
  "rule_id": "b039a69d-7fba-4c84-8029-57ac12548a15",
  "severity": "low",
  "type": "query",
  "version": 1
}
