{
  "rule_id": "66885745-ea38-432c-9edb-599b943948d4",
  "risk_score": 50,
  "description": "Windows Credential Dumping Commands",
  "immutable": true,
  "interval": "5m",
  "name": "Windows Credential Dumping Commands",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.code: 1 and process.args:*Invoke-Mimikatz-DumpCreds* or process.args:*gsecdump* or process.args:*wce* or (process.args:*procdump* and process.args:*lsass*) or (process.args:*ntdsutil* and process.args:*ntds*ifm*create*)",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
