{
  "description": "Windows Remote Management Execution",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Remote Management Execution",
  "query": "(process.name:wsmprovhost.exe or process.name:winrm.cmd) and (process.args:*Enable-PSRemoting -Force* or process.args:*Invoke-Command -computer_name* or process.args:*wmic*node*process call create*)",
  "risk_score": 50,
  "rule_id": "ced66221-3e07-40ee-8588-5f107e7d50d8",
  "severity": "low",
  "tags": ["Elastic"],
  "type": "query",
  "version": 1
}
