{
  "description": "Windows Persistence via Netshell Helper DLL",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Windows Persistence via Netshell Helper DLL",
  "query": "event.code:1 and process.name:netsh.exe and process.args:*helper*",
  "risk_score": 50,
  "rule_id": "d7c2561d-2758-46ad-b5a9-247efb9eea21",
  "severity": "low",
  "type": "query",
  "version": 1
}
