{
  "description": "Identifies the native Windows tools regsvr32.exe and regsvr64.exe making a network connection.  This may be indicative of an attacker bypassing whitelisting or running arbitrary scripts via a signed Microsoft binary.",
  "false_positives": [
    "Security testing may produce events like this. Activity of this kind performed by non-engineers and ordinary users is unusual."
  ],
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "max_signals": 100,
  "name": "Network Connection via Regsvr",
  "query": "(process.name:regsvr32.exe or process.name:regsvr64.exe) and event.action:\"Network connection detected (rule: NetworkConnect)\" and not destination.ip:169.254.169.254/32 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16",
  "risk_score": 21,
  "rule_id": "fb02b8d3-71ee-4af1-bacd-215d23f17efa",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1117",
          "name": "Regsvr32",
          "reference": "https://attack.mitre.org/techniques/T1117/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1117",
          "name": "Regsvr32",
          "reference": "https://attack.mitre.org/techniques/T1117/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
