{
  "description": "The same signature has triggered multiple times for a host.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Signatures::Count_Signature",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Signatures::Count_Signature\" or rule.name: \"Signatures::Count_Signature\")",
  "risk_score": 50,
  "rule_id": "a704589c-8ba9-4a3c-8e39-ab9360cade17",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
