{
  "description": "Indicates that a certificate’s NotValidBefore date is future dated.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice SSL::Certificate_Not_Valid_Yet",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SSL::Certificate_Not_Valid_Yet\" or rule.name: \"SSL::Certificate_Not_Valid_Yet\")",
  "risk_score": 50,
  "rule_id": "45586490-99f6-4e11-8228-2229d727a3b4",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
