{
  "description": "Zeek notice reporting a count of how often a notice occurred.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Notice::Tally",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Notice::Tally\" or rule.name: \"Notice::Tally\")",
  "risk_score": 50,
  "rule_id": "7581fd81-25e8-489e-bcf3-69db068b7a6c",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
