{
  "rule_id": "0031d83e-1fb4-4dd6-b938-97ae7044b051",
  "risk_score": 50,
  "description": "Limitations in BPF make shunting some connections with BPF impossible. This notice encompasses those various cases.",
  "immutable": true,
  "interval": "5m",
  "name": "Zeek Notice PacketFilter::Cannot_BPF_Shunt_Conn",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"PacketFilter::Cannot_BPF_Shunt_Conn\" or rule.name: \"PacketFilter::Cannot_BPF_Shunt_Conn\")",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
