{
  "description": "Generated if a login originates or responds with a host where the reverse hostname lookup resolves to a name matched by the SSH::interesting_hostnames regular expression.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice SSH::Interesting_Hostname_Login",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SSH::Interesting_Hostname_Login\" or rule.name: \"SSH::Interesting_Hostname_Login\")",
  "risk_score": 50,
  "rule_id": "6a7f2b0a-3f24-4d58-aa84-243f1f0556d9",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
