{
  "description": "Port scans detect that an attacking host appears to be scanning a single victim host on several ports.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Scan::Port_Scan",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Scan::Port_Scan\" or rule.name: \"Scan::Port_Scan\")",
  "risk_score": 50,
  "rule_id": "d09fbf7a-47a7-4130-8dd7-b386cca81a42",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
