{
  "description": "Indicates that a host performing SQL injection attacks was detected.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice HTTP::SQL_Injection_Attacker",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"HTTP::SQL_Injection_Attacker\" or rule.name: \"HTTP::SQL_Injection_Attacker\")",
  "risk_score": 50,
  "rule_id": "4ca9ef93-7e7e-40a4-8d71-9130204d86e6",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
