{
  "description": "Indicates that a server is using a potentially unsafe key.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice SSL::Weak_Key",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SSL::Weak_Key\" or rule.name: \"SSL::Weak_Key\")",
  "risk_score": 50,
  "rule_id": "e020f504-c0e5-4768-8e1f-1e2ec7bac961",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
