{
  "description": "Indicates we saw heartbeat requests with odd length. Probably an attack or scan.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Heartbleed::SSL_Heartbeat_Odd_Length",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Heartbleed::SSL_Heartbeat_Odd_Length\" or rule.name: \"Heartbleed::SSL_Heartbeat_Odd_Length\")",
  "risk_score": 50,
  "rule_id": "0c6e7be4-6cab-4ee1-ad51-7c1ffd0e9002",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
