{
  "description": "Generic notice type for notice-worthy signature matches.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Signatures::Sensitive_Signature",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Signatures::Sensitive_Signature\" or rule.name: \"Signatures::Sensitive_Signature\")",
  "risk_score": 50,
  "rule_id": "ac394dec-67e8-417f-bb06-ae0bd75556b0",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
