{
  "description": "This notice is generated if a packet filter cannot be compiled.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice PacketFilter::Compile_Failure",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"PacketFilter::Compile_Failure\" or rule.name: \"PacketFilter::Compile_Failure\")",
  "risk_score": 50,
  "rule_id": "335b2ddc-f806-46e8-8ffa-114d613aac92",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
