{
  "description": "Indicates that a host previously identified as a \"password guesser\" has now had a successful login attempt.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice SSH::Login_By_Password_Guesser",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SSH::Login_By_Password_Guesser\" or rule.name: \"SSH::Login_By_Password_Guesser\")",
  "risk_score": 50,
  "rule_id": "5600ad95-2244-43db-8a7d-77eea95f80db",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
