{
  "description": "Possible evasion; usually just chud.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Conn::Retransmission_Inconsistency",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Conn::Retransmission_Inconsistency\" or rule.name: \"Conn::Retransmission_Inconsistency\")",
  "risk_score": 50,
  "rule_id": "53719624-55f0-4541-8370-f27f6766fb9e",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
