{
  "description": "Indicates that a server is using a potentially unsafe version",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice SSL::Old_Version",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SSL::Old_Version\" or rule.name: \"SSL::Old_Version\")",
  "risk_score": 50,
  "rule_id": "260b680e-c3d6-4c03-90cd-03c86e9f8ec1",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
