{
  "description": "Generated when a notice takes too long to compile.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice PacketFilter::Too_Long_To_Compile_Filter",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"PacketFilter::Too_Long_To_Compile_Filter\" or rule.name: \"PacketFilter::Too_Long_To_Compile_Filter\")",
  "risk_score": 50,
  "rule_id": "71e93c42-7990-4233-a8a5-2631193df7db",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
