{
  "description": "Indicates that a certificate is going to expire within SSL::notify_when_cert_expiring_in.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice SSL::Certificate_Expires_Soon",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SSL::Certificate_Expires_Soon\" or rule.name: \"SSL::Certificate_Expires_Soon\")",
  "risk_score": 50,
  "rule_id": "e8207172-3478-4b2c-85b7-6f13d97fff43",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
