{
  "description": "Indicates packets were dropped by the packet filter.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice PacketFilter::Dropped_Packets",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"PacketFilter::Dropped_Packets\" or rule.name: \"PacketFilter::Dropped_Packets\")",
  "risk_score": 50,
  "rule_id": "4f212278-329b-4088-ae59-9091003dff22",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
