{
  "description": "Indicates a host bruteforcing FTP logins by watching for too many rejected usernames or failed passwords.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice FTP::Bruteforcing",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"FTP::Bruteforcing\" or rule.name: \"FTP::Bruteforcing\")",
  "risk_score": 50,
  "rule_id": "7e069475-817e-4e89-9245-1dfaa3083b11",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
