{
  "description": "Indicates that a host was seen running traceroutes.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Traceroute::Detected",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Traceroute::Detected\" or rule.name: \"Traceroute::Detected\")",
  "risk_score": 50,
  "rule_id": "aeefe077-f05d-44a7-b757-272fc51c334c",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
