{
  "description": "Indicates that a server is using a potentially unsafe cipher",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice SSL::Weak_Cipher",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SSL::Weak_Cipher\" or rule.name: \"SSL::Weak_Cipher\")",
  "risk_score": 50,
  "rule_id": "25886074-6ae1-41c0-8546-e8cf55ed1b4b",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
