{
  "description": "Indicates that an interesting software application changed versions on a host.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Software::Software_Version_Change",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Software::Software_Version_Change\" or rule.name: \"Software::Software_Version_Change\")",
  "risk_score": 50,
  "rule_id": "ea1d2c1b-ecfe-42a5-bd0b-56c7a1bd8075",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
