{
  "description": "This indicates that the OCSP response was not deemed to be valid.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice SSL::Invalid_Ocsp_Response",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SSL::Invalid_Ocsp_Response\" or rule.name: \"SSL::Invalid_Ocsp_Response\")",
  "risk_score": 50,
  "rule_id": "eb17fcbb-de22-4aa0-81aa-1c059bdd4f2b",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
