{
  "description": "Indicates that a successful response to a “SITE EXEC” command/arg pair was seen.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice FTP::Site_Exec_Success",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"FTP::Site_Exec_Success\" or rule.name: \"FTP::Site_Exec_Success\")",
  "risk_score": 50,
  "rule_id": "4b9cb3e9-e26a-4bd2-bd1f-8d451b49838f",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
