{
  "description": "This notice is generated when an intelligence indicator is denoted to be notice-worthy.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Intel::Notice",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Intel::Notice\" or rule.name: \"Intel::Notice\")",
  "risk_score": 50,
  "rule_id": "122e153a-78f3-4e7e-a5b5-cfe0b917f109",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
