{
  "rule_id": "e278142a-4ee7-4443-9b1f-421174b0dabf",
  "risk_score": 50,
  "description": "Indicates that a host has been identified as crossing the SSH::password_guesses_limit threshold with failed logins.",
  "immutable": true,
  "interval": "5m",
  "name": "Zeek Notice SSH::Password_Guessing",
  "severity": "low",
  "type": "query",
  "from": "now-6m",
  "to": "now",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SSH::Password_Guessing\" or rule.name: \"SSH::Password_Guessing\")",
  "language": "kuery",
  "filters": [],
  "enabled": false,
  "version": 1
}
