{
  "description": "Detected Zeek capture loss exceeds the percentage threshold",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice CaptureLoss::Too_Much_Loss",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"CaptureLoss::Too_Much_Loss\" or rule.name: \"CaptureLoss::Too_Much_Loss\")",
  "risk_score": 50,
  "rule_id": "c115a407-799b-45d6-962e-a639bb764c06",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
