{
  "description": "Generic unusual but notice-worthy weird activity.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice Weird::Activity",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"Weird::Activity\" or rule.name: \"Weird::Activity\")",
  "risk_score": 50,
  "rule_id": "d5ad39d0-8421-4f79-ad93-8ddbf7f553b3",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
