{
  "description": "SMTP message orignated from country or network configured to be suspicious.",
  "enabled": false,
  "filters": [],
  "from": "now-6m",
  "immutable": true,
  "interval": "5m",
  "language": "kuery",
  "name": "Zeek Notice SMTP::Suspicious_Origination",
  "query": "event.module: zeek and event.dataset: zeek.notice and (zeek.notice.note: \"SMTP::Suspicious_Origination\" or rule.name: \"SMTP::Suspicious_Origination\")",
  "risk_score": 50,
  "rule_id": "cc6e9fef-d936-4faf-8936-e576c089d8b2",
  "severity": "low",
  "to": "now",
  "type": "query",
  "version": 1
}
