{
  "type": "doc",
  "value": {
    "id": "fa7eb1546f44fd47d8868be8d74e0082e19f22df493c67a7725457978eb648ab",
    "index": ".siem-signals-default-000001",
    "source": {
      "@timestamp": "2020-09-02T18:56:19.134Z",
      "Endpoint": {
        "policy": {
          "applied": {
            "artifacts": {
              "global": {
                "identifiers": [
                  {
                    "name": "endpointpe-v4-blocklist",
                    "sha256": "6a546aade5563d3e8dffc1fe2d93d33edda8f9ca3e17ac3cc9ac707620cb9ecd"
                  },
                  {
                    "name": "endpointpe-v4-exceptionlist",
                    "sha256": "04f9f87accc5d5aea433427bd1bd4ec6908f8528c78ceed26f70df7875a99385"
                  },
                  {
                    "name": "endpointpe-v4-model",
                    "sha256": "1471838597fcd79a54ea4a3ec9a9beee1a86feaedab6c98e61102559ced822a8"
                  },
                  {
                    "name": "global-exceptionlist-windows",
                    "sha256": "824859b0c6749cc31951d92a73bbdddfcfe9f38abfe432087934d4dab9766ce8"
                  }
                ],
                "version": "1.0.0"
              }
            }
          }
        }
      },
      "agent": {
        "build": {
          "original": "version: 7.9.1-SNAPSHOT, compiled: Mon Aug 31 18:41:24 2020, branch: 7.9, commit: 89c14598cd3e3dd1e10baca5e060747227899f55"
        },
        "id": "1205f55d-84da-4391-b25d-a3d4bf40fca5",
        "type": "endpoint",
        "version": "7.9.1-SNAPSHOT"
      },
      "data_stream": {
        "dataset": "endpoint.alerts",
        "namespace": "default",
        "type": "logs"
      },
      "ecs": {
        "version": "1.5.0"
      },
      "elastic": {
        "agent": {
          "id": "00000000-0000-0000-0000-000000000000"
        }
      },
      "event": {
        "action": "execution",
        "category": [
          "malware",
          "intrusion_detection",
          "process"
        ],
        "code": "malicious_file",
        "created": "2020-09-02T18:55:14.36082300Z",
        "dataset": "endpoint.alerts",
        "id": "LozePn6RQExqqTxa++++++7d",
        "ingested": "2020-09-02T18:55:14.893264Z",
        "kind": "signal",
        "module": "endpoint",
        "outcome": [
          "success"
        ],
        "risk_score": 99,
        "sequence": 453,
        "severity": 99,
        "type": [
          "info",
          "start",
          "allowed"
        ]
      },
      "file": {
        "Ext": {
          "code_signature": {
            "exists": true,
            "status": "trusted",
            "subject_name": "Open Source Developer, Benjamin Delpy",
            "trusted": true
          },
          "malware_classification": {
            "identifier": "endpointpe-v4-model",
            "score": 0.998879849910736,
            "threshold": 0.71,
            "version": "0.0.0"
          },
          "temp_file_path": ""
        },
        "accessed": "2020-09-02T18:55:14.42330400Z",
        "created": "2020-07-28T22:18:49.12285900Z",
        "directory": "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64",
        "drive_letter": "C",
        "extension": "exe",
        "hash": {
          "md5": "106d289e9f28e3cff569a3d1ba97a908",
          "sha1": "4a45814547f237bbd96db61dec58c0e3fd5c7558",
          "sha256": "6e37a054bd7c49b233cace747951911f320bd43be8a79ce455b97403c2f7de2c"
        },
        "mtime": "2020-03-08T17:33:22.0Z",
        "name": "mimikatz.exe",
        "owner": "Jonathan Buttner",
        "path": "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64\\mimikatz.exe",
        "pe": {
          "company": "gentilkiwi (Benjamin DELPY)",
          "description": "mimikatz for Windows",
          "file_version": "2.2.0.0",
          "original_file_name": "mimikatz.exe",
          "product": "mimikatz"
        },
        "size": 1255176
      },
      "host": {
        "architecture": "x86_64",
        "hostname": "DESKTOP-EEFU8SV",
        "id": "dd7f78a2-fe76-920b-dd69-132b62462f77",
        "ip": [
          "172.16.104.147",
          "fe80::f997:f12b:e125:97c9",
          "169.254.171.216",
          "fe80::8d78:e89c:581a:abd8",
          "127.0.0.1",
          "::1"
        ],
        "mac": [
          "00:0c:29:08:a9:e2",
          "f0:18:98:7e:01:b0"
        ],
        "name": "DESKTOP-EEFU8SV",
        "os": {
          "Ext": {
            "variant": "Windows 10 Pro"
          },
          "family": "windows",
          "full": "Windows 10 Pro 1909 (10.0.18363.836)",
          "kernel": "1909 (10.0.18363.836)",
          "name": "Windows",
          "platform": "windows",
          "version": "1909 (10.0.18363.836)"
        }
      },
      "message": "Malware Detection Alert",
      "process": {
        "Ext": {
          "ancestry": [
            "MTIwNWY1NWQtODRkYS00MzkxLWIyNWQtYTNkNGJmNDBmY2E1LTE1ODAtMTMyNDA0NTczNjIuMTIxNTcyMDA=",
            "MTIwNWY1NWQtODRkYS00MzkxLWIyNWQtYTNkNGJmNDBmY2E1LTM0MTItMTMyMzk3NDk1MTMuNTUzNjY2MDA="
          ],
          "code_signature": {
            "exists": true,
            "status": "trusted",
            "subject_name": "Open Source Developer, Benjamin Delpy",
            "trusted": true
          },
          "token": {
            "domain": "DESKTOP-EEFU8SV",
            "elevation": false,
            "elevation_type": "",
            "integrity_level_name": "",
            "sid": "S-1-5-21-194603131-1656359200-2770306996-1000",
            "user": "Jonathan Buttner"
          },
          "user": "Jonathan Buttner"
        },
        "args": [
          "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64\\mimikatz.exe"
        ],
        "args_count": 1,
        "command_line": "\"C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64\\mimikatz.exe\" ",
        "entity_id": "MTIwNWY1NWQtODRkYS00MzkxLWIyNWQtYTNkNGJmNDBmY2E1LTc1NTItMTMyNDM1NDY1MTQuNjI0MjgxMDA=",
        "executable": "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64\\mimikatz.exe",
        "hash": {
          "md5": "106d289e9f28e3cff569a3d1ba97a908",
          "sha1": "4a45814547f237bbd96db61dec58c0e3fd5c7558",
          "sha256": "6e37a054bd7c49b233cace747951911f320bd43be8a79ce455b97403c2f7de2c"
        },
        "name": "mimikatz.exe",
        "parent": {
          "Ext": {
            "code_signature": {
              "exists": true,
              "status": "trusted",
              "subject_name": "Microsoft Windows",
              "trusted": true
            },
            "user": "Jonathan Buttner"
          },
          "args": [
            "C:\\Windows\\system32\\WindowsPowerShell\\v1.0\\PowerShell_ISE.exe"
          ],
          "args_count": 1,
          "command_line": "\"C:\\Windows\\system32\\WindowsPowerShell\\v1.0\\PowerShell_ISE.exe\" ",
          "entity_id": "MTIwNWY1NWQtODRkYS00MzkxLWIyNWQtYTNkNGJmNDBmY2E1LTE1ODAtMTMyNDA0NTczNjIuMTIxNTcyMDA=",
          "executable": "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell_ise.exe",
          "hash": {
            "md5": "30a2792a2428cd06cfec23ecb074889a",
            "sha1": "c7c8939c7780e8e68ac303e6b1abd69892ca39a0",
            "sha256": "6cbcd7e7544c5878c07382499440c4878b5da4c8b2c64bc9d81f1a2686330b0f"
          },
          "name": "powershell_ise.exe",
          "pid": 1580,
          "ppid": 3412,
          "start": 1595983762,
          "uptime": 3089152
        },
        "pe": {
          "company": "gentilkiwi (Benjamin DELPY)",
          "description": "mimikatz for Windows",
          "file_version": "2.2.0.0",
          "original_file_name": "mimikatz.exe",
          "product": "mimikatz"
        },
        "pid": 7552,
        "start": 132435465142624290,
        "uptime": 3352463993
      },
      "signal": {
        "ancestors": [
          {
            "depth": 1,
            "id": "yvMsUHQBMdcFYDllT5FS",
            "index": ".ds-logs-endpoint.alerts-default-000001",
            "rule": "7376c14b-d481-43b1-8b1f-41f818183d29",
            "type": "event"
          }
        ],
        "original_event": {
          "action": "execution",
          "category": [
            "malware",
            "intrusion_detection",
            "process"
          ],
          "code": "malicious_file",
          "created": "2020-09-02T18:55:14.36082300Z",
          "dataset": "endpoint.alerts",
          "id": "LozePn6RQExqqTxa++++++7d",
          "ingested": "2020-09-02T18:55:14.893264Z",
          "kind": "alert",
          "module": "endpoint",
          "outcome": [
            "success"
          ],
          "risk_score": 99,
          "sequence": 453,
          "severity": 99,
          "type": [
            "info",
            "start",
            "allowed"
          ]
        },
        "original_time": "2020-09-02T18:55:14.36082300Z",
        "parent": {
          "depth": 1,
          "id": "yvMsUHQBMdcFYDllT5FS",
          "index": ".ds-logs-endpoint.alerts-default-000001",
          "rule": "7376c14b-d481-43b1-8b1f-41f818183d29",
          "type": "event"
        },
        "rule": {
          "actions": [
          ],
          "author": [
          ],
          "created_at": "2020-09-02T18:54:17.631Z",
          "created_by": "elastic",
          "description": "endpoint alerts",
          "enabled": true,
          "exceptions_list": [
          ],
          "false_positives": [
          ],
          "filters": [
          ],
          "from": "now-180s",
          "id": "7376c14b-d481-43b1-8b1f-41f818183d29",
          "immutable": false,
          "index": [
            "apm-*-transaction*",
            "auditbeat-*",
            "endgame-*",
            "filebeat-*",
            "logs-*",
            "packetbeat-*",
            "winlogbeat-*"
          ],
          "interval": "2m",
          "language": "kuery",
          "license": "",
          "max_signals": 100,
          "meta": {
            "from": "1m",
            "kibana_siem_app_url": "http://localhost:5601/app/security"
          },
          "name": "Endpoint alerts",
          "output_index": ".siem-signals-default",
          "query": "event.kind:\"alert\" and agent.type:\"endpoint\"",
          "references": [
          ],
          "risk_score": 50,
          "risk_score_mapping": [
          ],
          "rule_id": "c54f0f3a-3fc9-4f60-b59b-3a7d8f0670f9",
          "severity": "low",
          "severity_mapping": [
          ],
          "tags": [
          ],
          "threat": [
          ],
          "to": "now",
          "type": "query",
          "updated_at": "2020-09-02T18:54:17.721Z",
          "updated_by": "elastic",
          "version": 1
        },
        "status": "open"
      }
    }
  }
}

{
  "type": "doc",
  "value": {
    "id": "no-entity-id-field",
    "index": ".siem-signals-default-000001",
    "source": {
      "@timestamp": "2020-09-02T18:56:19.134Z",
      "Endpoint": {
        "policy": {
          "applied": {
            "artifacts": {
              "global": {
                "identifiers": [
                  {
                    "name": "endpointpe-v4-blocklist",
                    "sha256": "6a546aade5563d3e8dffc1fe2d93d33edda8f9ca3e17ac3cc9ac707620cb9ecd"
                  },
                  {
                    "name": "endpointpe-v4-exceptionlist",
                    "sha256": "04f9f87accc5d5aea433427bd1bd4ec6908f8528c78ceed26f70df7875a99385"
                  },
                  {
                    "name": "endpointpe-v4-model",
                    "sha256": "1471838597fcd79a54ea4a3ec9a9beee1a86feaedab6c98e61102559ced822a8"
                  },
                  {
                    "name": "global-exceptionlist-windows",
                    "sha256": "824859b0c6749cc31951d92a73bbdddfcfe9f38abfe432087934d4dab9766ce8"
                  }
                ],
                "version": "1.0.0"
              }
            }
          }
        }
      },
      "agent": {
        "build": {
          "original": "version: 7.9.1-SNAPSHOT, compiled: Mon Aug 31 18:41:24 2020, branch: 7.9, commit: 89c14598cd3e3dd1e10baca5e060747227899f55"
        },
        "id": "1205f55d-84da-4391-b25d-a3d4bf40fca5",
        "type": "endpoint",
        "version": "7.9.1-SNAPSHOT"
      },
      "data_stream": {
        "dataset": "endpoint.alerts",
        "namespace": "default",
        "type": "logs"
      },
      "ecs": {
        "version": "1.5.0"
      },
      "elastic": {
        "agent": {
          "id": "00000000-0000-0000-0000-000000000000"
        }
      },
      "event": {
        "action": "execution",
        "category": [
          "malware",
          "intrusion_detection",
          "process"
        ],
        "code": "malicious_file",
        "created": "2020-09-02T18:55:14.36082300Z",
        "dataset": "endpoint.alerts",
        "id": "LozePn6RQExqqTxa++++++7d",
        "ingested": "2020-09-02T18:55:14.893264Z",
        "kind": "signal",
        "module": "endpoint",
        "outcome": [
          "success"
        ],
        "risk_score": 99,
        "sequence": 453,
        "severity": 99,
        "type": [
          "info",
          "start",
          "allowed"
        ]
      },
      "file": {
        "Ext": {
          "code_signature": {
            "exists": true,
            "status": "trusted",
            "subject_name": "Open Source Developer, Benjamin Delpy",
            "trusted": true
          },
          "malware_classification": {
            "identifier": "endpointpe-v4-model",
            "score": 0.998879849910736,
            "threshold": 0.71,
            "version": "0.0.0"
          },
          "temp_file_path": ""
        },
        "accessed": "2020-09-02T18:55:14.42330400Z",
        "created": "2020-07-28T22:18:49.12285900Z",
        "directory": "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64",
        "drive_letter": "C",
        "extension": "exe",
        "hash": {
          "md5": "106d289e9f28e3cff569a3d1ba97a908",
          "sha1": "4a45814547f237bbd96db61dec58c0e3fd5c7558",
          "sha256": "6e37a054bd7c49b233cace747951911f320bd43be8a79ce455b97403c2f7de2c"
        },
        "mtime": "2020-03-08T17:33:22.0Z",
        "name": "mimikatz.exe",
        "owner": "Jonathan Buttner",
        "path": "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64\\mimikatz.exe",
        "pe": {
          "company": "gentilkiwi (Benjamin DELPY)",
          "description": "mimikatz for Windows",
          "file_version": "2.2.0.0",
          "original_file_name": "mimikatz.exe",
          "product": "mimikatz"
        },
        "size": 1255176
      },
      "host": {
        "architecture": "x86_64",
        "hostname": "DESKTOP-EEFU8SV",
        "id": "dd7f78a2-fe76-920b-dd69-132b62462f77",
        "ip": [
          "172.16.104.147",
          "fe80::f997:f12b:e125:97c9",
          "169.254.171.216",
          "fe80::8d78:e89c:581a:abd8",
          "127.0.0.1",
          "::1"
        ],
        "mac": [
          "00:0c:29:08:a9:e2",
          "f0:18:98:7e:01:b0"
        ],
        "name": "DESKTOP-EEFU8SV",
        "os": {
          "Ext": {
            "variant": "Windows 10 Pro"
          },
          "family": "windows",
          "full": "Windows 10 Pro 1909 (10.0.18363.836)",
          "kernel": "1909 (10.0.18363.836)",
          "name": "Windows",
          "platform": "windows",
          "version": "1909 (10.0.18363.836)"
        }
      },
      "message": "Malware Detection Alert",
      "process": {
        "Ext": {
          "ancestry": [
            "MTIwNWY1NWQtODRkYS00MzkxLWIyNWQtYTNkNGJmNDBmY2E1LTE1ODAtMTMyNDA0NTczNjIuMTIxNTcyMDA=",
            "MTIwNWY1NWQtODRkYS00MzkxLWIyNWQtYTNkNGJmNDBmY2E1LTM0MTItMTMyMzk3NDk1MTMuNTUzNjY2MDA="
          ],
          "code_signature": {
            "exists": true,
            "status": "trusted",
            "subject_name": "Open Source Developer, Benjamin Delpy",
            "trusted": true
          },
          "token": {
            "domain": "DESKTOP-EEFU8SV",
            "elevation": false,
            "elevation_type": "",
            "integrity_level_name": "",
            "sid": "S-1-5-21-194603131-1656359200-2770306996-1000",
            "user": "Jonathan Buttner"
          },
          "user": "Jonathan Buttner"
        },
        "args": [
          "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64\\mimikatz.exe"
        ],
        "args_count": 1,
        "command_line": "\"C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64\\mimikatz.exe\" ",
        "executable": "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64\\mimikatz.exe",
        "hash": {
          "md5": "106d289e9f28e3cff569a3d1ba97a908",
          "sha1": "4a45814547f237bbd96db61dec58c0e3fd5c7558",
          "sha256": "6e37a054bd7c49b233cace747951911f320bd43be8a79ce455b97403c2f7de2c"
        },
        "name": "mimikatz.exe",
        "parent": {
          "Ext": {
            "code_signature": {
              "exists": true,
              "status": "trusted",
              "subject_name": "Microsoft Windows",
              "trusted": true
            },
            "user": "Jonathan Buttner"
          },
          "args": [
            "C:\\Windows\\system32\\WindowsPowerShell\\v1.0\\PowerShell_ISE.exe"
          ],
          "args_count": 1,
          "command_line": "\"C:\\Windows\\system32\\WindowsPowerShell\\v1.0\\PowerShell_ISE.exe\" ",
          "entity_id": "MTIwNWY1NWQtODRkYS00MzkxLWIyNWQtYTNkNGJmNDBmY2E1LTE1ODAtMTMyNDA0NTczNjIuMTIxNTcyMDA=",
          "executable": "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell_ise.exe",
          "hash": {
            "md5": "30a2792a2428cd06cfec23ecb074889a",
            "sha1": "c7c8939c7780e8e68ac303e6b1abd69892ca39a0",
            "sha256": "6cbcd7e7544c5878c07382499440c4878b5da4c8b2c64bc9d81f1a2686330b0f"
          },
          "name": "powershell_ise.exe",
          "pid": 1580,
          "ppid": 3412,
          "start": 1595983762,
          "uptime": 3089152
        },
        "pe": {
          "company": "gentilkiwi (Benjamin DELPY)",
          "description": "mimikatz for Windows",
          "file_version": "2.2.0.0",
          "original_file_name": "mimikatz.exe",
          "product": "mimikatz"
        },
        "pid": 7552,
        "start": 132435465142624290,
        "uptime": 3352463993
      },
      "signal": {
        "ancestors": [
          {
            "depth": 1,
            "id": "yvMsUHQBMdcFYDllT5FS",
            "index": ".ds-logs-endpoint.alerts-default-000001",
            "rule": "7376c14b-d481-43b1-8b1f-41f818183d29",
            "type": "event"
          }
        ],
        "original_event": {
          "action": "execution",
          "category": [
            "malware",
            "intrusion_detection",
            "process"
          ],
          "code": "malicious_file",
          "created": "2020-09-02T18:55:14.36082300Z",
          "dataset": "endpoint.alerts",
          "id": "LozePn6RQExqqTxa++++++7d",
          "ingested": "2020-09-02T18:55:14.893264Z",
          "kind": "alert",
          "module": "endpoint",
          "outcome": [
            "success"
          ],
          "risk_score": 99,
          "sequence": 453,
          "severity": 99,
          "type": [
            "info",
            "start",
            "allowed"
          ]
        },
        "original_time": "2020-09-02T18:55:14.36082300Z",
        "parent": {
          "depth": 1,
          "id": "yvMsUHQBMdcFYDllT5FS",
          "index": ".ds-logs-endpoint.alerts-default-000001",
          "rule": "7376c14b-d481-43b1-8b1f-41f818183d29",
          "type": "event"
        },
        "rule": {
          "actions": [
          ],
          "author": [
          ],
          "created_at": "2020-09-02T18:54:17.631Z",
          "created_by": "elastic",
          "description": "endpoint alerts",
          "enabled": true,
          "exceptions_list": [
          ],
          "false_positives": [
          ],
          "filters": [
          ],
          "from": "now-180s",
          "id": "7376c14b-d481-43b1-8b1f-41f818183d29",
          "immutable": false,
          "index": [
            "apm-*-transaction*",
            "auditbeat-*",
            "endgame-*",
            "filebeat-*",
            "logs-*",
            "packetbeat-*",
            "winlogbeat-*"
          ],
          "interval": "2m",
          "language": "kuery",
          "license": "",
          "max_signals": 100,
          "meta": {
            "from": "1m",
            "kibana_siem_app_url": "http://localhost:5601/app/security"
          },
          "name": "Endpoint alerts",
          "output_index": ".siem-signals-default",
          "query": "event.kind:\"alert\" and agent.type:\"endpoint\"",
          "references": [
          ],
          "risk_score": 50,
          "risk_score_mapping": [
          ],
          "rule_id": "c54f0f3a-3fc9-4f60-b59b-3a7d8f0670f9",
          "severity": "low",
          "severity_mapping": [
          ],
          "tags": [
          ],
          "threat": [
          ],
          "to": "now",
          "type": "query",
          "updated_at": "2020-09-02T18:54:17.721Z",
          "updated_by": "elastic",
          "version": 1
        },
        "status": "open"
      }
    }
  }
}

{
  "type": "doc",
  "value": {
    "id": "no-process-field",
    "index": ".siem-signals-default-000001",
    "source": {
      "@timestamp": "2020-09-02T18:56:19.134Z",
      "Endpoint": {
        "policy": {
          "applied": {
            "artifacts": {
              "global": {
                "identifiers": [
                  {
                    "name": "endpointpe-v4-blocklist",
                    "sha256": "6a546aade5563d3e8dffc1fe2d93d33edda8f9ca3e17ac3cc9ac707620cb9ecd"
                  },
                  {
                    "name": "endpointpe-v4-exceptionlist",
                    "sha256": "04f9f87accc5d5aea433427bd1bd4ec6908f8528c78ceed26f70df7875a99385"
                  },
                  {
                    "name": "endpointpe-v4-model",
                    "sha256": "1471838597fcd79a54ea4a3ec9a9beee1a86feaedab6c98e61102559ced822a8"
                  },
                  {
                    "name": "global-exceptionlist-windows",
                    "sha256": "824859b0c6749cc31951d92a73bbdddfcfe9f38abfe432087934d4dab9766ce8"
                  }
                ],
                "version": "1.0.0"
              }
            }
          }
        }
      },
      "agent": {
        "build": {
          "original": "version: 7.9.1-SNAPSHOT, compiled: Mon Aug 31 18:41:24 2020, branch: 7.9, commit: 89c14598cd3e3dd1e10baca5e060747227899f55"
        },
        "id": "1205f55d-84da-4391-b25d-a3d4bf40fca5",
        "type": "endpoint",
        "version": "7.9.1-SNAPSHOT"
      },
      "data_stream": {
        "dataset": "endpoint.alerts",
        "namespace": "default",
        "type": "logs"
      },
      "ecs": {
        "version": "1.5.0"
      },
      "elastic": {
        "agent": {
          "id": "00000000-0000-0000-0000-000000000000"
        }
      },
      "event": {
        "action": "execution",
        "category": [
          "malware",
          "intrusion_detection",
          "process"
        ],
        "code": "malicious_file",
        "created": "2020-09-02T18:55:14.36082300Z",
        "dataset": "endpoint.alerts",
        "id": "LozePn6RQExqqTxa++++++7d",
        "ingested": "2020-09-02T18:55:14.893264Z",
        "kind": "signal",
        "module": "endpoint",
        "outcome": [
          "success"
        ],
        "risk_score": 99,
        "sequence": 453,
        "severity": 99,
        "type": [
          "info",
          "start",
          "allowed"
        ]
      },
      "file": {
        "Ext": {
          "code_signature": {
            "exists": true,
            "status": "trusted",
            "subject_name": "Open Source Developer, Benjamin Delpy",
            "trusted": true
          },
          "malware_classification": {
            "identifier": "endpointpe-v4-model",
            "score": 0.998879849910736,
            "threshold": 0.71,
            "version": "0.0.0"
          },
          "temp_file_path": ""
        },
        "accessed": "2020-09-02T18:55:14.42330400Z",
        "created": "2020-07-28T22:18:49.12285900Z",
        "directory": "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64",
        "drive_letter": "C",
        "extension": "exe",
        "hash": {
          "md5": "106d289e9f28e3cff569a3d1ba97a908",
          "sha1": "4a45814547f237bbd96db61dec58c0e3fd5c7558",
          "sha256": "6e37a054bd7c49b233cace747951911f320bd43be8a79ce455b97403c2f7de2c"
        },
        "mtime": "2020-03-08T17:33:22.0Z",
        "name": "mimikatz.exe",
        "owner": "Jonathan Buttner",
        "path": "C:\\Users\\Jonathan Buttner\\Desktop\\mimikatz_trunk\\x64\\mimikatz.exe",
        "pe": {
          "company": "gentilkiwi (Benjamin DELPY)",
          "description": "mimikatz for Windows",
          "file_version": "2.2.0.0",
          "original_file_name": "mimikatz.exe",
          "product": "mimikatz"
        },
        "size": 1255176
      },
      "host": {
        "architecture": "x86_64",
        "hostname": "DESKTOP-EEFU8SV",
        "id": "dd7f78a2-fe76-920b-dd69-132b62462f77",
        "ip": [
          "172.16.104.147",
          "fe80::f997:f12b:e125:97c9",
          "169.254.171.216",
          "fe80::8d78:e89c:581a:abd8",
          "127.0.0.1",
          "::1"
        ],
        "mac": [
          "00:0c:29:08:a9:e2",
          "f0:18:98:7e:01:b0"
        ],
        "name": "DESKTOP-EEFU8SV",
        "os": {
          "Ext": {
            "variant": "Windows 10 Pro"
          },
          "family": "windows",
          "full": "Windows 10 Pro 1909 (10.0.18363.836)",
          "kernel": "1909 (10.0.18363.836)",
          "name": "Windows",
          "platform": "windows",
          "version": "1909 (10.0.18363.836)"
        }
      },
      "message": "Malware Detection Alert",
      "signal": {
        "ancestors": [
          {
            "depth": 1,
            "id": "yvMsUHQBMdcFYDllT5FS",
            "index": ".ds-logs-endpoint.alerts-default-000001",
            "rule": "7376c14b-d481-43b1-8b1f-41f818183d29",
            "type": "event"
          }
        ],
        "original_event": {
          "action": "execution",
          "category": [
            "malware",
            "intrusion_detection",
            "process"
          ],
          "code": "malicious_file",
          "created": "2020-09-02T18:55:14.36082300Z",
          "dataset": "endpoint.alerts",
          "id": "LozePn6RQExqqTxa++++++7d",
          "ingested": "2020-09-02T18:55:14.893264Z",
          "kind": "alert",
          "module": "endpoint",
          "outcome": [
            "success"
          ],
          "risk_score": 99,
          "sequence": 453,
          "severity": 99,
          "type": [
            "info",
            "start",
            "allowed"
          ]
        },
        "original_time": "2020-09-02T18:55:14.36082300Z",
        "parent": {
          "depth": 1,
          "id": "yvMsUHQBMdcFYDllT5FS",
          "index": ".ds-logs-endpoint.alerts-default-000001",
          "rule": "7376c14b-d481-43b1-8b1f-41f818183d29",
          "type": "event"
        },
        "rule": {
          "actions": [
          ],
          "author": [
          ],
          "created_at": "2020-09-02T18:54:17.631Z",
          "created_by": "elastic",
          "description": "endpoint alerts",
          "enabled": true,
          "exceptions_list": [
          ],
          "false_positives": [
          ],
          "filters": [
          ],
          "from": "now-180s",
          "id": "7376c14b-d481-43b1-8b1f-41f818183d29",
          "immutable": false,
          "index": [
            "apm-*-transaction*",
            "auditbeat-*",
            "endgame-*",
            "filebeat-*",
            "logs-*",
            "packetbeat-*",
            "winlogbeat-*"
          ],
          "interval": "2m",
          "language": "kuery",
          "license": "",
          "max_signals": 100,
          "meta": {
            "from": "1m",
            "kibana_siem_app_url": "http://localhost:5601/app/security"
          },
          "name": "Endpoint alerts",
          "output_index": ".siem-signals-default",
          "query": "event.kind:\"alert\" and agent.type:\"endpoint\"",
          "references": [
          ],
          "risk_score": 50,
          "risk_score_mapping": [
          ],
          "rule_id": "c54f0f3a-3fc9-4f60-b59b-3a7d8f0670f9",
          "severity": "low",
          "severity_mapping": [
          ],
          "tags": [
          ],
          "threat": [
          ],
          "to": "now",
          "type": "query",
          "updated_at": "2020-09-02T18:54:17.721Z",
          "updated_by": "elastic",
          "version": 1
        },
        "status": "open"
      }
    }
  }
}
