{
  "rule_id": "filters-with-empty-query",
  "risk_score": 7,
  "description": "Detecting root and admin users",
  "index": ["auditbeat-*", "filebeat-*", "packetbeat-*", "winlogbeat-*"],
  "interval": "5m",
  "name": "Detect Root/Admin Users",
  "severity": "high",
  "type": "query",
  "from": "now-24h",
  "to": "now",
  "language": "lucene",
  "query": "",
  "filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "alias": "custom label here",
        "disabled": false,
        "key": "host.name",
        "negate": false,
        "params": {
          "query": "siem-windows"
        },
        "type": "phrase"
      },
      "query": {
        "match_phrase": {
          "host.name": "siem-windows"
        }
      }
    },
    {
      "exists": {
        "field": "host.hostname"
      },
      "meta": {
        "type": "exists",
        "disabled": false,
        "negate": false,
        "alias": "has a hostname",
        "key": "host.hostname",
        "value": "exists"
      },
      "$state": {
        "store": "appState"
      }
    }
  ]
}
