{
  "description": "Identifies use of bcdedit.exe to delete boot configuration data. This tactic is sometimes used as by malware or an attacker as a destructive technique.",
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Modification of Boot Configuration",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\" and process.name:bcdedit.exe and process.args:(/set and (bootstatuspolicy and ignoreallfailures or no and recoveryenabled))",
  "risk_score": 21,
  "rule_id": "69c251fb-a5d6-4035-b5ec-40438bd829ff",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1107",
          "name": "File Deletion",
          "reference": "https://attack.mitre.org/techniques/T1107/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
