{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Iodine is a tool for tunneling Internet protocol version 4 (IPV4) traffic over the DNS protocol to circumvent firewalls, network security groups, and network access lists while evading detection.",
    "false_positives": [
      "Normal use of Iodine is uncommon apart from security testing and research. Use by non-security engineers is very uncommon."
    ],
    "from": "now-9m",
    "index": [
      "auditbeat-*",
      "logs-endpoint.events.*",
      "endgame-*"
    ],
    "language": "kuery",
    "license": "Elastic License v2",
    "name": "Potential DNS Tunneling via Iodine",
    "query": "event.category:process and host.os.type:linux and event.type:(start or process_started) and process.name:(iodine or iodined)\n",
    "references": [
      "https://code.kryo.se/iodine/"
    ],
    "related_integrations": [
      {
        "package": "endpoint",
        "version": "^8.2.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.category",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "event.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "host.os.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.name",
        "type": "keyword"
      }
    ],
    "risk_score": 73,
    "rule_id": "041d4d41-9589-43e2-ba13-5680af75ebc2",
    "severity": "high",
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Command and Control",
      "Data Source: Elastic Endgame"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0011",
          "name": "Command and Control",
          "reference": "https://attack.mitre.org/tactics/TA0011/"
        },
        "technique": [
          {
            "id": "T1572",
            "name": "Protocol Tunneling",
            "reference": "https://attack.mitre.org/techniques/T1572/"
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "query",
    "version": 104
  },
  "id": "041d4d41-9589-43e2-ba13-5680af75ebc2_104",
  "type": "security-rule"
}