{
  "attributes": {
    "author": [
      "Thijs Xhaflaire"
    ],
    "description": "Identifies users being added to the admin group. This could be an indication of privilege escalation activity.",
    "from": "now-9m",
    "index": [
      "logs-jamf_protect*"
    ],
    "language": "eql",
    "license": "Elastic License v2",
    "name": "User Added to the Admin Group",
    "note": "## Triage and analysis\n\nTo thoroughly investigate the actions that occurred **after a user was elevated to administrator**, it's essential to conduct a search on the Timeline. This allows you to review and understand the sequence of events that followed the elevation, helping to identify any potentially malicious or unauthorized activities that might have taken place. **Analyzing these actions is crucial for maintaining security and ensuring that the elevation was not exploited for harmful purposes.**\n\n> **Note**:\n> This investigation guide uses the [Investigate Markdown Plugin](https://www.elastic.co/guide/en/security/master/interactive-investigation-guides.html) introduced in Elastic Stack version 8.8.0. Older Elastic Stack versions will display unrendered Markdown in this guide.\n\n**Consider reviewing these actions:**\n\n- Have persistency items been added?\n- Is any software installed after elevation?\n- Were any additional users created after elevation?\n\n!{investigate{\"label\":\"Show events after Privilege Escalation\",\"providers\":[[{\"excluded\":false,\"field\":\"host.hostname\",\"queryType\":\"phrase\",\"value\":\"{{host.hostname}}\",\"valueType\":\"string\"}]],\"relativeFrom\":\"now\",\"relativeTo\":\"now+30m\"}}\n!{investigate{\"label\":\"Show events having the same reponsible process\",\"providers\":[[{\"excluded\":false,\"field\":\"host.hostname\",\"queryType\":\"phrase\",\"value\":\"{{host.hostname}}\",\"valueType\":\"string\"},{\"excluded\":false,\"field\":\"process.entity_id\",\"queryType\":\"phrase\",\"value\":\"{{process.group_leader.entity_id}}\",\"valueType\":\"string\"}]]}}\n!{investigate{\"label\":\"Show events having the same parent process\",\"providers\":[[{\"excluded\":false,\"field\":\"host.hostname\",\"queryType\":\"phrase\",\"value\":\"{{host.hostname}}\",\"valueType\":\"string\"},{\"excluded\":false,\"field\":\"process.entity_id\",\"queryType\":\"phrase\",\"value\":\"{{process.parent.entity_id}}\",\"valueType\":\"string\"}]]}}\n",
    "query": "configuration where host.os.type == \"macos\" and event.type == \"change\" and\n  event.action == \"od_group_add\" and group.name:\"admin\"\n",
    "references": [
      "https://www.loobins.io/binaries/dscl/",
      "https://managingosx.wordpress.com/2010/01/14/add-a-user-to-the-admin-group-via-command-line-3-0/"
    ],
    "related_integrations": [
      {
        "package": "jamf_protect",
        "version": "^2.0.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.action",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "event.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "group.name",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "host.os.type",
        "type": "keyword"
      }
    ],
    "risk_score": 21,
    "rule_id": "04e65517-16e9-4fc4-b7f1-94dc21ecea0d",
    "setup": "## Setup\n\nThis rule requires data coming in from Jamf Protect.\n\n### Jamf Protect Integration Setup\nJamf Protect is integrated into the Elastic Agent using Fleet. Upon configuration, the integration allows the Elastic Agent to monitor events incoming events and send data to the Elastic.\n\n#### Prerequisite Requirements:\n- Fleet is required for Jamf Protect.\n- To configure Fleet Server refer to the [documentation](https://www.elastic.co/guide/en/fleet/current/fleet-server.html).\n\n#### The following steps should be executed in order to add the Jamf Protect integration:\n- Go to the Kibana home page and click \"Add integrations\".\n- In the query bar, search for \"Jamf Protect\" and select the integration to see more details about it.\n- Click \"Add Jamf Protect\".\n- Configure the integration name.\n- Click \"Save and Continue\".\n",
    "severity": "low",
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Privilege Escalation",
      "Data Source: Jamf Protect"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "reference": "https://attack.mitre.org/tactics/TA0004/"
        },
        "technique": [
          {
            "id": "T1078",
            "name": "Valid Accounts",
            "reference": "https://attack.mitre.org/techniques/T1078/",
            "subtechnique": [
              {
                "id": "T1078.003",
                "name": "Local Accounts",
                "reference": "https://attack.mitre.org/techniques/T1078/003/"
              }
            ]
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "eql",
    "version": 1
  },
  "id": "04e65517-16e9-4fc4-b7f1-94dc21ecea0d_1",
  "type": "security-rule"
}