{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Identifies the access or file open of web browser sensitive files by an untrusted/unsigned process or osascript. Adversaries may acquire credentials from web browsers by reading files specific to the target browser.",
    "from": "now-9m",
    "index": [
      "logs-endpoint.events.file.*"
    ],
    "language": "eql",
    "license": "Elastic License v2",
    "name": "Suspicious Web Browser Sensitive File Access",
    "query": "file where event.action == \"open\" and process.executable != null and \n file.name : (\"cookies.sqlite\", \n              \"key?.db\", \n              \"logins.json\", \n              \"Cookies\", \n              \"Cookies.binarycookies\", \n              \"Login Data\") and \n ((process.code_signature.trusted == false or process.code_signature.exists == false) or process.name : \"osascript\") and \n not process.code_signature.signing_id : \"org.mozilla.firefox\" and\n not process.Ext.effective_parent.executable : \"/Library/Elastic/Endpoint/elastic-endpoint.app/Contents/MacOS/elastic-endpoint\"\n",
    "references": [
      "https://securelist.com/calisto-trojan-for-macos/86543/"
    ],
    "related_integrations": [
      {
        "package": "endpoint",
        "version": "^8.2.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.action",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "file.name",
        "type": "keyword"
      },
      {
        "ecs": false,
        "name": "process.Ext.effective_parent.executable",
        "type": "unknown"
      },
      {
        "ecs": true,
        "name": "process.code_signature.exists",
        "type": "boolean"
      },
      {
        "ecs": true,
        "name": "process.code_signature.signing_id",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.code_signature.trusted",
        "type": "boolean"
      },
      {
        "ecs": true,
        "name": "process.executable",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.name",
        "type": "keyword"
      }
    ],
    "risk_score": 73,
    "rule_id": "20457e4f-d1de-4b92-ae69-142e27a4342a",
    "setup": "## Setup\n\nThis rule requires data coming in from Elastic Defend.\n\n### Elastic Defend Integration Setup\nElastic Defend is integrated into the Elastic Agent using Fleet. Upon configuration, the integration allows the Elastic Agent to monitor events on your host and send data to the Elastic Security app.\n\n#### Prerequisite Requirements:\n- Fleet is required for Elastic Defend.\n- To configure Fleet Server refer to the [documentation](https://www.elastic.co/guide/en/fleet/current/fleet-server.html).\n\n#### The following steps should be executed in order to add the Elastic Defend integration on a macOS System:\n- Go to the Kibana home page and click \"Add integrations\".\n- In the query bar, search for \"Elastic Defend\" and select the integration to see more details about it.\n- Click \"Add Elastic Defend\".\n- Configure the integration name and optionally add a description.\n- Select the type of environment you want to protect, for MacOS it is recommended to select \"Traditional Endpoints\".\n- Select a configuration preset. Each preset comes with different default settings for Elastic Agent, you can further customize these later by configuring the Elastic Defend integration policy. [Helper guide](https://www.elastic.co/guide/en/security/current/configure-endpoint-integration-policy.html).\n- We suggest selecting \"Complete EDR (Endpoint Detection and Response)\" as a configuration setting, that provides \"All events; all preventions\"\n- Enter a name for the agent policy in \"New agent policy name\". If other agent policies already exist, you can click the \"Existing hosts\" tab and select an existing policy instead.\nFor more details on Elastic Agent configuration settings, refer to the [helper guide](https://www.elastic.co/guide/en/fleet/current/agent-policy.html).\n- Click \"Save and Continue\".\n- To complete the integration, select \"Add Elastic Agent to your hosts\" and continue to the next section to install the Elastic Agent on your hosts.\nFor more details on Elastic Defend refer to the [helper guide](https://www.elastic.co/guide/en/security/current/install-endpoint.html).\n",
    "severity": "high",
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Elastic Defend"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0006",
          "name": "Credential Access",
          "reference": "https://attack.mitre.org/tactics/TA0006/"
        },
        "technique": [
          {
            "id": "T1539",
            "name": "Steal Web Session Cookie",
            "reference": "https://attack.mitre.org/techniques/T1539/"
          },
          {
            "id": "T1555",
            "name": "Credentials from Password Stores",
            "reference": "https://attack.mitre.org/techniques/T1555/",
            "subtechnique": [
              {
                "id": "T1555.003",
                "name": "Credentials from Web Browsers",
                "reference": "https://attack.mitre.org/techniques/T1555/003/"
              }
            ]
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "eql",
    "version": 207
  },
  "id": "20457e4f-d1de-4b92-ae69-142e27a4342a_207",
  "type": "security-rule"
}