{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Identifies potential brute-force attempts against Microsoft 365 user accounts by detecting a high number of failed interactive or non-interactive login attempts within a 30-minute window. Attackers may attempt to brute force user accounts to gain unauthorized access to Microsoft 365 services via different services such as Exchange, SharePoint, or Teams.",
    "false_positives": [
      "Automated processes that attempt to authenticate using expired credentials or have misconfigured authentication settings may lead to false positives."
    ],
    "from": "now-60m",
    "interval": "10m",
    "language": "esql",
    "license": "Elastic License v2",
    "name": "Azure Entra Sign-in Brute Force against Microsoft 365 Accounts",
    "note": "This rule relies on Azure Entra ID sign-in logs, but filters for Microsoft 365 resources.",
    "query": "from logs-azure.signinlogs*\n// truncate the timestamp to a 30-minute window\n| eval target_time_window = DATE_TRUNC(30 minutes, @timestamp)\n| WHERE\n  event.dataset == \"azure.signinlogs\"\n  and event.category == \"authentication\"\n  and to_lower(azure.signinlogs.properties.resource_display_name) rlike \"(.*)365(.*)\"\n  and azure.signinlogs.category in (\"NonInteractiveUserSignInLogs\", \"SignInLogs\")\n  and event.outcome != \"success\"\n  // for tuning review azure.signinlogs.properties.status.error_code\n  // https://learn.microsoft.com/en-us/entra/identity-platform/reference-error-codes\n// count the number of login sources and failed login attempts\n| stats\n  login_source_count = count(source.ip),\n  failed_login_count = count(*) by target_time_window, azure.signinlogs.properties.user_principal_name\n\n// filter for users with more than 20 login sources or failed login attempts\n| where (login_source_count >= 20 or failed_login_count >= 20)\n",
    "references": [
      "https://cloud.hacktricks.xyz/pentesting-cloud/azure-security/az-unauthenticated-enum-and-initial-entry/az-password-spraying",
      "https://github.com/0xZDH/o365spray"
    ],
    "risk_score": 47,
    "rule_id": "35ab3cfa-6c67-11ef-ab4d-f661ea17fbcc",
    "severity": "medium",
    "tags": [
      "Domain: Cloud",
      "Domain: SaaS",
      "Data Source: Azure",
      "Data Source: Entra ID",
      "Data Source: Entra ID Sign-in",
      "Use Case: Identity and Access Audit",
      "Use Case: Threat Detection",
      "Tactic: Credential Access"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0006",
          "name": "Credential Access",
          "reference": "https://attack.mitre.org/tactics/TA0006/"
        },
        "technique": [
          {
            "id": "T1110",
            "name": "Brute Force",
            "reference": "https://attack.mitre.org/techniques/T1110/"
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "esql",
    "version": 1
  },
  "id": "35ab3cfa-6c67-11ef-ab4d-f661ea17fbcc_1",
  "type": "security-rule"
}