{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "This rule is triggered when CVEs collected from the Rapid7 Threat Command Integration have a match against vulnerabilities that were found in the customer environment.",
    "filters": [
      {
        "$state": {
          "store": "appState"
        },
        "meta": {
          "disabled": false,
          "key": "rapid7.tc.vulnerability.id",
          "negate": true,
          "type": "exists"
        },
        "query": {
          "exists": {
            "field": "rapid7.tc.vulnerability.id"
          }
        }
      }
    ],
    "from": "now-35m",
    "index": [
      "auditbeat-*",
      "endgame-*",
      "filebeat-*",
      "logs-*",
      "packetbeat-*",
      "winlogbeat-*"
    ],
    "interval": "30m",
    "language": "kuery",
    "license": "Elastic License v2",
    "max_signals": 10000,
    "name": "Rapid7 Threat Command CVEs Correlation",
    "note": "## Triage and Analysis\n\n### Investigating Rapid7 Threat Command CVEs Correlation\n\nRapid7 Threat Command CVEs Correlation rule allows matching CVEs from user indices within the vulnerabilities collected from Rapid7 Threat Command integrations.\n\nThe matches will be based on the latest values of CVEs from the last 180 days. So it's essential to validate the data and review the results by investigating the associated activity to determine if it requires further investigation.\n\nIf a vulnerability matches a local observation, the following enriched fields will be generated to identify the vulnerability, field, and type matched.\n\n- `threat.indicator.matched.atomic` - this identifies the atomic vulnerability that matched the local observation\n- `threat.indicator.matched.field` - this identifies the vulnerability field that matched the local observation\n- `threat.indicator.matched.type` - this identifies the vulnerability type that matched the local observation\n\nAdditional investigation can be done by reviewing the source of the activity and considering the history of the vulnerability that was matched. This can help understand if the activity is related to legitimate behavior.\n\n- Investigation can be validated and reviewed based on the data that was matched and by viewing the source of that activity.\n- Consider the history of the vulnerability that was matched. Has it happened before? Is it happening on multiple machines? These kinds of questions can help understand if the activity is related to legitimate behavior.\n- Consider the user and their role within the company: is this something related to their job or work function?\n",
    "query": "vulnerability.id : *\n",
    "references": [
      "https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-threatintel.html",
      "https://docs.elastic.co/integrations/ti_rapid7_threat_command"
    ],
    "related_integrations": [
      {
        "package": "ti_rapid7_threat_command",
        "version": "^1.0.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "vulnerability.id",
        "type": "keyword"
      }
    ],
    "risk_score": 99,
    "rule_id": "3a657da0-1df2-11ef-a327-f661ea17fbcc",
    "setup": "\n## Setup\n\nThis rule needs threat intelligence indicators to work.\nThreat intelligence indicators can be collected using an [Elastic Agent integration](https://www.elastic.co/guide/en/security/current/es-threat-intel-integrations.html#agent-ti-integration),\nthe [Threat Intel module](https://www.elastic.co/guide/en/security/current/es-threat-intel-integrations.html#ti-mod-integration),\nor a [custom integration](https://www.elastic.co/guide/en/security/current/es-threat-intel-integrations.html#custom-ti-integration).\n\nMore information can be found [here](https://www.elastic.co/guide/en/security/current/es-threat-intel-integrations.html).\n\n## Max Signals\n\nThis rule is configured to generate more **Max alerts per run** than the default 1000 alerts per run set for all rules. This is to ensure that it captures as many alerts as possible.\n\n**IMPORTANT:** The rule's **Max alerts per run** setting can be superseded by the `xpack.alerting.rules.run.alerts.max` Kibana config setting, which determines the maximum alerts generated by _any_ rule in the Kibana alerting framework. For example, if `xpack.alerting.rules.run.alerts.max` is set to 1000, this rule will still generate no more than 1000 alerts even if its own **Max alerts per run** is set higher.\n\nTo make sure this rule can generate as many alerts as it's configured in its own **Max alerts per run** setting, increase the `xpack.alerting.rules.run.alerts.max` system setting accordingly.\n\n**NOTE:** Changing `xpack.alerting.rules.run.alerts.max` is not possible in Serverless projects.\n",
    "severity": "critical",
    "tags": [
      "OS: Windows",
      "Data Source: Elastic Endgame",
      "Data Source: Windows",
      "Data Source: Network",
      "Data Source: Rapid7 Threat Command",
      "Rule Type: Threat Match",
      "Resources: Investigation Guide",
      "Use Case: Vulnerability",
      "Use Case: Asset Visibility",
      "Use Case: Continuous Monitoring"
    ],
    "threat_index": [
      "logs-ti_rapid7_threat_command_latest.vulnerability"
    ],
    "threat_indicator_path": "rapid7.tc.vulnerability",
    "threat_language": "kuery",
    "threat_mapping": [
      {
        "entries": [
          {
            "field": "vulnerability.id",
            "type": "mapping",
            "value": "vulnerability.id"
          }
        ]
      }
    ],
    "threat_query": "@timestamp >= \"now-30d/d\" and vulnerability.id : * and event.module: ti_rapid7_threat_command",
    "timestamp_override": "event.ingested",
    "type": "threat_match",
    "version": 3
  },
  "id": "3a657da0-1df2-11ef-a327-f661ea17fbcc",
  "type": "security-rule"
}