{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Identifies PowerShell scripts that can access and decrypt Veeam credentials stored in MSSQL databases. Attackers can use Veeam Credentials to target backups as part of destructive operations such as Ransomware attacks.",
    "from": "now-9m",
    "index": [
      "winlogbeat-*",
      "logs-windows.powershell*"
    ],
    "language": "kuery",
    "license": "Elastic License v2",
    "name": "PowerShell Script with Veeam Credential Access Capabilities",
    "query": "event.category:process and host.os.type:windows and\n  powershell.file.script_block_text : (\n    (\n      \"[dbo].[Credentials]\" and\n      (\"Veeam\" or \"VeeamBackup\")\n    ) or\n    \"ProtectedStorage]::GetLocalString\"\n  )\n",
    "references": [
      "https://forums.veeam.com/veeam-backup-replication-f2/recover-esxi-password-in-veeam-t34630.html",
      "https://www.crowdstrike.com/blog/anatomy-of-alpha-spider-ransomware/"
    ],
    "related_integrations": [
      {
        "package": "windows",
        "version": "^1.5.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.category",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "host.os.type",
        "type": "keyword"
      },
      {
        "ecs": false,
        "name": "powershell.file.script_block_text",
        "type": "unknown"
      }
    ],
    "risk_score": 47,
    "rule_id": "5c602cba-ae00-4488-845d-24de2b6d8055",
    "setup": "## Setup\n\nThe 'PowerShell Script Block Logging' logging policy must be enabled.\nSteps to implement the logging policy with Advanced Audit Configuration:\n\n```\nComputer Configuration >\nAdministrative Templates >\nWindows PowerShell >\nTurn on PowerShell Script Block Logging (Enable)\n```\n\nSteps to implement the logging policy via registry:\n\n```\nreg add \"hklm\\SOFTWARE\\Policies\\Microsoft\\Windows\\PowerShell\\ScriptBlockLogging\" /v EnableScriptBlockLogging /t REG_DWORD /d 1\n```\n",
    "severity": "medium",
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: PowerShell Logs"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0006",
          "name": "Credential Access",
          "reference": "https://attack.mitre.org/tactics/TA0006/"
        },
        "technique": [
          {
            "id": "T1003",
            "name": "OS Credential Dumping",
            "reference": "https://attack.mitre.org/techniques/T1003/"
          },
          {
            "id": "T1555",
            "name": "Credentials from Password Stores",
            "reference": "https://attack.mitre.org/techniques/T1555/"
          }
        ]
      },
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0002",
          "name": "Execution",
          "reference": "https://attack.mitre.org/tactics/TA0002/"
        },
        "technique": [
          {
            "id": "T1059",
            "name": "Command and Scripting Interpreter",
            "reference": "https://attack.mitre.org/techniques/T1059/",
            "subtechnique": [
              {
                "id": "T1059.001",
                "name": "PowerShell",
                "reference": "https://attack.mitre.org/techniques/T1059/001/"
              }
            ]
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "query",
    "version": 3
  },
  "id": "5c602cba-ae00-4488-845d-24de2b6d8055_3",
  "type": "security-rule"
}