{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "This rule detects child processes spawned by Git hooks. Git hooks are scripts that Git executes before or after events such as commit, push, and receive. The rule identifies child processes spawned by Git hooks that are not typically spawned by the Git process itself. This behavior may indicate an attacker attempting to hide malicious activity by leveraging the legitimate Git process to execute unauthorized commands.",
    "from": "now-9m",
    "index": [
      "logs-endpoint.events.process*"
    ],
    "language": "eql",
    "license": "Elastic License v2",
    "name": "Git Hook Child Process",
    "query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and process.parent.name in (\n  \"applypatch-msg\", \"commit-msg\", \"fsmonitor-watchman\", \"post-update\", \"post-checkout\", \"post-commit\",\n  \"pre-applypatch\", \"pre-commit\", \"pre-merge-commit\", \"prepare-commit-msg\", \"pre-push\", \"pre-rebase\", \"pre-receive\",\n  \"push-to-checkout\", \"update\", \"post-receive\", \"pre-auto-gc\", \"post-rewrite\", \"sendemail-validate\", \"p4-pre-submit\",\n  \"post-index-change\", \"post-merge\", \"post-applypatch\"\n) and (\n  process.name in (\"nohup\", \"setsid\", \"disown\", \"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\") or \n  process.name : (\"php*\", \"perl*\", \"ruby*\", \"lua*\") or \n  process.executable : (\n    \"/boot/*\", \"/dev/shm/*\", \"/etc/cron.*/*\", \"/etc/init.d/*\", \"/etc/update-motd.d/*\",\n    \"/run/*\", \"/srv/*\", \"/tmp/*\", \"/var/tmp/*\", \"/var/log/*\"\n  )\n) and not process.name in (\"git\", \"dirname\")\n",
    "references": [
      "https://git-scm.com/docs/githooks/2.26.0",
      "https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms"
    ],
    "related_integrations": [
      {
        "package": "endpoint",
        "version": "^8.2.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.action",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "event.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "host.os.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.executable",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.name",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.parent.name",
        "type": "keyword"
      }
    ],
    "risk_score": 21,
    "rule_id": "7ce5e1c7-6a49-45e6-a101-0720d185667f",
    "setup": "## Setup\n\nThis rule requires data coming in from Elastic Defend.\n\n### Elastic Defend Integration Setup\nElastic Defend is integrated into the Elastic Agent using Fleet. Upon configuration, the integration allows the Elastic Agent to monitor events on your host and send data to the Elastic Security app.\n\n#### Prerequisite Requirements:\n- Fleet is required for Elastic Defend.\n- To configure Fleet Server refer to the [documentation](https://www.elastic.co/guide/en/fleet/current/fleet-server.html).\n\n#### The following steps should be executed in order to add the Elastic Defend integration on a Linux System:\n- Go to the Kibana home page and click \"Add integrations\".\n- In the query bar, search for \"Elastic Defend\" and select the integration to see more details about it.\n- Click \"Add Elastic Defend\".\n- Configure the integration name and optionally add a description.\n- Select the type of environment you want to protect, either \"Traditional Endpoints\" or \"Cloud Workloads\".\n- Select a configuration preset. Each preset comes with different default settings for Elastic Agent, you can further customize these later by configuring the Elastic Defend integration policy. [Helper guide](https://www.elastic.co/guide/en/security/current/configure-endpoint-integration-policy.html).\n- We suggest selecting \"Complete EDR (Endpoint Detection and Response)\" as a configuration setting, that provides \"All events; all preventions\"\n- Enter a name for the agent policy in \"New agent policy name\". If other agent policies already exist, you can click the \"Existing hosts\" tab and select an existing policy instead.\nFor more details on Elastic Agent configuration settings, refer to the [helper guide](https://www.elastic.co/guide/en/fleet/8.10/agent-policy.html).\n- Click \"Save and Continue\".\n- To complete the integration, select \"Add Elastic Agent to your hosts\" and continue to the next section to install the Elastic Agent on your hosts.\nFor more details on Elastic Defend refer to the [helper guide](https://www.elastic.co/guide/en/security/current/install-endpoint.html).\n",
    "severity": "low",
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Tactic: Execution",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0003",
          "name": "Persistence",
          "reference": "https://attack.mitre.org/tactics/TA0003/"
        },
        "technique": [
          {
            "id": "T1543",
            "name": "Create or Modify System Process",
            "reference": "https://attack.mitre.org/techniques/T1543/"
          },
          {
            "id": "T1574",
            "name": "Hijack Execution Flow",
            "reference": "https://attack.mitre.org/techniques/T1574/"
          }
        ]
      },
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0002",
          "name": "Execution",
          "reference": "https://attack.mitre.org/tactics/TA0002/"
        },
        "technique": [
          {
            "id": "T1059",
            "name": "Command and Scripting Interpreter",
            "reference": "https://attack.mitre.org/techniques/T1059/",
            "subtechnique": [
              {
                "id": "T1059.004",
                "name": "Unix Shell",
                "reference": "https://attack.mitre.org/techniques/T1059/004/"
              }
            ]
          }
        ]
      },
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0005",
          "name": "Defense Evasion",
          "reference": "https://attack.mitre.org/tactics/TA0005/"
        },
        "technique": []
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "eql",
    "version": 2
  },
  "id": "7ce5e1c7-6a49-45e6-a101-0720d185667f_2",
  "type": "security-rule"
}