{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Identifies the creation, change, or deletion of a DLL module within a Windows SxS local folder. Adversaries may abuse shared modules to execute malicious payloads by instructing the Windows module loader to load DLLs from arbitrary local paths.",
    "from": "now-9m",
    "index": [
      "winlogbeat-*",
      "logs-endpoint.events.file-*",
      "logs-windows.sysmon_operational-*",
      "endgame-*",
      "logs-m365_defender.event-*",
      "logs-sentinel_one_cloud_funnel.*"
    ],
    "language": "eql",
    "license": "Elastic License v2",
    "name": "Execution via local SxS Shared Module",
    "note": "## Triage and analysis\n\nThe SxS DotLocal folder is a legitimate feature that can be abused to hijack standard modules loading order by forcing an executable on the same application.exe.local folder to load a malicious DLL module from the same directory.\n",
    "query": "file where host.os.type == \"windows\" and file.extension : \"dll\" and file.path : \"C:\\\\*\\\\*.exe.local\\\\*.dll\"\n",
    "references": [
      "https://docs.microsoft.com/en-us/windows/win32/dlls/dynamic-link-library-redirection"
    ],
    "related_integrations": [
      {
        "package": "endpoint",
        "version": "^8.2.0"
      },
      {
        "package": "windows",
        "version": "^1.5.0"
      },
      {
        "package": "m365_defender",
        "version": "^2.0.0"
      },
      {
        "package": "sentinel_one_cloud_funnel",
        "version": "^1.0.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "file.extension",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "file.path",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "host.os.type",
        "type": "keyword"
      }
    ],
    "risk_score": 47,
    "rule_id": "a3ea12f3-0d4e-4667-8b44-4230c63f3c75",
    "severity": "medium",
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Execution",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: SentinelOne"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0002",
          "name": "Execution",
          "reference": "https://attack.mitre.org/tactics/TA0002/"
        },
        "technique": [
          {
            "id": "T1129",
            "name": "Shared Modules",
            "reference": "https://attack.mitre.org/techniques/T1129/"
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "eql",
    "version": 208
  },
  "id": "a3ea12f3-0d4e-4667-8b44-4230c63f3c75_208",
  "type": "security-rule"
}