{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "building_block_type": "default",
    "description": "Attackers may try to access private keys, e.g. ssh, in order to gain further authenticated access to the environment.",
    "from": "now-119m",
    "index": [
      "logs-endpoint.events.process-*",
      "logs-windows.sysmon_operational-*",
      "endgame-*",
      "logs-system.security*",
      "winlogbeat-*"
    ],
    "interval": "60m",
    "language": "eql",
    "license": "Elastic License v2",
    "name": "Attempted Private Key Access",
    "query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.args : (\"*.pem *\", \"*.pem\", \"*.id_rsa*\") and\n  not process.args: (\"--tls-cert\", \"--ssl-cert\") and\n  not process.executable : (\n    \"?:\\\\ProgramData\\\\Logishrd\\\\LogiOptions\\\\Software\\\\*\\\\LogiLuUpdater.exe\",\n    \"?:\\\\Program Files\\\\Elastic\\\\Agent\\\\data\\\\*\\\\osqueryd.exe\",\n    \"?:\\\\Program Files\\\\Guardicore\\\\gc-controller.exe\",\n    \"?:\\\\Program Files\\\\Guardicore\\\\gc-deception-agent.exe\",\n    \"?:\\\\Program Files\\\\Guardicore\\\\gc-detection-agent.exe\",\n    \"?:\\\\Program Files\\\\Guardicore\\\\gc-enforcement-agent.exe\",\n    \"?:\\\\Program Files\\\\Guardicore\\\\gc-guest-agent.exe\",\n    \"?:\\\\Program Files\\\\Logi\\\\LogiBolt\\\\LogiBoltUpdater.exe\",\n    \"?:\\\\Program Files (x86)\\\\Schneider Electric EcoStruxure\\\\Building Operation 5.0\\\\Device Administrator\\\\Python\\\\python.exe\",\n    \"?:\\\\Program Files\\\\Splunk\\\\bin\\\\openssl.exe\",\n    \"?:\\\\Program Files\\\\SplunkUniversalForwarder\\\\bin\\\\openssl.exe\",\n    \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Logi\\\\LogiBolt\\\\LogiBoltUpdater.exe\",\n    \"?:\\\\Windows\\\\system32\\\\icacls.exe\",\n    \"?:\\\\Windows\\\\System32\\\\OpenSSH\\\\*\"\n  )\n",
    "related_integrations": [
      {
        "package": "endpoint",
        "version": "^8.2.0"
      },
      {
        "package": "windows",
        "version": "^1.5.0"
      },
      {
        "package": "system",
        "version": "^1.6.4"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "host.os.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.args",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.executable",
        "type": "keyword"
      }
    ],
    "risk_score": 21,
    "rule_id": "c55badd3-3e61-4292-836f-56209dc8a601",
    "severity": "low",
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Elastic Defend",
      "Rule Type: BBR",
      "Data Source: Sysmon",
      "Data Source: Elastic Endgame",
      "Data Source: System"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0006",
          "name": "Credential Access",
          "reference": "https://attack.mitre.org/tactics/TA0006/"
        },
        "technique": [
          {
            "id": "T1552",
            "name": "Unsecured Credentials",
            "reference": "https://attack.mitre.org/techniques/T1552/",
            "subtechnique": [
              {
                "id": "T1552.004",
                "name": "Private Keys",
                "reference": "https://attack.mitre.org/techniques/T1552/004/"
              }
            ]
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "eql",
    "version": 6
  },
  "id": "c55badd3-3e61-4292-836f-56209dc8a601_6",
  "type": "security-rule"
}