{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Identifies when the `PutBucketReplication` operation is used to replicate S3 objects to a bucket in another AWS account. Adversaries may use bucket replication to exfiltrate sensitive data to an environment they control.",
    "false_positives": [
      "Bucket replication accross accounts is a legitimate practice in some AWS environments. Ensure that the sharing is authorized before taking action."
    ],
    "from": "now-6m",
    "index": [
      "filebeat-*",
      "logs-aws.cloudtrail-*"
    ],
    "language": "eql",
    "license": "Elastic License v2",
    "name": "AWS S3 Bucket Replicated to Another Account",
    "note": "## Triage and Analysis\n\n### Investigating AWS S3 Bucket Replicated to Another Account\n\nThis rule identifies when an S3 bucket is replicated to another AWS account. While sharing bucket replication is a common practice, adversaries may exploit this feature to exfiltrate data by replicating objects to external accounts under their control.\n\n#### Possible Investigation Steps\n\n- **Identify the Actor**: Review the `aws.cloudtrail.user_identity.arn` and `aws.cloudtrail.user_identity.access_key_id` fields to identify who made the change. Verify if this actor typically performs such actions and if they have the necessary permissions.\n- **Review the Sharing Event**: Identify the S3 bucket involved and review the event details. Look for `PutBucketReplication` actions where an `Account` key-value pair is included signifying replication to an external account.\n    - **Request and Response Parameters**: Check the `aws.cloudtrail.request_parameters` and `aws.cloudtrail.response_elements` fields in the CloudTrail event to identify the role used and account ID where the bucket was replicated.\n- **Verify the Shared Bucket**: Check the S3 bucket that was replicated and its contents to determine the sensitivity of the data stored within it.\n- **Validate External Account**: Examine the AWS account to which the bucket was replicated. Determine whether this account is known and previously authorized to access such resources.\n- **Contextualize with Recent Changes**: Compare this sharing event against recent changes in S3 configurations. Look for any other recent permissions changes or unusual administrative actions.\n- **Correlate with Other Activities**: Search for related CloudTrail events before and after this change to see if the same actor or IP address engaged in other potentially suspicious activities.\n- **Interview Relevant Personnel**: If the share was initiated by a user, verify the intent and authorization for this action with the person or team responsible for managing DB backups and snapshots.\n\n### False Positive Analysis\n\n- **Legitimate Backup Actions**: Confirm if the S3 bucket replication aligns with scheduled backups or legitimate automation tasks.\n- **Consistency Check**: Compare the action against historical data of similar actions performed by the user or within the organization. If the action is consistent with past legitimate activities, it might indicate a false alarm.\n\n### Response and Remediation\n\n- **Immediate Review and Reversal**: If the change was unauthorized, update the S3 configurations to remove any unauthorized replication rules.\n- **Enhance Monitoring and Alerts**: Adjust monitoring systems to alert on similar actions, especially those involving sensitive data or permissions.\n- **Policy Update**: Review and possibly update your organization’s policies on S3 bucket/object sharing to tighten control and prevent unauthorized access.\n- **Incident Response**: If malicious intent is confirmed, consider it a data breach incident and initiate the incident response protocol. This includes further investigation, containment, and recovery.\n\n### Additional Information:\n\nFor further guidance on managing and securing S3 buckets in AWS environments, refer to the [AWS S3 documentation](https://docs.aws.amazon.com/AmazonS3/latest/userguide/security.html/) and AWS best practices for security.\n",
    "query": "any where event.dataset == \"aws.cloudtrail\" \n   and event.action == \"PutBucketReplication\"\n   and event.outcome == \"success\" \n   and stringContains(aws.cloudtrail.request_parameters, \"Account\")\n",
    "references": [
      "https://docs.aws.amazon.com/AmazonS3/latest/userguide/replication-walkthrough-2.html/",
      "https://docs.aws.amazon.com/AmazonS3/latest/API/API_PutBucketReplication.html/"
    ],
    "related_integrations": [
      {
        "integration": "cloudtrail",
        "package": "aws",
        "version": "^2.0.0"
      }
    ],
    "required_fields": [
      {
        "ecs": false,
        "name": "aws.cloudtrail.request_parameters",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "event.action",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "event.dataset",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "event.outcome",
        "type": "keyword"
      }
    ],
    "risk_score": 47,
    "rule_id": "d488f026-7907-4f56-ad51-742feb3db01c",
    "severity": "medium",
    "tags": [
      "Domain: Cloud",
      "Data Source: AWS",
      "Data Source: Amazon Web Services",
      "Data Source: AWS S3",
      "Resources: Investigation Guide",
      "Use Case: Threat Detection",
      "Tactic: Exfiltration"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0010",
          "name": "Exfiltration",
          "reference": "https://attack.mitre.org/tactics/TA0010/"
        },
        "technique": [
          {
            "id": "T1537",
            "name": "Transfer Data to Cloud Account",
            "reference": "https://attack.mitre.org/techniques/T1537/"
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "eql",
    "version": 1
  },
  "id": "d488f026-7907-4f56-ad51-742feb3db01c_1",
  "type": "security-rule"
}