{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Identifies a reverse shell via the abuse of named pipes on Linux with the help of OpenSSL or Netcat. First in, first out (FIFO) files are special files for reading and writing to by Linux processes. For this to work, a named pipe is created and passed to a Linux shell where the use of a network connection tool such as Netcat or OpenSSL has been established. The stdout and stderr are captured in the named pipe from the network connection and passed back to the shell for execution.",
    "false_positives": [
      "Netcat and OpenSSL are common tools used for establishing network connections and creating encryption keys. While they are popular, capturing the stdout and stderr in a named pipe pointed to a shell is anomalous."
    ],
    "from": "now-9m",
    "index": [
      "auditbeat-*",
      "logs-endpoint.events.*"
    ],
    "language": "eql",
    "license": "Elastic License v2",
    "name": "Reverse Shell Created via Named Pipe",
    "query": "sequence by host.id with maxspan = 5s\n    [process where event.type == \"start\" and process.executable : (\"/usr/bin/mkfifo\",\"/usr/bin/mknod\") and process.args:(\"/tmp/*\",\"$*\")]\n    [process where process.executable : (\"/bin/sh\",\"/bin/bash\") and process.args:(\"-i\") or\n        (process.executable: (\"/usr/bin/openssl\") and process.args: (\"-connect\"))]\n    [process where (process.name:(\"nc\",\"ncat\",\"netcat\",\"netcat.openbsd\",\"netcat.traditional\") or\n                    (process.name: \"openssl\" and process.executable: \"/usr/bin/openssl\"))]\n",
    "references": [
      "https://int0x33.medium.com/day-43-reverse-shell-with-openssl-1ee2574aa998",
      "https://blog.gregscharf.com/2021/03/22/tar-in-cronjob-to-privilege-escalation/",
      "https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md#openssl"
    ],
    "related_integrations": [
      {
        "package": "endpoint",
        "version": "^8.2.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "host.id",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.args",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.executable",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.name",
        "type": "keyword"
      }
    ],
    "risk_score": 47,
    "rule_id": "dd7f1524-643e-11ed-9e35-f661ea17fbcd",
    "severity": "medium",
    "tags": [
      "Elastic",
      "Host",
      "Linux",
      "Threat Detection",
      "Execution",
      "Investigation Guide"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0002",
          "name": "Execution",
          "reference": "https://attack.mitre.org/tactics/TA0002/"
        },
        "technique": [
          {
            "id": "T1059",
            "name": "Command and Scripting Interpreter",
            "reference": "https://attack.mitre.org/techniques/T1059/",
            "subtechnique": [
              {
                "id": "T1059.004",
                "name": "Unix Shell",
                "reference": "https://attack.mitre.org/techniques/T1059/004/"
              }
            ]
          }
        ]
      }
    ],
    "type": "eql",
    "version": 2
  },
  "id": "dd7f1524-643e-11ed-9e35-f661ea17fbcd",
  "type": "security-rule"
}