{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Identifies a suspicious child process of the Windows virtual system process, which could indicate code injection.",
    "from": "now-9m",
    "index": [
      "winlogbeat-*",
      "logs-endpoint.events.process-*",
      "logs-windows.forwarded*",
      "logs-windows.sysmon_operational-*",
      "endgame-*",
      "logs-system.security*",
      "logs-m365_defender.event-*",
      "logs-sentinel_one_cloud_funnel.*"
    ],
    "language": "eql",
    "license": "Elastic License v2",
    "name": "Unusual Child Process from a System Virtual Process",
    "query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.parent.pid == 4 and process.executable : \"?*\" and\n  not process.executable : (\"Registry\", \"MemCompression\", \"?:\\\\Windows\\\\System32\\\\smss.exe\")\n",
    "related_integrations": [
      {
        "package": "endpoint",
        "version": "^8.2.0"
      },
      {
        "package": "windows",
        "version": "^1.5.0"
      },
      {
        "package": "m365_defender",
        "version": "^2.0.0"
      },
      {
        "package": "sentinel_one_cloud_funnel",
        "version": "^1.0.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "host.os.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.executable",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.parent.pid",
        "type": "long"
      }
    ],
    "risk_score": 73,
    "rule_id": "de9bd7e0-49e9-4e92-a64d-53ade2e66af1",
    "severity": "high",
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: System",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Sysmon",
      "Data Source: SentinelOne"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0005",
          "name": "Defense Evasion",
          "reference": "https://attack.mitre.org/tactics/TA0005/"
        },
        "technique": [
          {
            "id": "T1055",
            "name": "Process Injection",
            "reference": "https://attack.mitre.org/techniques/T1055/"
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "eql",
    "version": 211
  },
  "id": "de9bd7e0-49e9-4e92-a64d-53ade2e66af1_211",
  "type": "security-rule"
}