{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "This rule detects modification of the cgroup notify_on_release file from inside a container. When the notify_on_release flag is enabled (1) in a cgroup, then whenever the last task in the cgroup exits or attaches to another cgroup, the command specified in the release_agent file is run and invoked from the host. A privileged container with SYS_ADMIN capabilities, enables a threat actor to mount a cgroup directory and modify the notify_on_release flag in order to take advantage of this feature, which could be used for further privilege escalation and container escapes to the host machine.",
    "from": "now-6m",
    "index": [
      "logs-cloud_defend*"
    ],
    "interval": "5m",
    "language": "eql",
    "license": "Elastic License v2",
    "name": "Potential Container Escape via Modified notify_on_release File",
    "query": "file where event.module == \"cloud_defend\" and event.action == \"open\" and \nevent.type == \"change\" and file.name : \"notify_on_release\"\n",
    "references": [
      "https://blog.trailofbits.com/2019/07/19/understanding-docker-container-escapes/",
      "https://sysdig.com/blog/detecting-mitigating-cve-2022-0492-sysdig/"
    ],
    "related_integrations": [
      {
        "package": "cloud_defend",
        "version": "^1.0.5"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.action",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "event.module",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "event.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "file.name",
        "type": "keyword"
      }
    ],
    "risk_score": 73,
    "rule_id": "ef65e82c-d8b4-4895-9824-5f6bc6166804",
    "severity": "high",
    "tags": [
      "Data Source: Elastic Defend for Containers",
      "Domain: Container",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Privilege Escalation"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "reference": "https://attack.mitre.org/tactics/TA0004/"
        },
        "technique": [
          {
            "id": "T1611",
            "name": "Escape to Host",
            "reference": "https://attack.mitre.org/techniques/T1611/"
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "eql",
    "version": 1
  },
  "id": "ef65e82c-d8b4-4895-9824-5f6bc6166804_1",
  "type": "security-rule"
}