{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Identifies multiple AWS Bedrock executions in a one minute time window without guardrails by the same user in the same account over a session. Multiple consecutive executions implies that a user may be intentionally attempting to bypass security controls, by not routing the requests with the desired guardrail configuration in order to access sensitive information, or possibly exploit a vulnerability in the system.",
    "false_positives": [
      "Users testing new model deployments or updated compliance policies without Amazon Bedrock guardrails."
    ],
    "from": "now-60m",
    "interval": "10m",
    "language": "esql",
    "license": "Elastic License v2",
    "name": "AWS Bedrock Invocations without Guardrails Detected by a Single User Over a Session",
    "note": "## Triage and analysis\n\n### Investigating Amazon Bedrock Invocations without Guardrails Detected by a Single User Over a Session.\n\nUsing Amazon Bedrock Guardrails during model invocation is critical for ensuring the safe, reliable, and ethical use of AI models. \nGuardrails help manage risks associated with AI usage and ensure the output aligns with desired policies and standards.\n\n#### Possible investigation steps\n\n- Identify the user account that caused multiple model violations over a session without desired guardrail configuration and whether it should perform this kind of action.\n- Investigate the user activity that might indicate a potential brute force attack.\n- Investigate other alerts associated with the user account during the past 48 hours.\n- Consider the time of day. If the user is a human (not a program or script), did the activity take place during a normal time of day?\n- Examine the account's prompts and responses in the last 24 hours.\n- If you suspect the account has been compromised, scope potentially compromised assets by tracking Amazon Bedrock model access, prompts generated, and responses to the prompts by the account in the last 24 hours.\n\n### False positive analysis\n\n- Verify the user account that caused multiple policy violations by a single user over session, is not testing any new model deployments or updated compliance policies in Amazon Bedrock guardrails.\n\n### Response and remediation\n\n- Initiate the incident response process based on the outcome of the triage.\n- Disable or limit the account during the investigation and response.\n- Identify the possible impact of the incident and prioritize accordingly; the following actions can help you gain context:\n    - Identify the account role in the cloud environment.\n    - Identify if the attacker is moving laterally and compromising other Amazon Bedrock Services.\n    - Identify any regulatory or legal ramifications related to this activity.\n- Review the permissions assigned to the implicated user group or role behind these requests to ensure they are authorized and expected to access bedrock and ensure that the least privilege principle is being followed.\n- Determine the initial vector abused by the attacker and take action to prevent reinfection via the same vector.\n- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).\n",
    "query": "from logs-aws_bedrock.invocation-*\n// create time window buckets of 1 minute\n| eval time_window = date_trunc(1 minute, @timestamp)\n| where gen_ai.guardrail_id is NULL\n| KEEP @timestamp, time_window, gen_ai.guardrail_id , user.id\n| stats model_invocation_without_guardrails = count() by user.id\n| where model_invocation_without_guardrails > 5\n| sort model_invocation_without_guardrails desc\n",
    "references": [
      "https://docs.aws.amazon.com/bedrock/latest/userguide/guardrails-components.html",
      "https://atlas.mitre.org/techniques/AML.T0051",
      "https://atlas.mitre.org/techniques/AML.T0054",
      "https://www.elastic.co/security-labs/elastic-advances-llm-security"
    ],
    "risk_score": 47,
    "rule_id": "f2c653b7-7daf-4774-86f2-34cdbd1fc528",
    "setup": "## Setup\n\nThis rule requires that guardrails are configured in AWS Bedrock. For more information, see the AWS Bedrock documentation:\n\nhttps://docs.aws.amazon.com/bedrock/latest/userguide/guardrails-create.html\n",
    "severity": "medium",
    "tags": [
      "Domain: LLM",
      "Data Source: AWS Bedrock",
      "Data Source: AWS S3",
      "Resources: Investigation Guide",
      "Use Case: Policy Violation",
      "Mitre Atlas: T0051",
      "Mitre Atlas: T0054"
    ],
    "timestamp_override": "event.ingested",
    "type": "esql",
    "version": 1
  },
  "id": "f2c653b7-7daf-4774-86f2-34cdbd1fc528_1",
  "type": "security-rule"
}