{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Identifies the install of browser extensions. Malicious browser extensions can be installed via app store downloads masquerading as legitimate extensions, social engineering, or by an adversary that has already compromised a system.",
    "from": "now-9m",
    "index": [
      "logs-endpoint.events.file-*",
      "logs-m365_defender.event-*",
      "logs-sentinel_one_cloud_funnel.*",
      "logs-windows.sysmon_operational-*",
      "winlogbeat-*",
      "endgame-*"
    ],
    "language": "eql",
    "license": "Elastic License v2",
    "name": "Browser Extension Install",
    "query": "file where host.os.type == \"windows\" and event.type : \"creation\" and \n(\n  /* Firefox-Based Browsers */\n  (\n    file.name : \"*.xpi\" and\n    file.path : \"?:\\\\Users\\\\*\\\\AppData\\\\Roaming\\\\*\\\\Profiles\\\\*\\\\Extensions\\\\*.xpi\" and\n    not \n    (\n      process.name : \"firefox.exe\" and\n      file.name : (\"langpack-*@firefox.mozilla.org.xpi\", \"*@dictionaries.addons.mozilla.org.xpi\")\n    )\n  ) or\n  /* Chromium-Based Browsers */\n  (\n    file.name : \"*.crx\" and\n    file.path : \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\*\\\\*\\\\User Data\\\\Webstore Downloads\\\\*\"\n  )\n)\n",
    "related_integrations": [
      {
        "package": "endpoint",
        "version": "^8.2.0"
      },
      {
        "package": "m365_defender",
        "version": "^2.0.0"
      },
      {
        "package": "sentinel_one_cloud_funnel",
        "version": "^1.0.0"
      },
      {
        "package": "windows",
        "version": "^1.5.0"
      }
    ],
    "required_fields": [
      {
        "ecs": true,
        "name": "event.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "file.name",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "file.path",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "host.os.type",
        "type": "keyword"
      },
      {
        "ecs": true,
        "name": "process.name",
        "type": "keyword"
      }
    ],
    "risk_score": 21,
    "rule_id": "f97504ac-1053-498f-aeaa-c6d01e76b379",
    "severity": "low",
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Data Source: Elastic Defend",
      "Data Source: Elastic Endgame",
      "Data Source: SentinelOne",
      "Data Source: Sysmon",
      "Data Source: Microsoft Defender for Endpoint"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0003",
          "name": "Persistence",
          "reference": "https://attack.mitre.org/tactics/TA0003/"
        },
        "technique": [
          {
            "id": "T1176",
            "name": "Browser Extensions",
            "reference": "https://attack.mitre.org/techniques/T1176/"
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "eql",
    "version": 102
  },
  "id": "f97504ac-1053-498f-aeaa-c6d01e76b379_102",
  "type": "security-rule"
}