{
  "author": [
    "Elastic"
  ],
  "description": "A request to web application returned a 405 response which indicates the web application declined to process the request because the HTTP method is not allowed for the resource",
  "false_positives": [
    "Security scans and tests may result in these errors. Misconfigured or buggy applications may produce large numbers of these errors. If the source is unexpected, the user unauthorized, or the request unusual, these may indicate suspicious or malicious activity."
  ],
  "index": [
    "apm-*-transaction*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Web Application Suspicious Activity: Unauthorized Method",
  "query": "http.response.status_code:405\n",
  "references": [
    "https://en.wikipedia.org/wiki/HTTP_405"
  ],
  "risk_score": 47,
  "rule_id": "75ee75d8-c180-481c-ba88-ee50129a6aef",
  "severity": "medium",
  "tags": [
    "Elastic",
    "APM"
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 6
}
