{
  "author": [
    "Elastic"
  ],
  "description": "Identifies MsBuild.exe making outbound network connections. This may indicate adversarial activity as MsBuild is often leveraged by adversaries to execute code and evade detection.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*",
    "winlogbeat-*"
  ],
  "language": "eql",
  "license": "Elastic License",
  "name": "MsBuild Network Connection Sequence",
  "query": "sequence by process.entity_id\n  [process where event.type in (\"start\", \"process_started\") and process.name == \"MSBuild.exe\"]\n  [network where process.name == \"MSBuild.exe\" and\n     not (destination.address == \"127.0.0.1\" and source.address == \"127.0.0.1\")]\n",
  "risk_score": 21,
  "rule_id": "9dc6ed5d-62a9-4feb-a903-fafa1d33b8e9",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1127",
          "name": "Trusted Developer Utilities Proxy Execution",
          "reference": "https://attack.mitre.org/techniques/T1127/"
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
