{
  "author": [
    "Elastic"
  ],
  "description": "Identifies MsXsl.exe making outbound network connections. This may indicate adversarial activity as MsXsl is often leveraged by adversaries to execute malicious scripts and evade detection.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*",
    "winlogbeat-*"
  ],
  "language": "eql",
  "license": "Elastic License",
  "name": "MsXsl Making Network Connections",
  "query": "sequence by process.entity_id\n  [process where event.type in (\"start\", \"process_started\") and process.name == \"msxsl.exe\"]\n  [network where event.type == \"connection\" and process.name == \"msxsl.exe\" and network.direction == \"outgoing\"]\n",
  "risk_score": 21,
  "rule_id": "870d1753-1078-403e-92d4-735f142edcca",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1220",
          "name": "XSL Script Processing",
          "reference": "https://attack.mitre.org/techniques/T1220/"
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
