{
  "author": [
    "Elastic"
  ],
  "description": "Identifies network activity from unexpected system applications. This may indicate adversarial activity as these applications are often leveraged by adversaries to execute code and evade detection.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*",
    "winlogbeat-*"
  ],
  "language": "eql",
  "license": "Elastic License",
  "name": "Unusual Network Activity from a Windows System Binary",
  "query": "sequence by process.entity_id with maxspan=5m\n  [process where event.type in (\"start\", \"process_started\") and\n\n     /* known applocker bypasses */\n     process.name in (\"bginfo.exe\",\n                      \"cdb.exe\",\n                      \"control.exe\",\n                      \"cmstp.exe\",\n                      \"csi.exe\",\n                      \"dnx.exe\",\n                      \"fsi.exe\",\n                      \"ieexec.exe\",\n                      \"iexpress.exe\",\n                      \"installutil.exe\",\n                      \"Microsoft.Workflow.Compiler.exe\",\n                      \"MSBuild.exe\",\n                      \"msdt.exe\",\n                      \"mshta.exe\",\n                      \"msiexec.exe\",\n                      \"msxsl.exe\",\n                      \"odbcconf.exe\",\n                      \"rcsi.exe\",\n                      \"regsvr32.exe\",\n                      \"xwizard.exe\")]\n  [network where event.type == \"connection\" and\n     process.name in (\"bginfo.exe\",\n                      \"cdb.exe\",\n                      \"control.exe\",\n                      \"cmstp.exe\",\n                      \"csi.exe\",\n                      \"dnx.exe\",\n                      \"fsi.exe\",\n                      \"ieexec.exe\",\n                      \"iexpress.exe\",\n                      \"installutil.exe\",\n                      \"Microsoft.Workflow.Compiler.exe\",\n                      \"MSBuild.exe\",\n                      \"msdt.exe\",\n                      \"mshta.exe\",\n                      \"msiexec.exe\",\n                      \"msxsl.exe\",\n                      \"odbcconf.exe\",\n                      \"rcsi.exe\",\n                      \"regsvr32.exe\",\n                      \"xwizard.exe\")]\n",
  "risk_score": 21,
  "rule_id": "1fe3b299-fbb5-4657-a937-1d746f2c711a",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1127",
          "name": "Trusted Developer Utilities Proxy Execution",
          "reference": "https://attack.mitre.org/techniques/T1127/"
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
