{
  "author": [
    "Elastic"
  ],
  "description": "Identifies multiple SSH login failures followed by a successful one from the same source address. Adversaries can attempt to login into multiple users with a common or known password to gain access to accounts.",
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-system.auth-*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Potential SSH Password Spraying",
  "query": "sequence by host.id, source.ip, user.name with maxspan=3s\n  [authentication where event.action  in (\"ssh_login\", \"user_login\") and\n   event.outcome == \"failure\" and source.ip != null and source.ip != \"0.0.0.0\" and source.ip != \"::\" ] with runs=2\n\n  [authentication where event.action  in (\"ssh_login\", \"user_login\") and\n   event.outcome == \"success\" and source.ip != null and source.ip != \"0.0.0.0\" and source.ip != \"::\" ]\n",
  "required_fields": [
    {
      "ecs": true,
      "name": "event.action",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.outcome",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "host.id",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "source.ip",
      "type": "ip"
    },
    {
      "ecs": true,
      "name": "user.name",
      "type": "keyword"
    }
  ],
  "risk_score": 47,
  "rule_id": "8cb84371-d053-4f4f-bce0-c74990e28f28",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "Linux",
    "Threat Detection",
    "Credential Access"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1110",
          "name": "Brute Force",
          "reference": "https://attack.mitre.org/techniques/T1110/",
          "subtechnique": [
            {
              "id": "T1110.001",
              "name": "Password Guessing",
              "reference": "https://attack.mitre.org/techniques/T1110/001/"
            },
            {
              "id": "T1110.003",
              "name": "Password Spraying",
              "reference": "https://attack.mitre.org/techniques/T1110/003/"
            }
          ]
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
