{
  "author": [
    "Elastic"
  ],
  "description": "Identifies multiple consecutive login failures targeting an user account from the same source address and within a short time interval. Adversaries will often brute force login attempts across multiple users with a common or known password, in an attempt to gain access to accounts.",
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-system.auth-*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Potential Linux SSH Brute Force Detected",
  "note": "## Triage and analysis\n\n### Investigating Potential SSH Brute Force Attack\n\nThe rule identifies consecutive SSH login failures targeting a user account from the same source IP address to the\nsame target host indicating brute force login attempts.\n\n#### Possible investigation steps\n\n- Investigate the login failure user name(s).\n- Investigate the source IP address of the failed ssh login attempt(s).\n- Investigate other alerts associated with the user/host during the past 48 hours.\n- Identify the source and the target computer and their roles in the IT environment.\n\n### False positive analysis\n\n- Authentication misconfiguration or obsolete credentials.\n- Service account password expired.\n- Infrastructure or availability issue.\n\n### Response and remediation\n\n- Initiate the incident response process based on the outcome of the triage.\n- Isolate the involved hosts to prevent further post-compromise behavior.\n- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are\nidentified.\n- Reset passwords for these accounts and other potentially compromised credentials.\n- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and\nmalware components.\n- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.\n- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the\nmean time to respond (MTTR).\n\n",
  "query": "sequence by host.id, source.ip, user.name with maxspan=10s\n  [authentication where event.action  in (\"ssh_login\", \"user_login\") and\n   event.outcome == \"failure\" and source.ip != null and source.ip != \"0.0.0.0\" and source.ip != \"::\" ] with runs=10\n",
  "required_fields": [
    {
      "ecs": true,
      "name": "event.action",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.outcome",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "host.id",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "source.ip",
      "type": "ip"
    },
    {
      "ecs": true,
      "name": "user.name",
      "type": "keyword"
    }
  ],
  "risk_score": 47,
  "rule_id": "1c27fa22-7727-4dd3-81c0-de6da5555feb",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "Linux",
    "Threat Detection",
    "Credential Access"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1110",
          "name": "Brute Force",
          "reference": "https://attack.mitre.org/techniques/T1110/",
          "subtechnique": [
            {
              "id": "T1110.001",
              "name": "Password Guessing",
              "reference": "https://attack.mitre.org/techniques/T1110/001/"
            },
            {
              "id": "T1110.003",
              "name": "Password Spraying",
              "reference": "https://attack.mitre.org/techniques/T1110/003/"
            }
          ]
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
