{
  "author": [
    "Elastic"
  ],
  "description": "An adversary may attempt to bypass the Okta multi-factor authentication (MFA) policies configured for an organization in order to obtain unauthorized access to an application. This rule detects when an Okta MFA bypass attempt occurs.",
  "index": [
    "filebeat-*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Attempted Bypass of Okta MFA",
  "query": "event.module:okta and event.dataset:okta.system and event.action:user.mfa.attempt_bypass",
  "references": [
    "https://developer.okta.com/docs/reference/api/system-log/",
    "https://developer.okta.com/docs/reference/api/event-types/"
  ],
  "risk_score": 73,
  "rule_id": "3805c3dc-f82c-4f8d-891e-63c24d3102b0",
  "severity": "high",
  "tags": [
    "Elastic",
    "Okta"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1111",
          "name": "Two-Factor Authentication Interception",
          "reference": "https://attack.mitre.org/techniques/T1111/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
