{
  "author": [
    "Nick Jones",
    "Elastic"
  ],
  "description": "An adversary may attempt to access the secrets in secrets manager to steal certificates, credentials, or other sensitive material",
  "false_positives": [
    "Verify whether the user identity, user agent, and/or hostname should be using GetSecretString API for the specified SecretId. If known behavior is causing false positives, it can be exempted from the rule."
  ],
  "from": "now-60m",
  "index": [
    "filebeat-*"
  ],
  "interval": "10m",
  "language": "kuery",
  "license": "Elastic License",
  "name": "AWS Access Secret in Secrets Manager",
  "query": "event.dataset:aws.cloudtrail and event.provider:secretsmanager.amazonaws.com and event.action:GetSecretValue",
  "references": [
    "https://docs.aws.amazon.com/secretsmanager/latest/apireference/API_GetSecretValue.html",
    "http://detectioninthe.cloud/credential_access/access_secret_in_secrets_manager/"
  ],
  "risk_score": 21,
  "rule_id": "a00681e3-9ed6-447c-ab2c-be648821c622",
  "severity": "low",
  "tags": [
    "AWS",
    "Elastic"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1528",
          "name": "Steal Application Access Token",
          "reference": "https://attack.mitre.org/techniques/T1528/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
