{
  "author": [
    "Elastic"
  ],
  "description": "Adversaries can add the 'hidden' attribute to files to hide them from the user in an attempt to evade detection.",
  "from": "now-9m",
  "index": [
    "winlogbeat-*",
    "logs-endpoint.events.*",
    "logs-windows.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Adding Hidden File Attribute via Attrib",
  "query": "process where event.type in (\"start\", \"process_started\") and\n  process.name : \"attrib.exe\" and process.args : \"+h\"\n",
  "risk_score": 21,
  "rule_id": "4630d948-40d4-4cef-ac69-4002e29bc3db",
  "severity": "low",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Defense Evasion"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1564",
          "name": "Hide Artifacts",
          "reference": "https://attack.mitre.org/techniques/T1564/",
          "subtechnique": [
            {
              "id": "T1564.001",
              "name": "Hidden Files and Directories",
              "reference": "https://attack.mitre.org/techniques/T1564/001/"
            }
          ]
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": []
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "eql",
  "version": 9
}
