{
  "author": [
    "Elastic"
  ],
  "description": "Identifies unusual instances of Rundll32.exe making outbound network connections. This may indicate adversarial activity and may identify malicious DLLs.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*",
    "winlogbeat-*"
  ],
  "language": "eql",
  "license": "Elastic License",
  "name": "Unusual Network Connection Sequence via RunDLL32",
  "query": "sequence by process.entity_id with maxspan=2h\n  [process where event.type in (\"start\", \"process_started\") and\n                                    /* uncomment once in winlogbeat */\n     (process.name : \"rundll32.exe\" /* or process.pe.original_file_name == \"RUNDLL32.EXE\" */ ) and\n     process.args_count < 2]\n  [network where event.type == \"connection\" and\n                                     /* uncomment once in winlogbeat */\n     (process.name : \"rundll32.exe\" /* or process.pe.original_file_name == \"RUNDLL32.EXE\" */ )]\n",
  "risk_score": 21,
  "rule_id": "2b347f66-6739-4ae3-bd94-195036dde8b3",
  "severity": "low",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Defense Evasion"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1085",
          "name": "Rundll32",
          "reference": "https://attack.mitre.org/techniques/T1085/"
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
