{
  "author": [
    "Elastic"
  ],
  "description": "Identifies when the configuration is modified for a storage bucket in Google Cloud Platform (GCP). An adversary may modify the configuration of a storage bucket in order to weaken the security controls of their target's environment.",
  "false_positives": [
    "Storage bucket configuration may be modified by system administrators. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."
  ],
  "index": [
    "filebeat-*",
    "logs-gcp*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "GCP Storage Bucket Configuration Modification",
  "note": "",
  "query": "event.dataset:gcp.audit and event.action:\"storage.buckets.update\" and event.outcome:success\n",
  "references": [
    "https://cloud.google.com/storage/docs/key-terms#buckets"
  ],
  "related_integrations": [
    {
      "integration": "audit",
      "package": "gcp",
      "version": "^2.2.1"
    }
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.action",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.dataset",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.outcome",
      "type": "keyword"
    }
  ],
  "risk_score": 47,
  "rule_id": "97359fd8-757d-4b1d-9af1-ef29e4a8680e",
  "setup": "The GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Cloud",
    "GCP",
    "Continuous Monitoring",
    "SecOps",
    "Identity and Access",
    "Defense Evasion"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1578",
          "name": "Modify Cloud Compute Infrastructure",
          "reference": "https://attack.mitre.org/techniques/T1578/"
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 101
}
