{
  "author": [
    "Elastic"
  ],
  "description": "Identifies registration utilities making outbound network connections. This includes regsvcs, regasm, and regsvr32. This may indicate adversarial activity as these tools are often leveraged by adversaries to execute code and evade detection.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*",
    "winlogbeat-*"
  ],
  "language": "eql",
  "license": "Elastic License",
  "name": "Registration Tool Making Network Connections",
  "query": "sequence by process.entity_id\n  [process where event.type in (\"start\", \"process_started\") and\n     (process.name : \"RegAsm.exe\" or process.name : \"regsvcs.exe\" or process.name : \"regsvr32.exe\")]\n  [network where event.type == \"connection\" and\n     (process.name : \"RegAsm.exe\" or process.name : \"regsvcs.exe\" or process.name : \"regsvr32.exe\")]\nuntil\n  [process where event.type == \"end\" and\n     (process.name : \"RegAsm.exe\" or process.name : \"regsvcs.exe\" or process.name : \"regsvr32.exe\")]\n",
  "risk_score": 21,
  "rule_id": "6d3456a5-4a42-49d1-aaf2-7b1fd475b2c6",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Defense Evasion"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1121",
          "name": "Regsvcs/Regasm",
          "reference": "https://attack.mitre.org/techniques/T1121/"
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
