{
  "author": [
    "Elastic"
  ],
  "description": "Identifies parent process spoofing used to thwart detection. Adversaries may spoof the parent process identifier (PPID) of a new process to evade process-monitoring defenses or to elevate privileges.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Parent Process PID Spoofing",
  "query": "/* This rule is compatible with Elastic Endpoint only */\n\nsequence by host.id, user.id with maxspan=5m\n [process where event.type == \"start\" and\n  process.Ext.token.integrity_level_name != \"system\" and\n  (\n    process.pe.original_file_name : (\"winword.exe\", \"excel.exe\", \"outlook.exe\", \"powerpnt.exe\", \"eqnedt32.exe\",\n                                     \"fltldr.exe\", \"mspub.exe\", \"msaccess.exe\", \"powershell.exe\", \"pwsh.exe\",\n                                     \"cscript.exe\", \"wscript.exe\", \"rundll32.exe\", \"regsvr32.exe\", \"msbuild.exe\",\n                                     \"mshta.exe\", \"wmic.exe\", \"cmstp.exe\", \"msxsl.exe\") or\n    process.executable : (\"?:\\\\Users\\\\*.exe\",\n                          \"?:\\\\ProgramData\\\\*.exe\",\n                          \"?:\\\\Windows\\\\Microsoft.NET\\\\*.exe\",\n                          \"?:\\\\Windows\\\\Temp\\\\*.exe\",\n                          \"?:\\\\Windows\\\\Tasks\\\\*\") or\n    process.code_signature.trusted != true\n  )\n  ] by process.pid\n [process where event.type == \"start\" and process.parent.Ext.real.pid > 0 and\n  /* process.parent.Ext.real.pid is only populated if the parent process pid doesn't match */\n\n  not (process.name : \"msedge.exe\" and process.parent.name : \"sihost.exe\")\n ] by process.parent.Ext.real.pid\n",
  "references": [
    "https://blog.didierstevens.com/2017/03/20/"
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.type",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "host.id",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "process.Ext.token.integrity_level_name",
      "type": "unknown"
    },
    {
      "ecs": true,
      "name": "process.code_signature.trusted",
      "type": "boolean"
    },
    {
      "ecs": true,
      "name": "process.executable",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.name",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "process.parent.Ext.real.pid",
      "type": "unknown"
    },
    {
      "ecs": true,
      "name": "process.parent.name",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.pe.original_file_name",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.pid",
      "type": "long"
    },
    {
      "ecs": true,
      "name": "user.id",
      "type": "keyword"
    }
  ],
  "risk_score": 73,
  "rule_id": "c88d4bd0-5649-4c52-87ea-9be59dbfbcf2",
  "severity": "high",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Defense Evasion"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1134",
          "name": "Access Token Manipulation",
          "reference": "https://attack.mitre.org/techniques/T1134/",
          "subtechnique": [
            {
              "id": "T1134.004",
              "name": "Parent PID Spoofing",
              "reference": "https://attack.mitre.org/techniques/T1134/004/"
            }
          ]
        }
      ]
    }
  ],
  "type": "eql",
  "version": 100
}
