{
  "author": [
    "Elastic"
  ],
  "description": "Identifies use of the fsutil.exe to delete the volume USNJRNL. This technique is used by attackers to eliminate evidence of files created during post-exploitation activities.",
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Delete Volume USN Journal with Fsutil",
  "query": "event.category:process and event.type:(start or process_started) and process.name:fsutil.exe and process.args:(deletejournal and usn)",
  "risk_score": 21,
  "rule_id": "f675872f-6d85-40a3-b502-c0d2ef101e92",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1107",
          "name": "File Deletion",
          "reference": "https://attack.mitre.org/techniques/T1107/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 3
}
