{
  "author": [
    "Elastic"
  ],
  "description": "An instance of MSBuild, the Microsoft Build Engine, was started by Excel or Word. This is unusual behavior for the Build Engine and could have been caused by an Excel or Word document executing a malicious script payload.",
  "false_positives": [
    "The Build Engine is commonly used by Windows developers but use by non-engineers is unusual. It is quite unusual for this program to be started by an Office application like Word or Excel."
  ],
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Microsoft Build Engine Started by an Office Application",
  "query": "event.category:process and event.type:(start or process_started) and process.name:MSBuild.exe and process.parent.name:(eqnedt32.exe or excel.exe or fltldr.exe or msaccess.exe or mspub.exe or outlook.exe or powerpnt.exe or winword.exe)",
  "references": [
    "https://blog.talosintelligence.com/2020/02/building-bypass-with-msbuild.html"
  ],
  "risk_score": 73,
  "rule_id": "c5dc3223-13a2-44a2-946c-e9dc0aa0449c",
  "severity": "high",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1127",
          "name": "Trusted Developer Utilities",
          "reference": "https://attack.mitre.org/techniques/T1127/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1127",
          "name": "Trusted Developer Utilities",
          "reference": "https://attack.mitre.org/techniques/T1127/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 2
}
