{
  "author": [
    "Elastic"
  ],
  "description": "This rule detects when a service account or node attempts to enumerate their own permissions via the selfsubjectaccessreview or selfsubjectrulesreview APIs. This is highly unusual behavior for non-human identities like service accounts and nodes. An adversary may have gained access to credentials/tokens and this could be an attempt to determine what privileges they have to facilitate further movement or execution within the cluster.",
  "false_positives": [
    "An administrator may submit this request as an \"impersonatedUser\" to determine what privileges a particular service account has been granted. However, an adversary may utilize the same technique as a means to determine the privileges of another token other than that of the compromised account."
  ],
  "index": [
    "logs-kubernetes.*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Kubernetes Suspicious Self-Subject Review",
  "note": "",
  "query": "kubernetes.audit.verb:\"create\"\nand kubernetes.audit.objectRef.resource:(\"selfsubjectaccessreviews\" or \"selfsubjectrulesreviews\")\nand kubernetes.audit.user.username:(system\\:serviceaccount\\:* or system\\:node\\:*) or kubernetes.audit.impersonatedUser.username:(system\\:serviceaccount\\:* or system\\:node\\:*)\n",
  "references": [
    "https://www.paloaltonetworks.com/apps/pan/public/downloadResource?pagePath=/content/pan/en_US/resources/whitepapers/kubernetes-privilege-escalation-excessive-permissions-in-popular-platforms",
    "https://kubernetes.io/docs/reference/access-authn-authz/authorization/#checking-api-access",
    "https://techcommunity.microsoft.com/t5/microsoft-defender-for-cloud/detecting-identity-attacks-in-kubernetes/ba-p/3232340"
  ],
  "required_fields": [
    {
      "ecs": false,
      "name": "kubernetes.audit.impersonatedUser.username",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.objectRef.resource",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.user.username",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.verb",
      "type": "unknown"
    }
  ],
  "risk_score": 47,
  "rule_id": "12a2f15d-597e-4334-88ff-38a02cb1330b",
  "setup": "The Kubernetes Fleet integration with Audit Logs enabled or similarly structured data is required to be compatible with this rule.",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Kubernetes",
    "Continuous Monitoring",
    "Discovery"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0007",
        "name": "Discovery",
        "reference": "https://attack.mitre.org/tactics/TA0007/"
      },
      "technique": [
        {
          "id": "T1613",
          "name": "Container and Resource Discovery",
          "reference": "https://attack.mitre.org/techniques/T1613/"
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 100
}
