{
  "author": [
    "Elastic"
  ],
  "description": "This rule detects when a service account makes an unauthorized request for resources from the API server. Service accounts follow a very predictable pattern of behavior. A service account should never send an unauthorized request to the API server. This behavior is likely an indicator of compromise or of a problem within the cluster. An adversary may have gained access to credentials/tokens and this could be an attempt to access or create resources to facilitate further movement or execution within the cluster.",
  "false_positives": [
    "Unauthorized requests from service accounts are highly abnormal and more indicative of human behavior or a serious problem within the cluster. This behavior should be investigated further."
  ],
  "index": [
    "logs-kubernetes.*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Kubernetes Denied Service Account Request",
  "note": "",
  "query": "event.dataset: \"kubernetes.audit_logs\" \n  and kubernetes.audit.user.username: system\\:serviceaccount\\:* \n  and kubernetes.audit.annotations.authorization_k8s_io/decision: \"forbid\" \n",
  "references": [
    "https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections",
    "https://kubernetes.io/docs/reference/access-authn-authz/authentication/#service-account-tokens"
  ],
  "related_integrations": [
    {
      "package": "kubernetes",
      "version": "^1.4.1"
    }
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.dataset",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.annotations.authorization_k8s_io/decision",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.user.username",
      "type": "unknown"
    }
  ],
  "risk_score": 47,
  "rule_id": "63c056a0-339a-11ed-a261-0242ac120002",
  "setup": "The Kubernetes Fleet integration with Audit Logs enabled or similarly structured data is required to be compatible with this rule.",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Kubernetes",
    "Continuous Monitoring",
    "Discovery"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0007",
        "name": "Discovery",
        "reference": "https://attack.mitre.org/tactics/TA0007/"
      },
      "technique": [
        {
          "id": "T1613",
          "name": "Container and Resource Discovery",
          "reference": "https://attack.mitre.org/techniques/T1613/"
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 2
}
