{
  "author": [
    "Elastic"
  ],
  "description": "Identifies instances of an unusual process enumerating built-in Windows privileged local groups membership like Administrators or Remote Desktop users.",
  "from": "now-9m",
  "index": [
    "winlogbeat-*",
    "logs-system.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Enumeration of Privileged Local Groups Membership",
  "note": "## Triage and analysis\n\n### Investigating Enumeration of Privileged Local Groups Membership\n\nAfter successfully compromising an environment, attackers may try to gain situational awareness to plan their next steps.\nThis can happen by running commands to enumerate network resources, users, connections, files, and installed security\nsoftware.\n\nThis rule looks for the enumeration of privileged local groups' membership by suspicious processes, and excludes known\nlegitimate utilities and programs installed. Attackers can use this information to decide the next steps of the attack,\nsuch as mapping targets for credential compromise and other post-exploitation activities.\n\n#### Possible investigation steps\n\n- Identify the process, host and user involved on the event.\n- Investigate the process execution chain (parent process tree) for unknown processes. Examine their executable files\nfor prevalence, whether they are located in expected locations, and if they are signed with valid digital signatures.\n- Investigate other alerts associated with the user/host during the past 48 hours.\n- Investigate any abnormal account behavior, such as command executions, file creations or modifications, and network\nconnections.\n- Retrieve the process executable and determine if it is malicious:\n  - Check if the file belongs to the operating system or has a valid digital signature.\n  - Use a private sandboxed malware analysis system to perform analysis.\n    - Observe and collect information about the following activities:\n      - Attempts to contact external domains and addresses.\n      - File and registry access, modification, and creation activities.\n      - Service creation and launch activities.\n      - Scheduled task creation.\n\n### False positive analysis\n\n- Discovery activities are not inherently malicious if they occur in isolation. As long as the analyst did not identify\nsuspicious activity related to the user or host, such alerts can be dismissed.\n- If this rule is noisy in your environment due to expected activity, consider adding exceptions \u2014 preferably with a combination\nof user and command line conditions.\n\n### Response and remediation\n\n- Initiate the incident response process based on the outcome of the triage.\n- Isolate the involved hosts to prevent further post-compromise behavior.\n- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are\nidentified. Reset passwords for these accounts and other potentially compromised credentials, such as email, business\nsystems, and web services.\n- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and\nmalware components.\n- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.\n- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the\nmean time to respond (MTTR).\n\nThe 'Audit Security Group Management' audit policy must be configured (Success).\nSteps to implement the logging policy with with Advanced Audit Configuration:\n\n```\nComputer Configuration >\nPolicies >\nWindows Settings >\nSecurity Settings >\nAdvanced Audit Policies Configuration >\nAudit Policies >\nAccount Management >\nAudit Security Group Management (Success)\n```\n\nMicrosoft introduced the [event used](https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4799) in this detection rule on Windows 10 and Windows Server 2016 or later operating systems.\n\nIf enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work.",
  "query": "iam where event.action == \"user-member-enumerated\" and\n\n  /* excluding machine account */\n  not winlog.event_data.SubjectUserName: (\"*$\", \"LOCAL SERVICE\", \"NETWORK SERVICE\") and\n\n  /* noisy and usual legit processes excluded */\n  not winlog.event_data.CallerProcessName:\n               (\"-\",\n                \"?:\\\\Windows\\\\System32\\\\VSSVC.exe\",\n                \"?:\\\\Windows\\\\System32\\\\SearchIndexer.exe\",\n                \"?:\\\\Windows\\\\System32\\\\CompatTelRunner.exe\",\n                \"?:\\\\Windows\\\\System32\\\\oobe\\\\msoobe.exe\",\n                \"?:\\\\Windows\\\\System32\\\\net1.exe\",\n                \"?:\\\\Windows\\\\System32\\\\svchost.exe\",\n                \"?:\\\\Windows\\\\System32\\\\Netplwiz.exe\",\n                \"?:\\\\Windows\\\\System32\\\\msiexec.exe\",\n                \"?:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\",\n                \"?:\\\\Windows\\\\System32\\\\CloudExperienceHostBroker.exe\",\n                \"?:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSE.exe\",\n                \"?:\\\\Windows\\\\System32\\\\SrTasks.exe\",\n                \"?:\\\\Windows\\\\System32\\\\lsass.exe\",\n                \"?:\\\\Windows\\\\System32\\\\diskshadow.exe\",\n                \"?:\\\\Windows\\\\System32\\\\dfsrs.exe\",\n                \"?:\\\\Program Files\\\\*.exe\",\n                \"?:\\\\Program Files (x86)\\\\*.exe\",\n                \"?:\\\\WindowsAzure\\\\*\\\\WaAppAgent.exe\",\n                \"?:\\\\Windows\\\\System32\\\\vssadmin.exe\",\n                \"?:\\\\Windows\\\\VeeamVssSupport\\\\VeeamGuestHelper.exe\",\n                \"?:\\\\Windows\\\\System32\\\\dllhost.exe\",\n                \"?:\\\\Windows\\\\System32\\\\mmc.exe\",\n                \"?:\\\\Windows\\\\System32\\\\SettingSyncHost.exe\",\n                \"?:\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe\",\n                \"?:\\\\Windows\\\\System32\\\\SystemSettingsAdminFlows.exe\",\n                \"?:\\\\Windows\\\\Temp\\\\rubrik_vmware???\\\\snaptool.exe\",\n                \"?:\\\\Windows\\\\System32\\\\inetsrv\\\\w3wp.exe\",\n                \"?:\\\\$WINDOWS.~BT\\\\Sources\\\\*.exe\",\n                \"?:\\\\Windows\\\\System32\\\\wsmprovhost.exe\",\n                \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\x3jobt3?.exe\",\n                \"?:\\\\Windows\\\\System32\\\\mstsc.exe\",\n                \"?:\\\\Windows\\\\System32\\\\esentutl.exe\",\n                \"?:\\\\Windows\\\\System32\\\\RecoveryDrive.exe\",\n                \"?:\\\\Windows\\\\System32\\\\SystemPropertiesComputerName.exe\") and\n\n  /* privileged local groups */\n  (group.name:(\"admin*\",\"RemoteDesktopUsers\") or\n   winlog.event_data.TargetSid:(\"S-1-5-32-544\",\"S-1-5-32-555\"))\n",
  "required_fields": [
    {
      "ecs": true,
      "name": "event.action",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "group.name",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.CallerProcessName",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.SubjectUserName",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.TargetSid",
      "type": "unknown"
    }
  ],
  "risk_score": 47,
  "rule_id": "291a0de9-937a-4189-94c0-3e847c8b13e4",
  "setup": "The 'Audit Security Group Management' audit policy must be configured (Success).\nSteps to implement the logging policy with with Advanced Audit Configuration:\n\n```\nComputer Configuration >\nPolicies >\nWindows Settings >\nSecurity Settings >\nAdvanced Audit Policies Configuration >\nAudit Policies >\nAccount Management >\nAudit Security Group Management (Success)\n```\n\nMicrosoft introduced the event used in this detection rule on Windows 10 and Windows Server 2016 or later operating systems.\n\nIf enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work.",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Discovery",
    "has_guide"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0007",
        "name": "Discovery",
        "reference": "https://attack.mitre.org/tactics/TA0007/"
      },
      "technique": [
        {
          "id": "T1069",
          "name": "Permission Groups Discovery",
          "reference": "https://attack.mitre.org/techniques/T1069/",
          "subtechnique": [
            {
              "id": "T1069.001",
              "name": "Local Groups",
              "reference": "https://attack.mitre.org/techniques/T1069/001/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "eql",
  "version": 101
}
