{
  "author": [
    "Elastic"
  ],
  "description": "Generates a detection alert each time an Elastic Endpoint Security alert is received. Enabling this rule allows you to immediately begin investigating your Endpoint alerts.",
  "enabled": true,
  "exceptions_list": [
    {
      "id": "endpoint_list",
      "list_id": "endpoint_list",
      "namespace_type": "agnostic",
      "type": "endpoint"
    }
  ],
  "from": "now-10m",
  "index": [
    "logs-endpoint.alerts-*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "max_signals": 10000,
  "name": "Endpoint Security",
  "query": "event.kind:alert and event.module:(endpoint and not endgame)\n",
  "required_fields": [
    {
      "ecs": true,
      "name": "event.kind",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.module",
      "type": "keyword"
    }
  ],
  "risk_score": 47,
  "risk_score_mapping": [
    {
      "field": "event.risk_score",
      "operator": "equals",
      "value": ""
    }
  ],
  "rule_id": "9a1a2dae-0b5f-4c3d-8305-a268d404c306",
  "rule_name_override": "message",
  "severity": "medium",
  "severity_mapping": [
    {
      "field": "event.severity",
      "operator": "equals",
      "severity": "low",
      "value": "21"
    },
    {
      "field": "event.severity",
      "operator": "equals",
      "severity": "medium",
      "value": "47"
    },
    {
      "field": "event.severity",
      "operator": "equals",
      "severity": "high",
      "value": "73"
    },
    {
      "field": "event.severity",
      "operator": "equals",
      "severity": "critical",
      "value": "99"
    }
  ],
  "tags": [
    "Elastic",
    "Endpoint Security"
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 100
}
