{
  "author": [
    "Elastic"
  ],
  "description": "Elastic Endgame prevented Credential Dumping. Click the Elastic Endgame icon in the event.module column or the link in the rule.reference column for additional information.",
  "from": "now-15m",
  "index": [
    "endgame-*"
  ],
  "interval": "10m",
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Credential Dumping - Prevented - Elastic Endgame",
  "query": "event.kind:alert and event.module:endgame and endgame.metadata.type:prevention and (event.action:cred_theft_event or endgame.event_subtype_full:cred_theft_event)\n",
  "risk_score": 47,
  "rule_id": "db8c33a8-03cd-4988-9e2c-d0a4863adb13",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Elastic Endgame"
  ],
  "type": "query",
  "version": 6
}
