{
  "author": [
    "Elastic"
  ],
  "description": "Endpoint Security detected Credential Manipulation. Click the Endpoint Security icon in the event.module column or the link in the rule.reference column for additional information.",
  "from": "now-15m",
  "index": [
    "endgame-*"
  ],
  "interval": "10m",
  "language": "kuery",
  "license": "Elastic License",
  "name": "Credential Manipulation - Detected - Endpoint Security",
  "query": "event.kind:alert and event.module:endgame and endgame.metadata.type:detection and (event.action:token_manipulation_event or endgame.event_subtype_full:token_manipulation_event)",
  "risk_score": 73,
  "rule_id": "c0be5f31-e180-48ed-aa08-96b36899d48f",
  "severity": "high",
  "tags": [
    "Elastic",
    "Endpoint Security"
  ],
  "type": "query",
  "version": 4
}
