{
  "description": "Identifies attempts to clear Windows event log stores. This is often done by attackers in an attempt to evade detection or destroy forensic evidence on a system.",
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Clearing Windows Event Logs",
  "query": "event.action:\"Process Create (rule: ProcessCreate)\" and process.name:wevtutil.exe and process.args:cl or process.name:powershell.exe and process.args:Clear-EventLog",
  "risk_score": 21,
  "rule_id": "d331bbe2-6db4-4941-80a5-8270db72eb61",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1070",
          "name": "Indicator Removal on Host",
          "reference": "https://attack.mitre.org/techniques/T1070/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 2
}
