{
  "author": [
    "Elastic"
  ],
  "description": "Identifies when a terminal (tty) is spawned via Python. Attackers may upgrade a simple reverse shell to a fully interactive tty after obtaining initial access to a host.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Interactive Terminal Spawned via Python",
  "query": "sequence with maxspan=20s\n  [process where event.type in (\"start\", \"process_started\") and process.name : \"python*\"] by process.entity_id\n  [process where event.type in (\"start\", \"process_started\") and \n   process.executable : (\n      \"/bin/bash\",\n      \"/bin/sh\",\n      \"/bin/dash\",\n      \"/bin/csh\",\n      \"/bin/zsh\",\n      \"/bin/ksh\",\n      \"/bin/tcsh\",\n      \"/bin/fish\",\n      \"/bin/ash\",\n      \"/bin/bsh\"\n   )\n  ] by process.parent.entity_id\n",
  "risk_score": 73,
  "rule_id": "d76b02ef-fc95-4001-9297-01cb7412232f",
  "severity": "high",
  "tags": [
    "Elastic",
    "Host",
    "Linux",
    "Threat Detection",
    "Execution"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1059",
          "name": "Command and Scripting Interpreter",
          "reference": "https://attack.mitre.org/techniques/T1059/",
          "subtechnique": [
            {
              "id": "T1059.006",
              "name": "Python",
              "reference": "https://attack.mitre.org/techniques/T1059/006/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "eql",
  "version": 7
}
