{
  "author": [
    "Elastic"
  ],
  "description": "Detects when the tc (transmission control) binary is utilized to set a BPF (Berkeley Packet Filter) on a network interface. Tc is used to configure Traffic Control in the Linux kernel. It can shape, schedule, police and drop traffic. A threat actor can utilize tc to set a bpf filter on an interface for the purpose of manipulating the incoming traffic. This technique is not at all common and should indicate abnormal, suspicious or malicious activity.",
  "from": "now-9m",
  "index": [
    "logs-*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "BPF filter applied using TC",
  "query": "process where event.type != \"end\" and process.executable : \"/usr/sbin/tc\" and process.args : \"filter\" and process.args : \"add\" and process.args : \"bpf\" and not process.parent.executable: \"/usr/sbin/libvirtd\"\n",
  "references": [
    "https://github.com/h3xduck/TripleCross/blob/master/src/helpers/deployer.sh",
    "https://man7.org/linux/man-pages/man8/tc.8.html"
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.type",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.args",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.executable",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.parent.executable",
      "type": "keyword"
    }
  ],
  "risk_score": 73,
  "rule_id": "ef04a476-07ec-48fc-8f3d-5e1742de76d3",
  "severity": "high",
  "tags": [
    "Elastic",
    "Host",
    "Linux",
    "Threat Detection",
    "Execution",
    "TripleCross"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1059",
          "name": "Command and Scripting Interpreter",
          "reference": "https://attack.mitre.org/techniques/T1059/",
          "subtechnique": [
            {
              "id": "T1059.004",
              "name": "Unix Shell",
              "reference": "https://attack.mitre.org/techniques/T1059/004/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "eql",
  "version": 100
}
