{
  "author": [
    "Elastic"
  ],
  "description": "Identifies a suspicious parent child process relationship with cmd.exe descending from svchost.exe",
  "from": "now-9m",
  "index": [
    "winlogbeat-*",
    "logs-endpoint.events.*",
    "logs-windows.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Svchost spawning Cmd",
  "note": "## Config\n\nIf enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work.\n",
  "query": "process where event.type == \"start\" and\n  process.parent.name : \"svchost.exe\" and process.name : \"cmd.exe\" and \n  not (process.pe.original_file_name : \"cmd.exe\" and process.args : (\n    \"??:\\\\Program Files\\\\Npcap\\\\CheckStatus.bat?\",\n    \"?:\\\\Program Files\\\\Npcap\\\\CheckStatus.bat\",\n    \"\\\\system32\\\\cleanmgr.exe\",\n    \"?:\\\\Windows\\\\system32\\\\silcollector.cmd\",\n    \"\\\\system32\\\\AppHostRegistrationVerifier.exe\",\n    \"\\\\system32\\\\ServerManagerLauncher.exe\"))\n",
  "risk_score": 21,
  "rule_id": "fd7a6052-58fa-4397-93c3-4795249ccfa2",
  "severity": "low",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Execution"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1059",
          "name": "Command and Scripting Interpreter",
          "reference": "https://attack.mitre.org/techniques/T1059/"
        }
      ]
    }
  ],
  "timeline_id": "e70679c2-6cde-4510-9764-4823df18f7db",
  "timeline_title": "Comprehensive Process Timeline",
  "timestamp_override": "event.ingested",
  "type": "eql",
  "version": 10
}
