{
  "author": [
    "Elastic"
  ],
  "description": "Identifies network activity from unexpected system applications. This may indicate adversarial activity as these applications are often leveraged by adversaries to execute code and evade detection.",
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Unusual Process Network Connection",
  "query": "event.category:network and event.type:connection and process.name:(Microsoft.Workflow.Compiler.exe or bginfo.exe or cdb.exe or cmstp.exe or csi.exe or dnx.exe or fsi.exe or ieexec.exe or iexpress.exe or odbcconf.exe or rcsi.exe or xwizard.exe)",
  "risk_score": 21,
  "rule_id": "610949a1-312f-4e04-bb55-3a79b8c95267",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1127",
          "name": "Trusted Developer Utilities",
          "reference": "https://attack.mitre.org/techniques/T1127/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 3
}
