{
  "author": [
    "Elastic"
  ],
  "description": "Identifies msxsl.exe making a network connection. This may indicate adversarial activity as msxsl.exe is often leveraged by adversaries to execute malicious scripts and evade detection.",
  "from": "now-9m",
  "index": [
    "winlogbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Network Connection via MsXsl",
  "query": "event.category:network and event.type:connection and process.name:msxsl.exe and not destination.ip:(10.0.0.0/8 or 172.16.0.0/12 or 192.168.0.0/16)",
  "risk_score": 21,
  "rule_id": "b86afe07-0d98-4738-b15d-8d7465f95ff5",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1220",
          "name": "XSL Script Processing",
          "reference": "https://attack.mitre.org/techniques/T1220/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 3
}
