{
  "author": [
    "Elastic"
  ],
  "description": "Identifies a suspicious parent child process relationship with cmd.exe descending from PowerShell.exe.",
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "PowerShell spawning Cmd",
  "query": "event.category:process and event.type:(start or process_started) and process.parent.name:powershell.exe and process.name:cmd.exe",
  "risk_score": 21,
  "rule_id": "0f616aee-8161-4120-857e-742366f5eeb3",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1059",
          "name": "Command-Line Interface",
          "reference": "https://attack.mitre.org/techniques/T1059/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1086",
          "name": "PowerShell",
          "reference": "https://attack.mitre.org/techniques/T1086/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 3
}
