{
  "author": [
    "Elastic"
  ],
  "description": "Detects possible Denial of Service (DoS) attacks against an Okta organization. An adversary may attempt to disrupt an organization's business operations by performing a DoS attack against its Okta service.",
  "index": [
    "filebeat-*",
    "logs-okta*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Possible Okta DoS Attack",
  "note": "## Config\n\nThe Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
  "query": "event.dataset:okta.system and event.action:(application.integration.rate_limit_exceeded or system.org.rate_limit.warning or system.org.rate_limit.violation or core.concurrency.org.limit.violation)\n",
  "references": [
    "https://developer.okta.com/docs/reference/api/system-log/",
    "https://developer.okta.com/docs/reference/api/event-types/"
  ],
  "risk_score": 47,
  "rule_id": "e6e3ecff-03dd-48ec-acbd-54a04de10c68",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Identity",
    "Okta",
    "Continuous Monitoring",
    "SecOps",
    "Monitoring"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0040",
        "name": "Impact",
        "reference": "https://attack.mitre.org/tactics/TA0040/"
      },
      "technique": [
        {
          "id": "T1498",
          "name": "Network Denial of Service",
          "reference": "https://attack.mitre.org/techniques/T1498/"
        },
        {
          "id": "T1499",
          "name": "Endpoint Denial of Service",
          "reference": "https://attack.mitre.org/techniques/T1499/"
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 6
}
