{
  "author": [
    "Elastic"
  ],
  "description": "Identifies the execution of a file that was created by the virtual system process. This may indicate lateral movement via network file shares.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*",
    "winlogbeat-*",
    "logs-windows.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Remote Execution via File Shares",
  "query": "sequence with maxspan=1m\n  [file where event.type in (\"creation\", \"change\") and process.pid == 4 and file.extension : \"exe\"] by host.id, file.path\n  [process where event.type in (\"start\", \"process_started\")] by host.id, process.executable\n",
  "references": [
    "https://blog.menasec.net/2020/08/new-trick-to-detect-lateral-movement.html"
  ],
  "risk_score": 47,
  "rule_id": "ab75c24b-2502-43a0-bf7c-e60e662c811e",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Lateral Movement"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0008",
        "name": "Lateral Movement",
        "reference": "https://attack.mitre.org/tactics/TA0008/"
      },
      "technique": [
        {
          "id": "T1021",
          "name": "Remote Services",
          "reference": "https://attack.mitre.org/techniques/T1021/",
          "subtechnique": [
            {
              "id": "T1021.002",
              "name": "SMB/Windows Admin Shares",
              "reference": "https://attack.mitre.org/techniques/T1021/002/"
            }
          ]
        }
      ]
    }
  ],
  "type": "eql",
  "version": 2
}
