{
  "author": [
    "Elastic"
  ],
  "description": "Strace runs in a privileged context and can be used to escape restrictive environments by instantiating a shell in order to elevate privileges or move laterally.",
  "false_positives": [
    "Strace is a dual-use tool that can be used for benign or malicious activity. Some normal use of this command may originate from developers or SREs engaged in debugging or system call tracing."
  ],
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Strace Process Activity",
  "query": "event.category:process and event.type:(start or process_started) and process.name:strace\n",
  "references": [
    "https://en.wikipedia.org/wiki/Strace"
  ],
  "risk_score": 21,
  "rule_id": "d6450d4e-81c6-46a3-bd94-079886318ed5",
  "severity": "low",
  "tags": [
    "Elastic",
    "Host",
    "Linux",
    "Threat Detection"
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 7
}
