{
  "author": [
    "Elastic"
  ],
  "description": "Nping ran on a Linux host. Nping is part of the Nmap tool suite and has the ability to construct raw packets for a wide variety of security testing applications, including denial of service testing.",
  "false_positives": [
    "Some normal use of this command may originate from security engineers and network or server administrators, but this is usually not routine or unannounced. Use of `Nping` by non-engineers or ordinary users is uncommon."
  ],
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Nping Process Activity",
  "query": "event.category:process and event.type:(start or process_started) and process.name:nping",
  "references": [
    "https://en.wikipedia.org/wiki/Nmap"
  ],
  "risk_score": 47,
  "rule_id": "0d69150b-96f8-467c-a86d-a67a3378ce77",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Linux"
  ],
  "type": "query",
  "version": 4
}
