{
  "description": "Identifies file permission modifications in common writable directories by a non-root user. Adversaries often drop files or payloads into a writable directory and change permissions prior to execution.",
  "false_positives": [
    "Certain programs or applications may modify files or change ownership in writable directories. These can be exempted by username."
  ],
  "index": [
    "auditbeat-*"
  ],
  "language": "kuery",
  "name": "File Permission Modification in Writable Directory",
  "query": "event.action:executed and process.name:(chmod or chown or chattr or chgrp) and process.working_directory:(/tmp or /var/tmp or /dev/shm) and not user.name:root",
  "risk_score": 21,
  "rule_id": "9f9a2a82-93a8-4b1a-8778-1780895626d4",
  "severity": "low",
  "tags": [
    "Elastic",
    "Linux"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1222",
          "name": "File and Directory Permissions Modification",
          "reference": "https://attack.mitre.org/techniques/T1222/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
