{
  "author": [
    "Elastic"
  ],
  "description": "Iodine is a tool for tunneling Internet protocol version 4 (IPV4) traffic over the DNS protocol to circumvent firewalls, network security groups, and network access lists while evading detection.",
  "false_positives": [
    "Normal use of Iodine is uncommon apart from security testing and research. Use by non-security engineers is very uncommon."
  ],
  "index": [
    "auditbeat-*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Potential DNS Tunneling via Iodine",
  "query": "event.category:process and event.type:(start or process_started) and process.name:(iodine or iodined)",
  "references": [
    "https://code.kryo.se/iodine/"
  ],
  "risk_score": 73,
  "rule_id": "041d4d41-9589-43e2-ba13-5680af75ebc2",
  "severity": "high",
  "tags": [
    "Elastic",
    "Linux"
  ],
  "type": "query",
  "version": 3
}
