{
  "author": [
    "Elastic"
  ],
  "description": "This rule detects when Okta ThreatInsight identifies a request from a malicious IP address. Investigating requests from IP addresses identified as malicious by Okta ThreatInsight can help security teams monitor for and respond to credential based attacks against their organization, such as brute force and password spraying attacks.",
  "index": [
    "filebeat-*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Threat Detected by Okta ThreatInsight",
  "query": "event.module:okta and event.dataset:okta.system and event.action:security.threat.detected",
  "references": [
    "https://developer.okta.com/docs/reference/api/system-log/",
    "https://developer.okta.com/docs/reference/api/event-types/"
  ],
  "risk_score": 47,
  "rule_id": "6885d2ae-e008-4762-b98a-e8e1cd3a81e9",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Okta"
  ],
  "type": "query",
  "version": 1
}
