{
  "author": [
    "Elastic"
  ],
  "description": "Detects attempts to deactivate a rule within an Okta policy. An adversary may attempt to deactivate a rule within an Okta policy in order to remove or weaken an organization's security controls.",
  "false_positives": [
    "Consider adding exceptions to this rule to filter false positives if Okta MFA rules are regularly deactivated in your organization."
  ],
  "index": [
    "filebeat-*",
    "logs-okta*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Attempt to Deactivate an Okta Policy Rule",
  "note": "## Config\n\nThe Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
  "query": "event.dataset:okta.system and event.action:policy.rule.deactivate\n",
  "references": [
    "https://help.okta.com/en/prod/Content/Topics/Security/Security_Policies.htm",
    "https://developer.okta.com/docs/reference/api/system-log/",
    "https://developer.okta.com/docs/reference/api/event-types/"
  ],
  "risk_score": 47,
  "rule_id": "cc92c835-da92-45c9-9f29-b4992ad621a0",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Identity",
    "Okta",
    "Continuous Monitoring",
    "SecOps",
    "Identity and Access"
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 6
}
