{
  "author": [
    "Elastic"
  ],
  "description": "Identifies suspicious modifications of the calendar file by an unusual process. Adversaries may create a custom calendar notification procedure to execute a malicious program at a recurring interval to establish persistence.",
  "false_positives": [
    "Trusted applications for managing calendars and reminders."
  ],
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*",
    "auditbeat-*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Suspicious Calendar File Modification",
  "query": "event.category:file and event.action:modification and\n  file.path:/Users/*/Library/Calendars/*.calendar/Events/*.ics and\n  process.executable:\n  (* and not \n    (\n      /System/Library/* or \n      /System/Applications/Calendar.app/Contents/MacOS/* or \n      /usr/libexec/xpcproxy or \n      /sbin/launchd or \n      /Applications/*\n    )\n  )\n",
  "references": [
    "https://labs.f-secure.com/blog/operationalising-calendar-alerts-persistence-on-macos",
    "https://github.com/FSecureLABS/CalendarPersist",
    "https://github.com/D00MFist/PersistentJXA/blob/master/CalendarPersist.js"
  ],
  "risk_score": 47,
  "rule_id": "cb71aa62-55c8-42f0-b0dd-afb0bb0b1f51",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "macOS",
    "Threat Detection",
    "Persistence"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1546",
          "name": "Event Triggered Execution",
          "reference": "https://attack.mitre.org/techniques/T1546/"
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 1
}
