{
  "author": [
    "Elastic"
  ],
  "description": "Adversaries may create or modify launch daemons to repeatedly execute malicious payloads as part of persistence.",
  "false_positives": [
    "Trusted applications persisting via LaunchDaemons"
  ],
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "LaunchDaemon Creation or Modification and Immediate Loading",
  "query": "sequence by host.id with maxspan=1m\n [file where event.type != \"deletion\" and file.path in (\"/System/Library/LaunchDaemons/*\", \" /Library/LaunchDaemons/*\")]\n [process where event.type in (\"start\", \"process_started\") and process.name == \"launchctl\" and process.args == \"load\"]\n",
  "references": [
    "https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPSystemStartup/Chapters/CreatingLaunchdJobs.html"
  ],
  "risk_score": 21,
  "rule_id": "9d19ece6-c20e-481a-90c5-ccca596537de",
  "severity": "low",
  "tags": [
    "Elastic",
    "Host",
    "macOS",
    "Threat Detection",
    "Persistence"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1543",
          "name": "Create or Modify System Process",
          "reference": "https://attack.mitre.org/techniques/T1543/"
        }
      ]
    }
  ],
  "type": "eql",
  "version": 2
}
