{
  "author": [
    "Elastic"
  ],
  "description": "Identifies loadable kernel module errors, which are often indicative of potential persistence attempts.",
  "false_positives": [
    "Security tools and device drivers may run these programs in order to load legitimate kernel modules. Use of these programs by ordinary users is uncommon."
  ],
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Persistence via Kernel Module Modification",
  "query": "event.category:process and event.type:(start or process_started) and process.name:(insmod or kmod or modprobe or rmod)",
  "references": [
    "https://www.hackers-arise.com/single-post/2017/11/03/Linux-for-Hackers-Part-10-Loadable-Kernel-Modules-LKM"
  ],
  "risk_score": 21,
  "rule_id": "81cc58f5-8062-49a2-ba84-5cc4b4d31c40",
  "severity": "low",
  "tags": [
    "Elastic",
    "Linux"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1215",
          "name": "Kernel Modules and Extensions",
          "reference": "https://attack.mitre.org/techniques/T1215/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 4
}
