{
  "author": [
    "Elastic"
  ],
  "description": "Identifies suspicious commands executed via a web server, which may suggest a vulnerability and remote shell access.",
  "false_positives": [
    "Network monitoring or management products may have a web server component that runs shell commands as part of normal behavior."
  ],
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Potential Shell via Web Server",
  "query": "event.category:process and event.type:(start or process_started) and process.name:(bash or dash) and user.name:(apache or nginx or www or \"www-data\")",
  "references": [
    "https://pentestlab.blog/tag/web-shell/"
  ],
  "risk_score": 47,
  "rule_id": "231876e7-4d1f-4d63-a47c-47dd1acdc1cb",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Linux"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1100",
          "name": "Web Shell",
          "reference": "https://attack.mitre.org/techniques/T1100/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 5
}
