{
  "author": [
    "Elastic"
  ],
  "description": "Identifies potential hijacking of the Microsoft Update Orchestrator Service to establish persistence with an integrity level of SYSTEM.",
  "from": "now-9m",
  "index": [
    "winlogbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Persistence via Update Orchestrator Service Hijack",
  "query": "event.category:process and event.type:(start or process_started) and process.parent.name:svchost.exe and process.parent.args:(UsoSvc or usosvc) and not process.name:(UsoClient.exe or usoclient.exe or MusNotification.exe or musnotification.exe or MusNotificationUx.exe or musnotificationux.exe)",
  "references": [
    "https://github.com/irsl/CVE-2020-1313"
  ],
  "risk_score": 73,
  "rule_id": "265db8f5-fc73-4d0d-b434-6483b56372e2",
  "severity": "high",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Persistence"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1050",
          "name": "New Service",
          "reference": "https://attack.mitre.org/techniques/T1050/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 1
}
