{
  "author": [
    "Elastic"
  ],
  "description": "Detects writing executable files that will be automatically launched by Adobe on launch.",
  "from": "now-9m",
  "index": [
    "winlogbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "kuery",
  "license": "Elastic License",
  "name": "Adobe Hijack Persistence",
  "query": "event.category:file and event.type:creation and file.path:(\"C:\\Program Files (x86)\\Adobe\\Acrobat Reader DC\\Reader\\AcroCEF\\RdrCEF.exe\" or \"C:\\Program Files\\Adobe\\Acrobat Reader DC\\Reader\\AcroCEF\\RdrCEF.exe\") and not process.name:msiexec.exe",
  "risk_score": 21,
  "rule_id": "2bf78aa2-9c56-48de-b139-f169bf99cf86",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1044",
          "name": "File System Permissions Weakness",
          "reference": "https://attack.mitre.org/techniques/T1044/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 4
}
