{
  "author": [
    "Elastic"
  ],
  "description": "Detects the use of the chkconfig binary to manually add a service for management by chkconfig. Threat actors may utilize this technique to maintain persistence on a system. When a new service is added, chkconfig ensures that the service has either a start or a kill entry in every runlevel and when the system is rebooted the service file added will run providing long-term persistence.",
  "from": "now-9m",
  "index": [
    "logs-*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Chkconfig Service Add",
  "query": "process where event.type == \"start\" and\n   (process.executable : \"/usr/sbin/chkconfig\" and process.args : \"--add\") or\n   (process.args : \"*chkconfig\" and process.args : \"--add\")\n",
  "references": [
    "https://www.intezer.com/blog/research/lightning-framework-new-linux-threat/"
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.type",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.args",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.executable",
      "type": "keyword"
    }
  ],
  "risk_score": 47,
  "rule_id": "b910f25a-2d44-47f2-a873-aabdc0d355e6",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "Linux",
    "Threat Detection",
    "Persistence",
    "Lightning Framework"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1037",
          "name": "Boot or Logon Initialization Scripts",
          "reference": "https://attack.mitre.org/techniques/T1037/",
          "subtechnique": [
            {
              "id": "T1037.004",
              "name": "RC Scripts",
              "reference": "https://attack.mitre.org/techniques/T1037/004/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "eql",
  "version": 100
}
