{
  "author": [
    "Elastic"
  ],
  "description": "Authorization plugins are used to extend the authorization services API and implement mechanisms that are not natively supported by the OS, such as multi-factor authentication with third party software. Adversaries may abuse this feature to persist and/or collect clear text credentials as they traverse the registered plugins during user logon.",
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Authorization Plugin Modification",
  "query": "event.category:file and not event.type:deletion and\n  file.path:(/Library/Security/SecurityAgentPlugins/* and\n  not /Library/Security/SecurityAgentPlugins/TeamViewerAuthPlugin.bundle/Contents/*)\n",
  "references": [
    "https://developer.apple.com/documentation/security/authorization_plug-ins",
    "https://www.xorrior.com/persistent-credential-theft/"
  ],
  "risk_score": 47,
  "rule_id": "e6c98d38-633d-4b3e-9387-42112cd5ac10",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "macOS",
    "Threat Detection",
    "Persistence"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1547",
          "name": "Boot or Logon Autostart Execution",
          "reference": "https://attack.mitre.org/techniques/T1547/",
          "subtechnique": [
            {
              "id": "T1547.002",
              "name": "Authentication Package",
              "reference": "https://attack.mitre.org/techniques/T1547/002/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 1
}
