{
  "author": [
    "Elastic"
  ],
  "description": "Identifies the occurrence of a CyberArk Privileged Access Security (PAS) error level audit event. The event.code correlates to the CyberArk Vault Audit Action Code.",
  "false_positives": [
    "To tune this rule, add exceptions to exclude any event.code which should not trigger this rule."
  ],
  "from": "now-30m",
  "index": [
    "filebeat-*",
    "logs-cyberarkpas.audit*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "CyberArk Privileged Access Security Error",
  "note": "## Triage and analysis\n\nThis is a promotion rule for CyberArk error events, which are alertable events per the vendor.\nConsult vendor documentation on interpreting specific events.",
  "query": "event.dataset:cyberarkpas.audit and event.type:error\n",
  "references": [
    "https://docs.cyberark.com/Product-Doc/OnlineHelp/PAS/Latest/en/Content/PASREF/Vault%20Audit%20Action%20Codes.htm?tocpath=Administration%7CReferences%7C_____3"
  ],
  "related_integrations": [
    {
      "package": "cyberarkpas",
      "version": "^2.2.0"
    }
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.dataset",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.type",
      "type": "keyword"
    }
  ],
  "risk_score": 73,
  "rule_id": "3f0e5410-a4bf-4e8c-bcfc-79d67a285c54",
  "rule_name_override": "event.action",
  "setup": "The CyberArk Privileged Access Security (PAS) Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
  "severity": "high",
  "tags": [
    "Elastic",
    "cyberarkpas",
    "SecOps",
    "Log Auditing",
    "Threat Detection",
    "Privilege Escalation"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1078",
          "name": "Valid Accounts",
          "reference": "https://attack.mitre.org/techniques/T1078/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0001",
        "name": "Initial Access",
        "reference": "https://attack.mitre.org/tactics/TA0001/"
      },
      "technique": []
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 101
}
