{
  "author": [
    "Elastic"
  ],
  "description": "Identifies User Account Control (UAC) bypass via sdclt.exe. Attackers bypass UAC to stealthily execute code with elevated permissions.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*",
    "winlogbeat-*"
  ],
  "language": "eql",
  "license": "Elastic License",
  "name": "Bypass UAC via Sdclt",
  "query": "/* add winlogbeat-* when process.code_signature.* fields are populated */\n\nsequence with maxspan=1m\n  [process where event.type in (\"start\", \"process_started\") and process.name : \"sdclt.exe\" and\n     /* uncomment once in winlogbeat */\n     /* process.code_signature.subject_name == \"Microsoft Corporation\" and process.code_signature.trusted == true and */\n     process.args : \"/kickoffelev\"\n  ] by process.entity_id\n  [process where event.type in (\"start\", \"process_started\") and process.parent.name : \"sdclt.exe\" and\n     not (process.executable : \"C:\\\\Windows\\\\System32\\\\sdclt.exe\" or\n          process.executable : \"C:\\\\Windows\\\\System32\\\\control.exe\" or\n          process.executable : \"C:\\\\Windows\\\\SysWOW64\\\\sdclt.exe\" or\n          process.executable : \"C:\\\\Windows\\\\SysWOW64\\\\control.exe\")\n  ] by process.parent.entity_id\n",
  "risk_score": 21,
  "rule_id": "9b54e002-034a-47ac-9307-ad12c03fa900",
  "severity": "high",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Privilege Escalation"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1088",
          "name": "Bypass User Account Control",
          "reference": "https://attack.mitre.org/techniques/T1088/"
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
