{
  "author": [
    "Elastic"
  ],
  "description": "A sudoers file specifies the commands that users or groups can run and from which terminals. Adversaries can take advantage of these configurations to execute commands as other users or spawn processes with higher privileges.",
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Sudoers File Modification",
  "query": "event.category:file and event.type:change and file.path:(/etc/sudoers* or /private/etc/sudoers*)\n",
  "risk_score": 47,
  "rule_id": "931e25a5-0f5e-4ae0-ba0d-9e94eff7e3a4",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "Linux",
    "macOS",
    "Threat Detection",
    "Privilege Escalation"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1548",
          "name": "Abuse Elevation Control Mechanism",
          "reference": "https://attack.mitre.org/techniques/T1548/",
          "subtechnique": [
            {
              "id": "T1548.003",
              "name": "Sudo and Sudo Caching",
              "reference": "https://attack.mitre.org/techniques/T1548/003/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 7
}
