{
  "author": [
    "Elastic"
  ],
  "description": "This rule is triggered when indicators from the Threat Intel Filebeat module has a match against local file or network observations.",
  "from": "now-10m",
  "index": [
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "winlogbeat-*"
  ],
  "interval": "9m",
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Threat Intel Filebeat Module Indicator Match",
  "note": "## Triage and Analysis\n\nIf an indicator matches a local observation, the following enriched fields will be generated to identify the indicator, field, and type matched.\n\n- `threatintel.indicator.matched.atomic` - this identifies the atomic indicator that matched the local observation\n- `threatintel.indicator.matched.field` - this identifies the indicator field that matched the local observation\n- `threatintel.indicator.matched.type` - this identifies the indicator type that matched the local observation\n",
  "query": "file.hash.*:* or file.pe.imphash:* or source.ip:* or destination.ip:* or url.full:* or registry.path:*\n",
  "references": [
    "https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-threatintel.html"
  ],
  "risk_score": 99,
  "rule_id": "dc672cb7-d5df-4d1f-a6d7-0841b1caafb9",
  "severity": "critical",
  "tags": [
    "Elastic",
    "Windows",
    "Elastic Endgame",
    "Network",
    "Continuous Monitoring",
    "SecOps",
    "Monitoring"
  ],
  "threat_filters": [
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "disabled": false,
        "key": "event.module",
        "negate": false,
        "params": {
          "query": "threatintel"
        },
        "type": "phrase"
      },
      "query": {
        "match_phrase": {
          "event.module": "threatintel"
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "disabled": false,
        "key": "event.category",
        "negate": false,
        "params": {
          "query": "threat"
        },
        "type": "phrase"
      },
      "query": {
        "match_phrase": {
          "event.category": "threat"
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "disabled": false,
        "key": "event.kind",
        "negate": false,
        "params": {
          "query": "enrichment"
        },
        "type": "phrase"
      },
      "query": {
        "match_phrase": {
          "event.kind": "enrichment"
        }
      }
    },
    {
      "$state": {
        "store": "appState"
      },
      "meta": {
        "disabled": false,
        "key": "event.type",
        "negate": false,
        "params": {
          "query": "indicator"
        },
        "type": "phrase"
      },
      "query": {
        "match_phrase": {
          "event.type": "indicator"
        }
      }
    }
  ],
  "threat_index": [
    "filebeat-*"
  ],
  "threat_indicator_path": "",
  "threat_language": "kuery",
  "threat_mapping": [
    {
      "entries": [
        {
          "field": "file.hash.md5",
          "type": "mapping",
          "value": "threatintel.indicator.file.hash.md5"
        }
      ]
    },
    {
      "entries": [
        {
          "field": "file.hash.sha1",
          "type": "mapping",
          "value": "threatintel.indicator.file.hash.sha1"
        }
      ]
    },
    {
      "entries": [
        {
          "field": "file.hash.sha256",
          "type": "mapping",
          "value": "threatintel.indicator.file.hash.sha256"
        }
      ]
    },
    {
      "entries": [
        {
          "field": "file.pe.imphash",
          "type": "mapping",
          "value": "threatintel.indicator.file.pe.imphash"
        }
      ]
    },
    {
      "entries": [
        {
          "field": "source.ip",
          "type": "mapping",
          "value": "threatintel.indicator.ip"
        }
      ]
    },
    {
      "entries": [
        {
          "field": "destination.ip",
          "type": "mapping",
          "value": "threatintel.indicator.ip"
        }
      ]
    },
    {
      "entries": [
        {
          "field": "url.full",
          "type": "mapping",
          "value": "threatintel.indicator.url.full"
        }
      ]
    },
    {
      "entries": [
        {
          "field": "registry.path",
          "type": "mapping",
          "value": "threatintel.indicator.registry.path"
        }
      ]
    }
  ],
  "threat_query": "event.module:threatintel and (threatintel.indicator.file.hash.*:* or threatintel.indicator.file.pe.imphash:* or threatintel.indicator.ip:* or threatintel.indicator.registry.path:* or threatintel.indicator.url.full:*)",
  "timeline_id": "495ad7a7-316e-4544-8a0f-9c098daee76e",
  "timeline_title": "Generic Threat Match Timeline",
  "type": "threat_match",
  "version": 1
}
