{
  "description": "Identifies possibly suspicious activity using trusted Windows developer activity.",
  "false_positives": [
    "These programs may be used by Windows developers but use by non-engineers is unusual."
  ],
  "index": [
    "winlogbeat-*"
  ],
  "language": "kuery",
  "name": "Trusted Developer Application Usage",
  "query": "event.code:1 and process.name:(MSBuild.exe or msxsl.exe)",
  "risk_score": 21,
  "rule_id": "9d110cb3-5f4b-4c9a-b9f5-53f0a1707ae1",
  "severity": "low",
  "tags": [
    "Elastic",
    "Windows"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1127",
          "name": "Trusted Developer Utilities",
          "reference": "https://attack.mitre.org/techniques/T1127/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1127",
          "name": "Trusted Developer Utilities",
          "reference": "https://attack.mitre.org/techniques/T1127/"
        }
      ]
    }
  ],
  "type": "query",
  "version": 2
}
