{
  "name": "Query with a set of tags",
  "description": "Query with a set a tags",
  "rule_id": "tags-query",
  "risk_score": 1,
  "severity": "high",
  "type": "query",
  "query": "user.name: root or user.name: admin",
  "tags": ["tag_1", "tag_2"]
}
