{
  "name": "Query with a list",
  "description": "Query with a list. This rule should only produce signals when either host.name exists and event.module is system and user.name is zeek or gdm OR when host.name exists and event.module is not endgame or zeek or system.",
  "rule_id": "query-with-list",
  "risk_score": 2,
  "severity": "high",
  "type": "query",
  "query": "host.name: *",
  "interval": "30s",
  "language": "kuery",
  "exceptions_list": [
    {
      "field": "event.module",
      "values_operator": "excluded",
      "values_type": "match",
      "values": [
        {
          "name": "system"
        }
      ],
      "and": [
        {
          "field": "user.name",
          "values_operator": "excluded",
          "values_type": "match_all",
          "values": [
            {
              "name": "zeek"
            },
            {
              "name": "gdm"
            }
          ]
        }
      ]
    },
    {
      "field": "event.module",
      "values_operator": "included",
      "values_type": "match_all",
      "values": [
        {
          "name": "endgame"
        },
        {
          "name": "zeek"
        },
        {
          "name": "system"
        }
      ]
    }
  ]
}
