{"id":"8ddab7fb-e049-4502-908f-bd040274c1b6","updated_at":"2025-01-16T05:03:09.376Z","updated_by":"system_indices_superuser","created_at":"2025-01-16T05:03:09.376Z","created_by":"system_indices_superuser","name":"rule 1","tags":[],"interval":"5m","enabled":false,"revision":0,"description":"some description","risk_score":55,"severity":"high","license":"Elastic License v2","output_index":"","author":[],"false_positives":[],"from":"now-6m","rule_id":"rule_1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":true,"rule_source":{"type":"external","is_customized":false},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","query":"user.name: root or user.name: admin","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}