{
  "author": [
    "Elastic"
  ],
  "description": "A user has initiated a session impersonation granting them access to the environment with the permissions of the user they are impersonating. This would likely indicate Okta administrative access and should only ever occur if requested and expected.",
  "from": "now-30m",
  "index": [
    "filebeat-*",
    "logs-okta*"
  ],
  "interval": "15m",
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Okta User Session Impersonation",
  "note": "",
  "query": "event.dataset:okta.system and event.action:user.session.impersonation.initiate\n",
  "references": [
    "https://blog.cloudflare.com/cloudflare-investigation-of-the-january-2022-okta-compromise/"
  ],
  "related_integrations": [
    {
      "package": "okta",
      "version": "^1.3.0"
    }
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.action",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.dataset",
      "type": "keyword"
    }
  ],
  "risk_score": 73,
  "rule_id": "cdbebdc1-dc97-43c6-a538-f26a20c0a911",
  "setup": "The Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
  "severity": "high",
  "tags": [
    "Elastic",
    "Identity",
    "Okta",
    "Continuous Monitoring",
    "SecOps",
    "Identity and Access",
    "Credential Access"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": []
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 101
}
