{
  "author": [
    "Elastic"
  ],
  "description": "Windows Credential Manager allows you to create, view, or delete saved credentials for signing into websites, connected applications, and networks. An adversary may abuse this to list or dump credentials stored in the Credential Manager for saved usernames and passwords. This may also be performed in preparation of lateral movement.",
  "from": "now-9m",
  "index": [
    "winlogbeat-*",
    "logs-system.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Multiple Vault Web Credentials Read",
  "note": "",
  "query": "sequence by host.id, winlog.process.pid with maxspan=1s\n\n /* 2 consecutive vault reads from same pid for web creds */\n\n [any where event.code : \"5382\" and\n  (winlog.event_data.SchemaFriendlyName : \"Windows Web Password Credential\" or winlog.event_data.Resource : \"http*\") and\n  not winlog.event_data.SubjectLogonId : \"0x3e7\"]\n\n [any where event.code : \"5382\" and\n  (winlog.event_data.SchemaFriendlyName : \"Windows Web Password Credential\" or winlog.event_data.Resource : \"http*\") and\n  not winlog.event_data.SubjectLogonId : \"0x3e7\"]\n",
  "references": [
    "https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=5382"
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.code",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "host.id",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.Resource",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.SchemaFriendlyName",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.SubjectLogonId",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "winlog.process.pid",
      "type": "long"
    }
  ],
  "risk_score": 47,
  "rule_id": "44fc462c-1159-4fa8-b1b7-9b6296ab4f96",
  "setup": "If enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work.",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Credential Access"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1003",
          "name": "OS Credential Dumping",
          "reference": "https://attack.mitre.org/techniques/T1003/"
        },
        {
          "id": "T1555",
          "name": "Credentials from Password Stores",
          "reference": "https://attack.mitre.org/techniques/T1555/",
          "subtechnique": [
            {
              "id": "T1555.004",
              "name": "Windows Credential Manager",
              "reference": "https://attack.mitre.org/techniques/T1555/004/"
            }
          ]
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
