{
  "author": [
    "Elastic"
  ],
  "description": "Identifies the execution of a process with arguments pointing to known browser files that store passwords and cookies. Adversaries may acquire credentials from web browsers by reading files specific to the target browser.",
  "from": "now-9m",
  "index": [
    "auditbeat-*",
    "logs-endpoint.events.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Access of Stored Browser Credentials",
  "note": "",
  "query": "process where event.type in (\"start\", \"process_started\") and\n  process.args :\n    (\n      \"/Users/*/Library/Application Support/Google/Chrome/Default/Login Data\",\n      \"/Users/*/Library/Application Support/Google/Chrome/Default/Cookies\",\n      \"/Users/*/Library/Application Support/Google/Chrome/Profile*/Cookies\",\n      \"/Users/*/Library/Cookies*\",\n      \"/Users/*/Library/Application Support/Firefox/Profiles/*.default/cookies.sqlite\",\n      \"/Users/*/Library/Application Support/Firefox/Profiles/*.default/key*.db\",\n      \"/Users/*/Library/Application Support/Firefox/Profiles/*.default/logins.json\",\n      \"Login Data\",\n      \"Cookies.binarycookies\",\n      \"key4.db\",\n      \"key3.db\",\n      \"logins.json\",\n      \"cookies.sqlite\"\n    )\n",
  "references": [
    "https://securelist.com/calisto-trojan-for-macos/86543/"
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.type",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.args",
      "type": "keyword"
    }
  ],
  "risk_score": 73,
  "rule_id": "20457e4f-d1de-4b92-ae69-142e27a4342a",
  "setup": "If enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work.",
  "severity": "high",
  "tags": [
    "Elastic",
    "Host",
    "macOS",
    "Threat Detection",
    "Credential Access"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1539",
          "name": "Steal Web Session Cookie",
          "reference": "https://attack.mitre.org/techniques/T1539/"
        },
        {
          "id": "T1555",
          "name": "Credentials from Password Stores",
          "reference": "https://attack.mitre.org/techniques/T1555/",
          "subtechnique": [
            {
              "id": "T1555.003",
              "name": "Credentials from Web Browsers",
              "reference": "https://attack.mitre.org/techniques/T1555/003/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "eql",
  "version": 100
}
