{
  "author": [
    "Elastic"
  ],
  "description": "Indicates the creation and deletion of a scheduled task within a short time interval. Adversaries can use these to proxy malicious execution via the schedule service and perform clean up.",
  "false_positives": [
    "Legitimate scheduled tasks may be created during installation of new software."
  ],
  "from": "now-9m",
  "index": [
    "winlogbeat-*",
    "logs-system.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Temporarily Scheduled Task Creation",
  "query": "sequence by host.id, winlog.event_data.TaskName with maxspan=5m\n   [iam where event.action == \"scheduled-task-created\"]\n   [iam where event.action == \"scheduled-task-deleted\"]\n",
  "references": [
    "https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698"
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.action",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "host.id",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.TaskName",
      "type": "unknown"
    }
  ],
  "risk_score": 47,
  "rule_id": "81ff45f8-f8c2-4e28-992e-5a0e8d98e0fe",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Defense Evasion",
    "Persistence"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1070",
          "name": "Indicator Removal on Host",
          "reference": "https://attack.mitre.org/techniques/T1070/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1053",
          "name": "Scheduled Task/Job",
          "reference": "https://attack.mitre.org/techniques/T1053/",
          "subtechnique": [
            {
              "id": "T1053.005",
              "name": "Scheduled Task",
              "reference": "https://attack.mitre.org/techniques/T1053/005/"
            }
          ]
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1
}
