{
  "author": [
    "Elastic"
  ],
  "description": "Detects attempts to deactivate an Okta policy. An adversary may attempt to deactivate an Okta policy in order to weaken an organization's security controls. For example, an adversary may attempt to deactivate an Okta multi-factor authentication (MFA) policy in order to weaken the authentication requirements for user accounts.",
  "false_positives": [
    "If the behavior of deactivating Okta policies is expected, consider adding exceptions to this rule to filter false positives."
  ],
  "index": [
    "filebeat-*",
    "logs-okta*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Attempt to Deactivate an Okta Policy",
  "note": "",
  "query": "event.dataset:okta.system and event.action:policy.lifecycle.deactivate\n",
  "references": [
    "https://help.okta.com/en/prod/Content/Topics/Security/Security_Policies.htm",
    "https://developer.okta.com/docs/reference/api/system-log/",
    "https://developer.okta.com/docs/reference/api/event-types/"
  ],
  "related_integrations": [
    {
      "package": "okta",
      "version": "^1.3.0"
    }
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.action",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.dataset",
      "type": "keyword"
    }
  ],
  "risk_score": 21,
  "rule_id": "b719a170-3bdb-4141-b0e3-13e3cf627bfe",
  "setup": "The Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
  "severity": "low",
  "tags": [
    "Elastic",
    "Identity",
    "Okta",
    "Continuous Monitoring",
    "SecOps",
    "Monitoring",
    "Defense Evasion"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1562",
          "name": "Impair Defenses",
          "reference": "https://attack.mitre.org/techniques/T1562/",
          "subtechnique": [
            {
              "id": "T1562.007",
              "name": "Disable or Modify Cloud Firewall",
              "reference": "https://attack.mitre.org/techniques/T1562/007/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 101
}
