{
  "author": [
    "Elastic"
  ],
  "description": "Identifies the execution of a suspicious browser child process. Adversaries may gain access to a system through a user visiting a website over the normal course of browsing. With this technique, the user's web browser is typically targeted for exploitation.",
  "from": "now-9m",
  "index": [
    "logs-endpoint.events.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Suspicious Browser Child Process",
  "query": "process where event.type in (\"start\", \"process_started\") and\n  process.parent.name : (\"Google Chrome\", \"Google Chrome Helper*\", \"firefox\", \"Opera\", \"Safari\", \"com.apple.WebKit.WebContent\", \"Microsoft Edge\") and\n  process.name : (\"sh\", \"bash\", \"dash\", \"ksh\", \"tcsh\", \"zsh\", \"curl\", \"wget\", \"python*\", \"perl*\", \"php*\", \"osascript\", \"pwsh\") and\n  process.command_line != null and\n  not process.command_line : \"*/Library/Application Support/Microsoft/MAU*/Microsoft AutoUpdate.app/Contents/MacOS/msupdate*\" and\n  not process.args :\n    (\n      \"hw.model\",\n      \"IOPlatformExpertDevice\",\n      \"/Volumes/Google Chrome/Google Chrome.app/Contents/Frameworks/*/Resources/install.sh\",\n      \"--defaults-torrc\",\n      \"*Chrome.app\",\n      \"Framework.framework/Versions/*/Resources/keystone_promote_preflight.sh\",\n      \"/Users/*/Library/Application Support/Google/Chrome/recovery/*/ChromeRecovery\",\n      \"$DISPLAY\",\n      \"*GIO_LAUNCHED_DESKTOP_FILE_PID=$$*\",\n      \"/opt/homebrew/*\",\n      \"/usr/local/*brew*\"\n    )\n",
  "references": [
    "https://objective-see.com/blog/blog_0x43.html",
    "https://fr.slideshare.net/codeblue_jp/cb19-recent-apt-attack-on-crypto-exchange-employees-by-heungsoo-kang"
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.type",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.args",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.command_line",
      "type": "wildcard"
    },
    {
      "ecs": true,
      "name": "process.name",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "process.parent.name",
      "type": "keyword"
    }
  ],
  "risk_score": 73,
  "rule_id": "080bc66a-5d56-4d1f-8071-817671716db9",
  "severity": "high",
  "tags": [
    "Elastic",
    "Host",
    "macOS",
    "Threat Detection",
    "Initial Access",
    "Execution"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0002",
        "name": "Execution",
        "reference": "https://attack.mitre.org/tactics/TA0002/"
      },
      "technique": [
        {
          "id": "T1203",
          "name": "Exploitation for Client Execution",
          "reference": "https://attack.mitre.org/techniques/T1203/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0001",
        "name": "Initial Access",
        "reference": "https://attack.mitre.org/tactics/TA0001/"
      },
      "technique": [
        {
          "id": "T1189",
          "name": "Drive-by Compromise",
          "reference": "https://attack.mitre.org/techniques/T1189/"
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "eql",
  "version": 100
}
