{
  "author": [
    "Elastic"
  ],
  "description": "This rule helps you test and practice using alerts with Elastic Security as you get set up. It\u2019s not a sign of threat activity.",
  "enabled": false,
  "false_positives": [
    "This rule is not looking for threat activity. Disable the rule if you're already familiar with alerts."
  ],
  "from": "now-24h",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "interval": "24h",
  "language": "kuery",
  "license": "Elastic License v2",
  "max_signals": 1,
  "name": "My First Alert",
  "note": " \nThis is a test alert.\n\nThis alert does not show threat activity. Elastic created this alert to help you understand how alerts work.\n\nFor normal rules, the Investigation Guide will help analysts investigate alerts.\n\nThis alert will show once every 24 hours for each host. It is safe to disable this rule.\n",
  "query": "event.kind:\"event\"\n",
  "references": [
    "https://www.elastic.co/guide/en/security/current/prebuilt-rules.html"
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.kind",
      "type": "keyword"
    }
  ],
  "risk_score": 21,
  "rule_id": "a198fbbd-9413-45ec-a269-47ae4ccf59ce",
  "severity": "low",
  "tags": [
    "Elastic",
    "Example",
    "Guided Onboarding",
    "Network",
    "APM",
    "Windows",
    "Elastic Endgame"
  ],
  "threshold": {
    "field": [
      "host.name"
    ],
    "value": 1
  },
  "timestamp_override": "event.ingested",
  "type": "threshold",
  "version": 1
}
