{
  "author": [
    "Elastic"
  ],
  "description": "Identifies attempts to revoke an Okta API token. An adversary may attempt to revoke or delete an Okta API token to disrupt an organization's business operations.",
  "false_positives": [
    "If the behavior of revoking Okta API tokens is expected, consider adding exceptions to this rule to filter false positives."
  ],
  "index": [
    "filebeat-*",
    "logs-okta*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Attempt to Revoke Okta API Token",
  "note": "",
  "query": "event.dataset:okta.system and event.action:system.api_token.revoke\n",
  "references": [
    "https://developer.okta.com/docs/reference/api/system-log/",
    "https://developer.okta.com/docs/reference/api/event-types/"
  ],
  "related_integrations": [
    {
      "package": "okta",
      "version": "^1.3.0"
    }
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.action",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.dataset",
      "type": "keyword"
    }
  ],
  "risk_score": 21,
  "rule_id": "676cff2b-450b-4cf1-8ed2-c0c58a4a2dd7",
  "setup": "The Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
  "severity": "low",
  "tags": [
    "Elastic",
    "Identity",
    "Okta",
    "Continuous Monitoring",
    "SecOps",
    "Monitoring"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0040",
        "name": "Impact",
        "reference": "https://attack.mitre.org/tactics/TA0040/"
      },
      "technique": [
        {
          "id": "T1531",
          "name": "Account Access Removal",
          "reference": "https://attack.mitre.org/techniques/T1531/"
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 101
}
