{
  "author": [
    "Elastic"
  ],
  "description": "This rule detects when an unauthenticated user request is authorized within the cluster. Attackers may attempt to use anonymous accounts to gain initial access to the cluster or to avoid attribution of their activities within the cluster. This rule excludes the /healthz, /livez and /readyz endpoints which are commonly accessed anonymously.",
  "false_positives": [
    "Anonymous access to the API server is a dangerous setting enabled by default. Common anonymous connections (e.g., health checks) have been excluded from this rule. All other instances of authorized anonymous requests should be investigated."
  ],
  "index": [
    "logs-kubernetes.*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Kubernetes Anonymous Request Authorized",
  "note": "",
  "query": "kubernetes.audit.annotations.authorization_k8s_io/decision:\"allow\" \n  and (kubernetes.audit.user.username:(\"system:anonymous\" or \"system:unauthenticated\") or not kubernetes.audit.user.username:*)\n  and not kubernetes.audit.objectRef.resource:(\"healthz\" or \"livez\" or \"readyz\")\n",
  "references": [
    "https://media.defense.gov/2022/Aug/29/2003066362/-1/-1/0/CTR_KUBERNETES_HARDENING_GUIDANCE_1.2_20220829.PDF"
  ],
  "required_fields": [
    {
      "ecs": false,
      "name": "kubernetes.audit.annotations.authorization_k8s_io/decision",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.objectRef.resource",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.user.username",
      "type": "unknown"
    }
  ],
  "risk_score": 47,
  "rule_id": "63c057cc-339a-11ed-a261-0242ac120002",
  "setup": "The Kubernetes Fleet integration with Audit Logs enabled or similarly structured data is required to be compatible with this rule.",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Kubernetes",
    "Continuous Monitoring",
    "Execution",
    "Initial Access",
    "Defense Evasion"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0001",
        "name": "Initial Access",
        "reference": "https://attack.mitre.org/tactics/TA0001/"
      },
      "technique": [
        {
          "id": "T1078",
          "name": "Valid Accounts",
          "reference": "https://attack.mitre.org/techniques/T1078/",
          "subtechnique": [
            {
              "id": "T1078.001",
              "name": "Default Accounts",
              "reference": "https://attack.mitre.org/techniques/T1078/001/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 1
}
