{
  "author": [
    "Elastic"
  ],
  "description": "Identifies the remote update to a computer account's DnsHostName attribute. If the new value set is a valid domain controller DNS hostname and the subject computer name is not a domain controller, then it's highly likely a preparation step to exploit CVE-2022-26923 in an attempt to elevate privileges from a standard domain user to domain admin privileges.",
  "from": "now-9m",
  "index": [
    "winlogbeat-*",
    "logs-system.*"
  ],
  "language": "eql",
  "license": "Elastic License v2",
  "name": "Remote Computer Account DnsHostName Update",
  "query": "sequence by host.id with maxspan=5m\n\n  [authentication where event.action == \"logged-in\" and\n   winlog.logon.type == \"Network\" and event.outcome == \"success\" and\n   not user.name == \"ANONYMOUS LOGON\" and not winlog.event_data.SubjectUserName : \"*$\" and\n   not user.domain == \"NT AUTHORITY\" and source.ip != \"127.0.0.1\" and source.ip !=\"::1\"] by winlog.event_data.TargetLogonId\n\n  [iam where event.action == \"changed-computer-account\" and\n\n   /* if DnsHostName value equal a DC DNS hostname then it's highly suspicious */\n    winlog.event_data.DnsHostName : \"??*\"] by winlog.event_data.SubjectLogonId\n",
  "references": [
    "https://research.ifcr.dk/certifried-active-directory-domain-privilege-escalation-cve-2022-26923-9e098fe298f4",
    "https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2022-26923"
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.action",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "event.outcome",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "host.id",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "source.ip",
      "type": "ip"
    },
    {
      "ecs": true,
      "name": "user.domain",
      "type": "keyword"
    },
    {
      "ecs": true,
      "name": "user.name",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.DnsHostName",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.SubjectLogonId",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.SubjectUserName",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "winlog.event_data.TargetLogonId",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "winlog.logon.type",
      "type": "unknown"
    }
  ],
  "risk_score": 73,
  "rule_id": "6bed021a-0afb-461c-acbe-ffdb9574d3f3",
  "severity": "high",
  "tags": [
    "Elastic",
    "Host",
    "Windows",
    "Threat Detection",
    "Privilege Escalation",
    "Active Directory"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1068",
          "name": "Exploitation for Privilege Escalation",
          "reference": "https://attack.mitre.org/techniques/T1068/"
        },
        {
          "id": "T1078",
          "name": "Valid Accounts",
          "reference": "https://attack.mitre.org/techniques/T1078/",
          "subtechnique": [
            {
              "id": "T1078.002",
              "name": "Domain Accounts",
              "reference": "https://attack.mitre.org/techniques/T1078/002/"
            }
          ]
        }
      ]
    }
  ],
  "type": "eql",
  "version": 100
}
