{
  "author": [
    "Elastic"
  ],
  "description": "This rule detects a request to attach a controller service account to an existing or new pod running in the kube-system namespace. By default, controllers running as part of the API Server utilize admin-equivalent service accounts hosted in the kube-system namespace. Controller service accounts aren't normally assigned to running pods and could indicate adversary behavior within the cluster. An attacker that can create or modify pods or pod controllers in the kube-system namespace, can assign one of these admin-equivalent service accounts to a pod and abuse their powerful token to escalate privileges and gain complete cluster control.",
  "false_positives": [
    "Controller service accounts aren't normally assigned to running pods, this is abnormal behavior with very few legitimate use-cases and should result in very few false positives."
  ],
  "index": [
    "logs-kubernetes.*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Kubernetes Suspicious Assignment of Controller Service Account",
  "note": "",
  "query": "event.dataset : \"kubernetes.audit_logs\" and kubernetes.audit.verb : \"create\" \n  and kubernetes.audit.objectRef.resource : \"pods\"\n  and kubernetes.audit.objectRef.namespace : \"kube-system\"\n  and kubernetes.audit.requestObject.spec.serviceAccountName:*controller\n",
  "references": [
    "https://www.paloaltonetworks.com/apps/pan/public/downloadResource?pagePath=/content/pan/en_US/resources/whitepapers/kubernetes-privilege-escalation-excessive-permissions-in-popular-platforms"
  ],
  "related_integrations": [
    {
      "package": "kubernetes",
      "version": "^1.4.1"
    }
  ],
  "required_fields": [
    {
      "ecs": true,
      "name": "event.dataset",
      "type": "keyword"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.objectRef.namespace",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.objectRef.resource",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.requestObject.spec.serviceAccountName",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.verb",
      "type": "unknown"
    }
  ],
  "risk_score": 47,
  "rule_id": "63c05204-339a-11ed-a261-0242ac120002",
  "setup": "The Kubernetes Fleet integration with Audit Logs enabled or similarly structured data is required to be compatible with this rule.",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Kubernetes",
    "Continuous Monitoring",
    "Execution",
    "Privilege Escalation"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1078",
          "name": "Valid Accounts",
          "reference": "https://attack.mitre.org/techniques/T1078/",
          "subtechnique": [
            {
              "id": "T1078.001",
              "name": "Default Accounts",
              "reference": "https://attack.mitre.org/techniques/T1078/001/"
            }
          ]
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 2
}
