{
  "author": [
    "Elastic"
  ],
  "description": "This rule detects an attempt to create or modify a pod attached to the host PID namespace. HostPID allows a pod to access all the processes running on the host and could allow an attacker to take malicious action. When paired with ptrace this can be used to escalate privileges outside of the container. When paired with a privileged container, the pod can see all of the processes on the host. An attacker can enter the init system (PID 1) on the host. From there, they could execute a shell and continue to escalate privileges to root.",
  "false_positives": [
    "An administrator or developer may want to use a pod that runs as root and shares the host\ufffds IPC, Network, and PID namespaces for debugging purposes. If something is going wrong in the cluster and there is no easy way to SSH onto the host nodes directly, a privileged pod of this nature can be useful for viewing things like iptable rules and network namespaces from the host's perspective."
  ],
  "index": [
    "logs-kubernetes.*"
  ],
  "language": "kuery",
  "license": "Elastic License v2",
  "name": "Kubernetes Pod Created With HostPID",
  "note": "",
  "query": "kubernetes.audit.objectRef.resource:\"pods\" and kubernetes.audit.verb:(\"create\" or \"update\" or \"patch\") and kubernetes.audit.requestObject.spec.hostPID:true\n",
  "references": [
    "https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections",
    "https://kubernetes.io/docs/concepts/security/pod-security-policy/#host-namespaces",
    "https://bishopfox.com/blog/kubernetes-pod-privilege-escalation"
  ],
  "required_fields": [
    {
      "ecs": false,
      "name": "kubernetes.audit.objectRef.resource",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.requestObject.spec.hostPID",
      "type": "unknown"
    },
    {
      "ecs": false,
      "name": "kubernetes.audit.verb",
      "type": "unknown"
    }
  ],
  "risk_score": 47,
  "rule_id": "df7fda76-c92b-4943-bc68-04460a5ea5ba",
  "setup": "The Kubernetes Fleet integration with Audit Logs enabled or similarly structured data is required to be compatible with this rule.",
  "severity": "medium",
  "tags": [
    "Elastic",
    "Kubernetes",
    "Continuous Monitoring",
    "Execution",
    "Privilege Escalation"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1611",
          "name": "Escape to Host",
          "reference": "https://attack.mitre.org/techniques/T1611/"
        }
      ]
    }
  ],
  "timestamp_override": "event.ingested",
  "type": "query",
  "version": 100
}
