{
  "name": "Queries single id",
  "description": "Finds only one id below to create a single signal. Change the query to your exact _id you want to test with",
  "risk_score": 1,
  "rule_id": "query_single_id",
  "severity": "high",
  "type": "query",
  "from": "now-1d",
  "interval": "30s",
  "to": "now",
  "query": "_id: sQevtW8BvLT8jmu5l0TA",
  "enabled": true
}
